/* automatically generated by rust-bindgen 0.72.1 */

#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const vr_k_nSteamVRVersionMajor: u32 = 2;
pub const vr_k_nSteamVRVersionMinor: u32 = 12;
pub const vr_k_nSteamVRVersionBuild: u32 = 14;
pub type vr_PropertyTypeTag_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdMatrix34_t {
    pub m: [[f32; 4usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdMatrix34_t"][::std::mem::size_of::<vr_HmdMatrix34_t>() - 48usize];
    ["Alignment of vr_HmdMatrix34_t"][::std::mem::align_of::<vr_HmdMatrix34_t>() - 4usize];
    ["Offset of field: vr_HmdMatrix34_t::m"][::std::mem::offset_of!(vr_HmdMatrix34_t, m) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdMatrix33_t {
    pub m: [[f32; 3usize]; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdMatrix33_t"][::std::mem::size_of::<vr_HmdMatrix33_t>() - 36usize];
    ["Alignment of vr_HmdMatrix33_t"][::std::mem::align_of::<vr_HmdMatrix33_t>() - 4usize];
    ["Offset of field: vr_HmdMatrix33_t::m"][::std::mem::offset_of!(vr_HmdMatrix33_t, m) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdMatrix44_t {
    pub m: [[f32; 4usize]; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdMatrix44_t"][::std::mem::size_of::<vr_HmdMatrix44_t>() - 64usize];
    ["Alignment of vr_HmdMatrix44_t"][::std::mem::align_of::<vr_HmdMatrix44_t>() - 4usize];
    ["Offset of field: vr_HmdMatrix44_t::m"][::std::mem::offset_of!(vr_HmdMatrix44_t, m) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdVector3_t {
    pub v: [f32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdVector3_t"][::std::mem::size_of::<vr_HmdVector3_t>() - 12usize];
    ["Alignment of vr_HmdVector3_t"][::std::mem::align_of::<vr_HmdVector3_t>() - 4usize];
    ["Offset of field: vr_HmdVector3_t::v"][::std::mem::offset_of!(vr_HmdVector3_t, v) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdVector4_t {
    pub v: [f32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdVector4_t"][::std::mem::size_of::<vr_HmdVector4_t>() - 16usize];
    ["Alignment of vr_HmdVector4_t"][::std::mem::align_of::<vr_HmdVector4_t>() - 4usize];
    ["Offset of field: vr_HmdVector4_t::v"][::std::mem::offset_of!(vr_HmdVector4_t, v) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdVector3d_t {
    pub v: [f64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdVector3d_t"][::std::mem::size_of::<vr_HmdVector3d_t>() - 24usize];
    ["Alignment of vr_HmdVector3d_t"][::std::mem::align_of::<vr_HmdVector3d_t>() - 8usize];
    ["Offset of field: vr_HmdVector3d_t::v"][::std::mem::offset_of!(vr_HmdVector3d_t, v) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdVector2_t {
    pub v: [f32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdVector2_t"][::std::mem::size_of::<vr_HmdVector2_t>() - 8usize];
    ["Alignment of vr_HmdVector2_t"][::std::mem::align_of::<vr_HmdVector2_t>() - 4usize];
    ["Offset of field: vr_HmdVector2_t::v"][::std::mem::offset_of!(vr_HmdVector2_t, v) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdQuaternion_t {
    pub w: f64,
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdQuaternion_t"][::std::mem::size_of::<vr_HmdQuaternion_t>() - 32usize];
    ["Alignment of vr_HmdQuaternion_t"][::std::mem::align_of::<vr_HmdQuaternion_t>() - 8usize];
    ["Offset of field: vr_HmdQuaternion_t::w"]
        [::std::mem::offset_of!(vr_HmdQuaternion_t, w) - 0usize];
    ["Offset of field: vr_HmdQuaternion_t::x"]
        [::std::mem::offset_of!(vr_HmdQuaternion_t, x) - 8usize];
    ["Offset of field: vr_HmdQuaternion_t::y"]
        [::std::mem::offset_of!(vr_HmdQuaternion_t, y) - 16usize];
    ["Offset of field: vr_HmdQuaternion_t::z"]
        [::std::mem::offset_of!(vr_HmdQuaternion_t, z) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdQuaternionf_t {
    pub w: f32,
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdQuaternionf_t"][::std::mem::size_of::<vr_HmdQuaternionf_t>() - 16usize];
    ["Alignment of vr_HmdQuaternionf_t"][::std::mem::align_of::<vr_HmdQuaternionf_t>() - 4usize];
    ["Offset of field: vr_HmdQuaternionf_t::w"]
        [::std::mem::offset_of!(vr_HmdQuaternionf_t, w) - 0usize];
    ["Offset of field: vr_HmdQuaternionf_t::x"]
        [::std::mem::offset_of!(vr_HmdQuaternionf_t, x) - 4usize];
    ["Offset of field: vr_HmdQuaternionf_t::y"]
        [::std::mem::offset_of!(vr_HmdQuaternionf_t, y) - 8usize];
    ["Offset of field: vr_HmdQuaternionf_t::z"]
        [::std::mem::offset_of!(vr_HmdQuaternionf_t, z) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdColor_t {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdColor_t"][::std::mem::size_of::<vr_HmdColor_t>() - 16usize];
    ["Alignment of vr_HmdColor_t"][::std::mem::align_of::<vr_HmdColor_t>() - 4usize];
    ["Offset of field: vr_HmdColor_t::r"][::std::mem::offset_of!(vr_HmdColor_t, r) - 0usize];
    ["Offset of field: vr_HmdColor_t::g"][::std::mem::offset_of!(vr_HmdColor_t, g) - 4usize];
    ["Offset of field: vr_HmdColor_t::b"][::std::mem::offset_of!(vr_HmdColor_t, b) - 8usize];
    ["Offset of field: vr_HmdColor_t::a"][::std::mem::offset_of!(vr_HmdColor_t, a) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdQuad_t {
    pub vCorners: [vr_HmdVector3_t; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdQuad_t"][::std::mem::size_of::<vr_HmdQuad_t>() - 48usize];
    ["Alignment of vr_HmdQuad_t"][::std::mem::align_of::<vr_HmdQuad_t>() - 4usize];
    ["Offset of field: vr_HmdQuad_t::vCorners"]
        [::std::mem::offset_of!(vr_HmdQuad_t, vCorners) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HmdRect2_t {
    pub vTopLeft: vr_HmdVector2_t,
    pub vBottomRight: vr_HmdVector2_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HmdRect2_t"][::std::mem::size_of::<vr_HmdRect2_t>() - 16usize];
    ["Alignment of vr_HmdRect2_t"][::std::mem::align_of::<vr_HmdRect2_t>() - 4usize];
    ["Offset of field: vr_HmdRect2_t::vTopLeft"]
        [::std::mem::offset_of!(vr_HmdRect2_t, vTopLeft) - 0usize];
    ["Offset of field: vr_HmdRect2_t::vBottomRight"]
        [::std::mem::offset_of!(vr_HmdRect2_t, vBottomRight) - 8usize];
};
#[doc = " Holds the transform for a single bone"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRBoneTransform_t {
    pub position: vr_HmdVector4_t,
    pub orientation: vr_HmdQuaternionf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRBoneTransform_t"][::std::mem::size_of::<vr_VRBoneTransform_t>() - 32usize];
    ["Alignment of vr_VRBoneTransform_t"][::std::mem::align_of::<vr_VRBoneTransform_t>() - 4usize];
    ["Offset of field: vr_VRBoneTransform_t::position"]
        [::std::mem::offset_of!(vr_VRBoneTransform_t, position) - 0usize];
    ["Offset of field: vr_VRBoneTransform_t::orientation"]
        [::std::mem::offset_of!(vr_VRBoneTransform_t, orientation) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREyeTrackingData_t {
    pub bActive: bool,
    pub bValid: bool,
    pub bTracked: bool,
    pub vGazeOrigin: vr_HmdVector3_t,
    pub vGazeTarget: vr_HmdVector3_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREyeTrackingData_t"][::std::mem::size_of::<vr_VREyeTrackingData_t>() - 28usize];
    ["Alignment of vr_VREyeTrackingData_t"]
        [::std::mem::align_of::<vr_VREyeTrackingData_t>() - 4usize];
    ["Offset of field: vr_VREyeTrackingData_t::bActive"]
        [::std::mem::offset_of!(vr_VREyeTrackingData_t, bActive) - 0usize];
    ["Offset of field: vr_VREyeTrackingData_t::bValid"]
        [::std::mem::offset_of!(vr_VREyeTrackingData_t, bValid) - 1usize];
    ["Offset of field: vr_VREyeTrackingData_t::bTracked"]
        [::std::mem::offset_of!(vr_VREyeTrackingData_t, bTracked) - 2usize];
    ["Offset of field: vr_VREyeTrackingData_t::vGazeOrigin"]
        [::std::mem::offset_of!(vr_VREyeTrackingData_t, vGazeOrigin) - 4usize];
    ["Offset of field: vr_VREyeTrackingData_t::vGazeTarget"]
        [::std::mem::offset_of!(vr_VREyeTrackingData_t, vGazeTarget) - 16usize];
};
#[doc = " Used to return the post-distortion UVs for each color channel.\n UVs range from 0 to 1 with 0,0 in the upper left corner of the\n source render target. The 0,0 to 1,1 range covers a single eye."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_DistortionCoordinates_t {
    pub rfRed: [f32; 2usize],
    pub rfGreen: [f32; 2usize],
    pub rfBlue: [f32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_DistortionCoordinates_t"]
        [::std::mem::size_of::<vr_DistortionCoordinates_t>() - 24usize];
    ["Alignment of vr_DistortionCoordinates_t"]
        [::std::mem::align_of::<vr_DistortionCoordinates_t>() - 4usize];
    ["Offset of field: vr_DistortionCoordinates_t::rfRed"]
        [::std::mem::offset_of!(vr_DistortionCoordinates_t, rfRed) - 0usize];
    ["Offset of field: vr_DistortionCoordinates_t::rfGreen"]
        [::std::mem::offset_of!(vr_DistortionCoordinates_t, rfGreen) - 8usize];
    ["Offset of field: vr_DistortionCoordinates_t::rfBlue"]
        [::std::mem::offset_of!(vr_DistortionCoordinates_t, rfBlue) - 16usize];
};
pub const vr_EVREye_Eye_Left: vr_EVREye = 0;
pub const vr_EVREye_Eye_Right: vr_EVREye = 1;
pub type vr_EVREye = ::std::os::raw::c_uint;
pub const vr_ETextureType_TextureType_Invalid: vr_ETextureType = -1;
pub const vr_ETextureType_TextureType_DirectX: vr_ETextureType = 0;
pub const vr_ETextureType_TextureType_OpenGL: vr_ETextureType = 1;
pub const vr_ETextureType_TextureType_Vulkan: vr_ETextureType = 2;
pub const vr_ETextureType_TextureType_IOSurface: vr_ETextureType = 3;
pub const vr_ETextureType_TextureType_DirectX12: vr_ETextureType = 4;
pub const vr_ETextureType_TextureType_DXGISharedHandle: vr_ETextureType = 5;
pub const vr_ETextureType_TextureType_Metal: vr_ETextureType = 6;
pub const vr_ETextureType_TextureType_Reserved: vr_ETextureType = 7;
pub const vr_ETextureType_TextureType_SharedTextureHandle: vr_ETextureType = 8;
pub type vr_ETextureType = ::std::os::raw::c_int;
pub const vr_EColorSpace_ColorSpace_Auto: vr_EColorSpace = 0;
pub const vr_EColorSpace_ColorSpace_Gamma: vr_EColorSpace = 1;
pub const vr_EColorSpace_ColorSpace_Linear: vr_EColorSpace = 2;
pub type vr_EColorSpace = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_Texture_t {
    pub handle: *mut ::std::os::raw::c_void,
    pub eType: vr_ETextureType,
    pub eColorSpace: vr_EColorSpace,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_Texture_t"][::std::mem::size_of::<vr_Texture_t>() - 16usize];
    ["Alignment of vr_Texture_t"][::std::mem::align_of::<vr_Texture_t>() - 8usize];
    ["Offset of field: vr_Texture_t::handle"]
        [::std::mem::offset_of!(vr_Texture_t, handle) - 0usize];
    ["Offset of field: vr_Texture_t::eType"][::std::mem::offset_of!(vr_Texture_t, eType) - 8usize];
    ["Offset of field: vr_Texture_t::eColorSpace"]
        [::std::mem::offset_of!(vr_Texture_t, eColorSpace) - 12usize];
};
#[doc = " Allows the application to control what part of the provided texture will be used in the\n frame buffer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRTextureBounds_t {
    pub uMin: f32,
    pub vMin: f32,
    pub uMax: f32,
    pub vMax: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRTextureBounds_t"][::std::mem::size_of::<vr_VRTextureBounds_t>() - 16usize];
    ["Alignment of vr_VRTextureBounds_t"][::std::mem::align_of::<vr_VRTextureBounds_t>() - 4usize];
    ["Offset of field: vr_VRTextureBounds_t::uMin"]
        [::std::mem::offset_of!(vr_VRTextureBounds_t, uMin) - 0usize];
    ["Offset of field: vr_VRTextureBounds_t::vMin"]
        [::std::mem::offset_of!(vr_VRTextureBounds_t, vMin) - 4usize];
    ["Offset of field: vr_VRTextureBounds_t::uMax"]
        [::std::mem::offset_of!(vr_VRTextureBounds_t, uMax) - 8usize];
    ["Offset of field: vr_VRTextureBounds_t::vMax"]
        [::std::mem::offset_of!(vr_VRTextureBounds_t, vMax) - 12usize];
};
#[doc = " Allows specifying pose used to render provided scene texture (if different from value returned by WaitGetPoses)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRTextureWithPose_t {
    pub _base: vr_Texture_t,
    pub mDeviceToAbsoluteTracking: vr_HmdMatrix34_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRTextureWithPose_t"][::std::mem::size_of::<vr_VRTextureWithPose_t>() - 64usize];
    ["Alignment of vr_VRTextureWithPose_t"]
        [::std::mem::align_of::<vr_VRTextureWithPose_t>() - 8usize];
    ["Offset of field: vr_VRTextureWithPose_t::mDeviceToAbsoluteTracking"]
        [::std::mem::offset_of!(vr_VRTextureWithPose_t, mDeviceToAbsoluteTracking) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRTextureDepthInfo_t {
    pub handle: *mut ::std::os::raw::c_void,
    pub mProjection: vr_HmdMatrix44_t,
    pub vRange: vr_HmdVector2_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRTextureDepthInfo_t"][::std::mem::size_of::<vr_VRTextureDepthInfo_t>() - 80usize];
    ["Alignment of vr_VRTextureDepthInfo_t"]
        [::std::mem::align_of::<vr_VRTextureDepthInfo_t>() - 8usize];
    ["Offset of field: vr_VRTextureDepthInfo_t::handle"]
        [::std::mem::offset_of!(vr_VRTextureDepthInfo_t, handle) - 0usize];
    ["Offset of field: vr_VRTextureDepthInfo_t::mProjection"]
        [::std::mem::offset_of!(vr_VRTextureDepthInfo_t, mProjection) - 8usize];
    ["Offset of field: vr_VRTextureDepthInfo_t::vRange"]
        [::std::mem::offset_of!(vr_VRTextureDepthInfo_t, vRange) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRTextureWithDepth_t {
    pub _base: vr_Texture_t,
    pub depth: vr_VRTextureDepthInfo_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRTextureWithDepth_t"][::std::mem::size_of::<vr_VRTextureWithDepth_t>() - 96usize];
    ["Alignment of vr_VRTextureWithDepth_t"]
        [::std::mem::align_of::<vr_VRTextureWithDepth_t>() - 8usize];
    ["Offset of field: vr_VRTextureWithDepth_t::depth"]
        [::std::mem::offset_of!(vr_VRTextureWithDepth_t, depth) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRTextureWithPoseAndDepth_t {
    pub _base: vr_VRTextureWithPose_t,
    pub depth: vr_VRTextureDepthInfo_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRTextureWithPoseAndDepth_t"]
        [::std::mem::size_of::<vr_VRTextureWithPoseAndDepth_t>() - 144usize];
    ["Alignment of vr_VRTextureWithPoseAndDepth_t"]
        [::std::mem::align_of::<vr_VRTextureWithPoseAndDepth_t>() - 8usize];
    ["Offset of field: vr_VRTextureWithPoseAndDepth_t::depth"]
        [::std::mem::offset_of!(vr_VRTextureWithPoseAndDepth_t, depth) - 64usize];
};
pub type vr_vrshared_uint64_t = u64;
pub type vr_vrshared_double = f64;
pub const vr_MaxDmabufPlaneCount: u32 = 4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_DmabufPlane_t {
    pub unOffset: u32,
    pub unStride: u32,
    pub nFd: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_DmabufPlane_t"][::std::mem::size_of::<vr_DmabufPlane_t>() - 12usize];
    ["Alignment of vr_DmabufPlane_t"][::std::mem::align_of::<vr_DmabufPlane_t>() - 4usize];
    ["Offset of field: vr_DmabufPlane_t::unOffset"]
        [::std::mem::offset_of!(vr_DmabufPlane_t, unOffset) - 0usize];
    ["Offset of field: vr_DmabufPlane_t::unStride"]
        [::std::mem::offset_of!(vr_DmabufPlane_t, unStride) - 4usize];
    ["Offset of field: vr_DmabufPlane_t::nFd"]
        [::std::mem::offset_of!(vr_DmabufPlane_t, nFd) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_DmabufAttributes_t {
    pub pNext: *mut ::std::os::raw::c_void,
    pub unWidth: u32,
    pub unHeight: u32,
    pub unDepth: u32,
    pub unMipLevels: u32,
    pub unArrayLayers: u32,
    pub unSampleCount: u32,
    pub unFormat: u32,
    pub ulModifier: u64,
    pub unPlaneCount: u32,
    pub plane: [vr_DmabufPlane_t; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_DmabufAttributes_t"][::std::mem::size_of::<vr_DmabufAttributes_t>() - 104usize];
    ["Alignment of vr_DmabufAttributes_t"]
        [::std::mem::align_of::<vr_DmabufAttributes_t>() - 8usize];
    ["Offset of field: vr_DmabufAttributes_t::pNext"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, pNext) - 0usize];
    ["Offset of field: vr_DmabufAttributes_t::unWidth"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unWidth) - 8usize];
    ["Offset of field: vr_DmabufAttributes_t::unHeight"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unHeight) - 12usize];
    ["Offset of field: vr_DmabufAttributes_t::unDepth"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unDepth) - 16usize];
    ["Offset of field: vr_DmabufAttributes_t::unMipLevels"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unMipLevels) - 20usize];
    ["Offset of field: vr_DmabufAttributes_t::unArrayLayers"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unArrayLayers) - 24usize];
    ["Offset of field: vr_DmabufAttributes_t::unSampleCount"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unSampleCount) - 28usize];
    ["Offset of field: vr_DmabufAttributes_t::unFormat"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unFormat) - 32usize];
    ["Offset of field: vr_DmabufAttributes_t::ulModifier"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, ulModifier) - 40usize];
    ["Offset of field: vr_DmabufAttributes_t::unPlaneCount"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, unPlaneCount) - 48usize];
    ["Offset of field: vr_DmabufAttributes_t::plane"]
        [::std::mem::offset_of!(vr_DmabufAttributes_t, plane) - 52usize];
};
#[doc = " A handle for a spatial anchor.  This handle is only valid during the session it was created in.\n Anchors that live beyond one session should be saved by their string descriptors."]
pub type vr_SpatialAnchorHandle_t = u32;
pub type vr_glSharedTextureHandle_t = *mut ::std::os::raw::c_void;
pub type vr_glInt_t = i32;
pub type vr_glUInt_t = u32;
pub type vr_SharedTextureHandle_t = u64;
pub const vr_ETrackingResult_TrackingResult_Uninitialized: vr_ETrackingResult = 1;
pub const vr_ETrackingResult_TrackingResult_Calibrating_InProgress: vr_ETrackingResult = 100;
pub const vr_ETrackingResult_TrackingResult_Calibrating_OutOfRange: vr_ETrackingResult = 101;
pub const vr_ETrackingResult_TrackingResult_Running_OK: vr_ETrackingResult = 200;
pub const vr_ETrackingResult_TrackingResult_Running_OutOfRange: vr_ETrackingResult = 201;
pub const vr_ETrackingResult_TrackingResult_Fallback_RotationOnly: vr_ETrackingResult = 300;
pub type vr_ETrackingResult = ::std::os::raw::c_uint;
pub type vr_DriverId_t = u32;
pub const vr_k_nDriverNone: u32 = 4294967295;
pub const vr_k_unMaxDriverDebugResponseSize: u32 = 32768;
#[doc = " Used to pass device IDs to API calls"]
pub type vr_TrackedDeviceIndex_t = u32;
pub const vr_k_unTrackedDeviceIndex_Hmd: u32 = 0;
pub const vr_k_unMaxTrackedDeviceCount: u32 = 64;
pub const vr_k_unTrackedDeviceIndexOther: u32 = 4294967294;
pub const vr_k_unTrackedDeviceIndexInvalid: u32 = 4294967295;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_Invalid: vr_ETrackedDeviceClass = 0;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_HMD: vr_ETrackedDeviceClass = 1;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_Controller: vr_ETrackedDeviceClass = 2;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_GenericTracker: vr_ETrackedDeviceClass = 3;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_TrackingReference: vr_ETrackedDeviceClass = 4;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_DisplayRedirect: vr_ETrackedDeviceClass = 5;
pub const vr_ETrackedDeviceClass_TrackedDeviceClass_Max: vr_ETrackedDeviceClass = 6;
#[doc = " Describes what kind of object is being tracked at a given ID"]
pub type vr_ETrackedDeviceClass = ::std::os::raw::c_uint;
pub const vr_ETrackedControllerRole_TrackedControllerRole_Invalid: vr_ETrackedControllerRole = 0;
pub const vr_ETrackedControllerRole_TrackedControllerRole_LeftHand: vr_ETrackedControllerRole = 1;
pub const vr_ETrackedControllerRole_TrackedControllerRole_RightHand: vr_ETrackedControllerRole = 2;
pub const vr_ETrackedControllerRole_TrackedControllerRole_OptOut: vr_ETrackedControllerRole = 3;
pub const vr_ETrackedControllerRole_TrackedControllerRole_Treadmill: vr_ETrackedControllerRole = 4;
pub const vr_ETrackedControllerRole_TrackedControllerRole_Stylus: vr_ETrackedControllerRole = 5;
pub const vr_ETrackedControllerRole_TrackedControllerRole_Max: vr_ETrackedControllerRole = 5;
#[doc = " Describes what specific role associated with a tracked device"]
pub type vr_ETrackedControllerRole = ::std::os::raw::c_uint;
#[doc = " describes a single pose for a tracked object"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_TrackedDevicePose_t {
    pub mDeviceToAbsoluteTracking: vr_HmdMatrix34_t,
    pub vVelocity: vr_HmdVector3_t,
    pub vAngularVelocity: vr_HmdVector3_t,
    pub eTrackingResult: vr_ETrackingResult,
    pub bPoseIsValid: bool,
    pub bDeviceIsConnected: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_TrackedDevicePose_t"][::std::mem::size_of::<vr_TrackedDevicePose_t>() - 80usize];
    ["Alignment of vr_TrackedDevicePose_t"]
        [::std::mem::align_of::<vr_TrackedDevicePose_t>() - 4usize];
    ["Offset of field: vr_TrackedDevicePose_t::mDeviceToAbsoluteTracking"]
        [::std::mem::offset_of!(vr_TrackedDevicePose_t, mDeviceToAbsoluteTracking) - 0usize];
    ["Offset of field: vr_TrackedDevicePose_t::vVelocity"]
        [::std::mem::offset_of!(vr_TrackedDevicePose_t, vVelocity) - 48usize];
    ["Offset of field: vr_TrackedDevicePose_t::vAngularVelocity"]
        [::std::mem::offset_of!(vr_TrackedDevicePose_t, vAngularVelocity) - 60usize];
    ["Offset of field: vr_TrackedDevicePose_t::eTrackingResult"]
        [::std::mem::offset_of!(vr_TrackedDevicePose_t, eTrackingResult) - 72usize];
    ["Offset of field: vr_TrackedDevicePose_t::bPoseIsValid"]
        [::std::mem::offset_of!(vr_TrackedDevicePose_t, bPoseIsValid) - 76usize];
    ["Offset of field: vr_TrackedDevicePose_t::bDeviceIsConnected"]
        [::std::mem::offset_of!(vr_TrackedDevicePose_t, bDeviceIsConnected) - 77usize];
};
pub const vr_ETrackingUniverseOrigin_TrackingUniverseSeated: vr_ETrackingUniverseOrigin = 0;
pub const vr_ETrackingUniverseOrigin_TrackingUniverseStanding: vr_ETrackingUniverseOrigin = 1;
pub const vr_ETrackingUniverseOrigin_TrackingUniverseRawAndUncalibrated:
    vr_ETrackingUniverseOrigin = 2;
#[doc = " Identifies which style of tracking origin the application wants to use\n for the poses it is requesting"]
pub type vr_ETrackingUniverseOrigin = ::std::os::raw::c_uint;
pub const vr_EAdditionalRadioFeatures_AdditionalRadioFeatures_None: vr_EAdditionalRadioFeatures = 0;
pub const vr_EAdditionalRadioFeatures_AdditionalRadioFeatures_HTCLinkBox:
    vr_EAdditionalRadioFeatures = 1;
pub const vr_EAdditionalRadioFeatures_AdditionalRadioFeatures_InternalDongle:
    vr_EAdditionalRadioFeatures = 2;
pub const vr_EAdditionalRadioFeatures_AdditionalRadioFeatures_ExternalDongle:
    vr_EAdditionalRadioFeatures = 4;
pub type vr_EAdditionalRadioFeatures = ::std::os::raw::c_uint;
pub type vr_WebConsoleHandle_t = u64;
pub type vr_PropertyContainerHandle_t = u64;
pub const vr_k_ulInvalidPropertyContainer: vr_PropertyContainerHandle_t = 0;
pub const vr_k_unInvalidPropertyTag: vr_PropertyTypeTag_t = 0;
pub type vr_DriverHandle_t = vr_PropertyContainerHandle_t;
pub const vr_k_ulInvalidDriverHandle: vr_PropertyContainerHandle_t = 0;
pub const vr_k_unFloatPropertyTag: vr_PropertyTypeTag_t = 1;
pub const vr_k_unInt32PropertyTag: vr_PropertyTypeTag_t = 2;
pub const vr_k_unUint64PropertyTag: vr_PropertyTypeTag_t = 3;
pub const vr_k_unBoolPropertyTag: vr_PropertyTypeTag_t = 4;
pub const vr_k_unStringPropertyTag: vr_PropertyTypeTag_t = 5;
pub const vr_k_unErrorPropertyTag: vr_PropertyTypeTag_t = 6;
pub const vr_k_unDoublePropertyTag: vr_PropertyTypeTag_t = 7;
pub const vr_k_unHmdMatrix34PropertyTag: vr_PropertyTypeTag_t = 20;
pub const vr_k_unHmdMatrix44PropertyTag: vr_PropertyTypeTag_t = 21;
pub const vr_k_unHmdVector3PropertyTag: vr_PropertyTypeTag_t = 22;
pub const vr_k_unHmdVector4PropertyTag: vr_PropertyTypeTag_t = 23;
pub const vr_k_unHmdVector2PropertyTag: vr_PropertyTypeTag_t = 24;
pub const vr_k_unHmdQuadPropertyTag: vr_PropertyTypeTag_t = 25;
pub const vr_k_unHiddenAreaPropertyTag: vr_PropertyTypeTag_t = 30;
pub const vr_k_unPathHandleInfoTag: vr_PropertyTypeTag_t = 31;
pub const vr_k_unActionPropertyTag: vr_PropertyTypeTag_t = 32;
pub const vr_k_unInputValuePropertyTag: vr_PropertyTypeTag_t = 33;
pub const vr_k_unWildcardPropertyTag: vr_PropertyTypeTag_t = 34;
pub const vr_k_unHapticVibrationPropertyTag: vr_PropertyTypeTag_t = 35;
pub const vr_k_unSkeletonPropertyTag: vr_PropertyTypeTag_t = 36;
pub const vr_k_unSpatialAnchorPosePropertyTag: vr_PropertyTypeTag_t = 40;
pub const vr_k_unJsonPropertyTag: vr_PropertyTypeTag_t = 41;
pub const vr_k_unActiveActionSetPropertyTag: vr_PropertyTypeTag_t = 42;
pub const vr_k_unOpenVRInternalReserved_Start: vr_PropertyTypeTag_t = 1000;
pub const vr_k_unOpenVRInternalReserved_End: vr_PropertyTypeTag_t = 10000;
pub const vr_ETrackedDeviceProperty_Prop_Invalid: vr_ETrackedDeviceProperty = 0;
pub const vr_ETrackedDeviceProperty_Prop_TrackingSystemName_String: vr_ETrackedDeviceProperty =
    1000;
pub const vr_ETrackedDeviceProperty_Prop_ModelNumber_String: vr_ETrackedDeviceProperty = 1001;
pub const vr_ETrackedDeviceProperty_Prop_SerialNumber_String: vr_ETrackedDeviceProperty = 1002;
pub const vr_ETrackedDeviceProperty_Prop_RenderModelName_String: vr_ETrackedDeviceProperty = 1003;
pub const vr_ETrackedDeviceProperty_Prop_WillDriftInYaw_Bool: vr_ETrackedDeviceProperty = 1004;
pub const vr_ETrackedDeviceProperty_Prop_ManufacturerName_String: vr_ETrackedDeviceProperty = 1005;
pub const vr_ETrackedDeviceProperty_Prop_TrackingFirmwareVersion_String: vr_ETrackedDeviceProperty =
    1006;
pub const vr_ETrackedDeviceProperty_Prop_HardwareRevision_String: vr_ETrackedDeviceProperty = 1007;
pub const vr_ETrackedDeviceProperty_Prop_AllWirelessDongleDescriptions_String:
    vr_ETrackedDeviceProperty = 1008;
pub const vr_ETrackedDeviceProperty_Prop_ConnectedWirelessDongle_String: vr_ETrackedDeviceProperty =
    1009;
pub const vr_ETrackedDeviceProperty_Prop_DeviceIsWireless_Bool: vr_ETrackedDeviceProperty = 1010;
pub const vr_ETrackedDeviceProperty_Prop_DeviceIsCharging_Bool: vr_ETrackedDeviceProperty = 1011;
pub const vr_ETrackedDeviceProperty_Prop_DeviceBatteryPercentage_Float: vr_ETrackedDeviceProperty =
    1012;
pub const vr_ETrackedDeviceProperty_Prop_StatusDisplayTransform_Matrix34:
    vr_ETrackedDeviceProperty = 1013;
pub const vr_ETrackedDeviceProperty_Prop_Firmware_UpdateAvailable_Bool: vr_ETrackedDeviceProperty =
    1014;
pub const vr_ETrackedDeviceProperty_Prop_Firmware_ManualUpdate_Bool: vr_ETrackedDeviceProperty =
    1015;
pub const vr_ETrackedDeviceProperty_Prop_Firmware_ManualUpdateURL_String:
    vr_ETrackedDeviceProperty = 1016;
pub const vr_ETrackedDeviceProperty_Prop_HardwareRevision_Uint64: vr_ETrackedDeviceProperty = 1017;
pub const vr_ETrackedDeviceProperty_Prop_FirmwareVersion_Uint64: vr_ETrackedDeviceProperty = 1018;
pub const vr_ETrackedDeviceProperty_Prop_FPGAVersion_Uint64: vr_ETrackedDeviceProperty = 1019;
pub const vr_ETrackedDeviceProperty_Prop_VRCVersion_Uint64: vr_ETrackedDeviceProperty = 1020;
pub const vr_ETrackedDeviceProperty_Prop_RadioVersion_Uint64: vr_ETrackedDeviceProperty = 1021;
pub const vr_ETrackedDeviceProperty_Prop_DongleVersion_Uint64: vr_ETrackedDeviceProperty = 1022;
pub const vr_ETrackedDeviceProperty_Prop_BlockServerShutdown_Bool: vr_ETrackedDeviceProperty = 1023;
pub const vr_ETrackedDeviceProperty_Prop_CanUnifyCoordinateSystemWithHmd_Bool:
    vr_ETrackedDeviceProperty = 1024;
pub const vr_ETrackedDeviceProperty_Prop_ContainsProximitySensor_Bool: vr_ETrackedDeviceProperty =
    1025;
pub const vr_ETrackedDeviceProperty_Prop_DeviceProvidesBatteryStatus_Bool:
    vr_ETrackedDeviceProperty = 1026;
pub const vr_ETrackedDeviceProperty_Prop_DeviceCanPowerOff_Bool: vr_ETrackedDeviceProperty = 1027;
pub const vr_ETrackedDeviceProperty_Prop_Firmware_ProgrammingTarget_String:
    vr_ETrackedDeviceProperty = 1028;
pub const vr_ETrackedDeviceProperty_Prop_DeviceClass_Int32: vr_ETrackedDeviceProperty = 1029;
pub const vr_ETrackedDeviceProperty_Prop_HasCamera_Bool: vr_ETrackedDeviceProperty = 1030;
pub const vr_ETrackedDeviceProperty_Prop_DriverVersion_String: vr_ETrackedDeviceProperty = 1031;
pub const vr_ETrackedDeviceProperty_Prop_Firmware_ForceUpdateRequired_Bool:
    vr_ETrackedDeviceProperty = 1032;
pub const vr_ETrackedDeviceProperty_Prop_ViveSystemButtonFixRequired_Bool:
    vr_ETrackedDeviceProperty = 1033;
pub const vr_ETrackedDeviceProperty_Prop_ParentDriver_Uint64: vr_ETrackedDeviceProperty = 1034;
pub const vr_ETrackedDeviceProperty_Prop_ResourceRoot_String: vr_ETrackedDeviceProperty = 1035;
pub const vr_ETrackedDeviceProperty_Prop_RegisteredDeviceType_String: vr_ETrackedDeviceProperty =
    1036;
pub const vr_ETrackedDeviceProperty_Prop_InputProfilePath_String: vr_ETrackedDeviceProperty = 1037;
pub const vr_ETrackedDeviceProperty_Prop_NeverTracked_Bool: vr_ETrackedDeviceProperty = 1038;
pub const vr_ETrackedDeviceProperty_Prop_NumCameras_Int32: vr_ETrackedDeviceProperty = 1039;
pub const vr_ETrackedDeviceProperty_Prop_CameraFrameLayout_Int32: vr_ETrackedDeviceProperty = 1040;
pub const vr_ETrackedDeviceProperty_Prop_CameraStreamFormat_Int32: vr_ETrackedDeviceProperty = 1041;
pub const vr_ETrackedDeviceProperty_Prop_AdditionalDeviceSettingsPath_String:
    vr_ETrackedDeviceProperty = 1042;
pub const vr_ETrackedDeviceProperty_Prop_Identifiable_Bool: vr_ETrackedDeviceProperty = 1043;
pub const vr_ETrackedDeviceProperty_Prop_BootloaderVersion_Uint64: vr_ETrackedDeviceProperty = 1044;
pub const vr_ETrackedDeviceProperty_Prop_AdditionalSystemReportData_String:
    vr_ETrackedDeviceProperty = 1045;
pub const vr_ETrackedDeviceProperty_Prop_CompositeFirmwareVersion_String:
    vr_ETrackedDeviceProperty = 1046;
pub const vr_ETrackedDeviceProperty_Prop_Firmware_RemindUpdate_Bool: vr_ETrackedDeviceProperty =
    1047;
pub const vr_ETrackedDeviceProperty_Prop_PeripheralApplicationVersion_Uint64:
    vr_ETrackedDeviceProperty = 1048;
pub const vr_ETrackedDeviceProperty_Prop_ManufacturerSerialNumber_String:
    vr_ETrackedDeviceProperty = 1049;
pub const vr_ETrackedDeviceProperty_Prop_ComputedSerialNumber_String: vr_ETrackedDeviceProperty =
    1050;
pub const vr_ETrackedDeviceProperty_Prop_EstimatedDeviceFirstUseTime_Int32:
    vr_ETrackedDeviceProperty = 1051;
pub const vr_ETrackedDeviceProperty_Prop_DevicePowerUsage_Float: vr_ETrackedDeviceProperty = 1052;
pub const vr_ETrackedDeviceProperty_Prop_IgnoreMotionForStandby_Bool: vr_ETrackedDeviceProperty =
    1053;
pub const vr_ETrackedDeviceProperty_Prop_ActualTrackingSystemName_String:
    vr_ETrackedDeviceProperty = 1054;
pub const vr_ETrackedDeviceProperty_Prop_AllowCameraToggle_Bool: vr_ETrackedDeviceProperty = 1055;
pub const vr_ETrackedDeviceProperty_Prop_AllowLightSourceFrequency_Bool: vr_ETrackedDeviceProperty =
    1056;
pub const vr_ETrackedDeviceProperty_Prop_SteamRemoteClientID_Uint64: vr_ETrackedDeviceProperty =
    1057;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_1058: vr_ETrackedDeviceProperty = 1058;
pub const vr_ETrackedDeviceProperty_Prop_ReportsTimeSinceVSync_Bool: vr_ETrackedDeviceProperty =
    2000;
pub const vr_ETrackedDeviceProperty_Prop_SecondsFromVsyncToPhotons_Float:
    vr_ETrackedDeviceProperty = 2001;
pub const vr_ETrackedDeviceProperty_Prop_DisplayFrequency_Float: vr_ETrackedDeviceProperty = 2002;
pub const vr_ETrackedDeviceProperty_Prop_UserIpdMeters_Float: vr_ETrackedDeviceProperty = 2003;
pub const vr_ETrackedDeviceProperty_Prop_CurrentUniverseId_Uint64: vr_ETrackedDeviceProperty = 2004;
pub const vr_ETrackedDeviceProperty_Prop_PreviousUniverseId_Uint64: vr_ETrackedDeviceProperty =
    2005;
pub const vr_ETrackedDeviceProperty_Prop_DisplayFirmwareVersion_Uint64: vr_ETrackedDeviceProperty =
    2006;
pub const vr_ETrackedDeviceProperty_Prop_IsOnDesktop_Bool: vr_ETrackedDeviceProperty = 2007;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCType_Int32: vr_ETrackedDeviceProperty = 2008;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCOffset_Float: vr_ETrackedDeviceProperty = 2009;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCScale_Float: vr_ETrackedDeviceProperty = 2010;
pub const vr_ETrackedDeviceProperty_Prop_EdidVendorID_Int32: vr_ETrackedDeviceProperty = 2011;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCImageLeft_String: vr_ETrackedDeviceProperty =
    2012;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCImageRight_String: vr_ETrackedDeviceProperty =
    2013;
pub const vr_ETrackedDeviceProperty_Prop_DisplayGCBlackClamp_Float: vr_ETrackedDeviceProperty =
    2014;
pub const vr_ETrackedDeviceProperty_Prop_EdidProductID_Int32: vr_ETrackedDeviceProperty = 2015;
pub const vr_ETrackedDeviceProperty_Prop_CameraToHeadTransform_Matrix34: vr_ETrackedDeviceProperty =
    2016;
pub const vr_ETrackedDeviceProperty_Prop_DisplayGCType_Int32: vr_ETrackedDeviceProperty = 2017;
pub const vr_ETrackedDeviceProperty_Prop_DisplayGCOffset_Float: vr_ETrackedDeviceProperty = 2018;
pub const vr_ETrackedDeviceProperty_Prop_DisplayGCScale_Float: vr_ETrackedDeviceProperty = 2019;
pub const vr_ETrackedDeviceProperty_Prop_DisplayGCPrescale_Float: vr_ETrackedDeviceProperty = 2020;
pub const vr_ETrackedDeviceProperty_Prop_DisplayGCImage_String: vr_ETrackedDeviceProperty = 2021;
pub const vr_ETrackedDeviceProperty_Prop_LensCenterLeftU_Float: vr_ETrackedDeviceProperty = 2022;
pub const vr_ETrackedDeviceProperty_Prop_LensCenterLeftV_Float: vr_ETrackedDeviceProperty = 2023;
pub const vr_ETrackedDeviceProperty_Prop_LensCenterRightU_Float: vr_ETrackedDeviceProperty = 2024;
pub const vr_ETrackedDeviceProperty_Prop_LensCenterRightV_Float: vr_ETrackedDeviceProperty = 2025;
pub const vr_ETrackedDeviceProperty_Prop_UserHeadToEyeDepthMeters_Float: vr_ETrackedDeviceProperty =
    2026;
pub const vr_ETrackedDeviceProperty_Prop_CameraFirmwareVersion_Uint64: vr_ETrackedDeviceProperty =
    2027;
pub const vr_ETrackedDeviceProperty_Prop_CameraFirmwareDescription_String:
    vr_ETrackedDeviceProperty = 2028;
pub const vr_ETrackedDeviceProperty_Prop_DisplayFPGAVersion_Uint64: vr_ETrackedDeviceProperty =
    2029;
pub const vr_ETrackedDeviceProperty_Prop_DisplayBootloaderVersion_Uint64:
    vr_ETrackedDeviceProperty = 2030;
pub const vr_ETrackedDeviceProperty_Prop_DisplayHardwareVersion_Uint64: vr_ETrackedDeviceProperty =
    2031;
pub const vr_ETrackedDeviceProperty_Prop_AudioFirmwareVersion_Uint64: vr_ETrackedDeviceProperty =
    2032;
pub const vr_ETrackedDeviceProperty_Prop_CameraCompatibilityMode_Int32: vr_ETrackedDeviceProperty =
    2033;
pub const vr_ETrackedDeviceProperty_Prop_ScreenshotHorizontalFieldOfViewDegrees_Float:
    vr_ETrackedDeviceProperty = 2034;
pub const vr_ETrackedDeviceProperty_Prop_ScreenshotVerticalFieldOfViewDegrees_Float:
    vr_ETrackedDeviceProperty = 2035;
pub const vr_ETrackedDeviceProperty_Prop_DisplaySuppressed_Bool: vr_ETrackedDeviceProperty = 2036;
pub const vr_ETrackedDeviceProperty_Prop_DisplayAllowNightMode_Bool: vr_ETrackedDeviceProperty =
    2037;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCImageWidth_Int32: vr_ETrackedDeviceProperty =
    2038;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCImageHeight_Int32: vr_ETrackedDeviceProperty =
    2039;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCImageNumChannels_Int32:
    vr_ETrackedDeviceProperty = 2040;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMCImageData_Binary: vr_ETrackedDeviceProperty =
    2041;
pub const vr_ETrackedDeviceProperty_Prop_SecondsFromPhotonsToVblank_Float:
    vr_ETrackedDeviceProperty = 2042;
pub const vr_ETrackedDeviceProperty_Prop_DriverDirectModeSendsVsyncEvents_Bool:
    vr_ETrackedDeviceProperty = 2043;
pub const vr_ETrackedDeviceProperty_Prop_DisplayDebugMode_Bool: vr_ETrackedDeviceProperty = 2044;
pub const vr_ETrackedDeviceProperty_Prop_GraphicsAdapterLuid_Uint64: vr_ETrackedDeviceProperty =
    2045;
pub const vr_ETrackedDeviceProperty_Prop_DriverProvidedChaperonePath_String:
    vr_ETrackedDeviceProperty = 2048;
pub const vr_ETrackedDeviceProperty_Prop_ExpectedTrackingReferenceCount_Int32:
    vr_ETrackedDeviceProperty = 2049;
pub const vr_ETrackedDeviceProperty_Prop_ExpectedControllerCount_Int32: vr_ETrackedDeviceProperty =
    2050;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathControllerLeftDeviceOff_String:
    vr_ETrackedDeviceProperty = 2051;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathControllerRightDeviceOff_String:
    vr_ETrackedDeviceProperty = 2052;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathTrackingReferenceDeviceOff_String:
    vr_ETrackedDeviceProperty = 2053;
pub const vr_ETrackedDeviceProperty_Prop_DoNotApplyPrediction_Bool: vr_ETrackedDeviceProperty =
    2054;
pub const vr_ETrackedDeviceProperty_Prop_CameraToHeadTransforms_Matrix34_Array:
    vr_ETrackedDeviceProperty = 2055;
pub const vr_ETrackedDeviceProperty_Prop_DistortionMeshResolution_Int32: vr_ETrackedDeviceProperty =
    2056;
pub const vr_ETrackedDeviceProperty_Prop_DriverIsDrawingControllers_Bool:
    vr_ETrackedDeviceProperty = 2057;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestsApplicationPause_Bool:
    vr_ETrackedDeviceProperty = 2058;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestsReducedRendering_Bool:
    vr_ETrackedDeviceProperty = 2059;
pub const vr_ETrackedDeviceProperty_Prop_MinimumIpdStepMeters_Float: vr_ETrackedDeviceProperty =
    2060;
pub const vr_ETrackedDeviceProperty_Prop_AudioBridgeFirmwareVersion_Uint64:
    vr_ETrackedDeviceProperty = 2061;
pub const vr_ETrackedDeviceProperty_Prop_ImageBridgeFirmwareVersion_Uint64:
    vr_ETrackedDeviceProperty = 2062;
pub const vr_ETrackedDeviceProperty_Prop_ImuToHeadTransform_Matrix34: vr_ETrackedDeviceProperty =
    2063;
pub const vr_ETrackedDeviceProperty_Prop_ImuFactoryGyroBias_Vector3: vr_ETrackedDeviceProperty =
    2064;
pub const vr_ETrackedDeviceProperty_Prop_ImuFactoryGyroScale_Vector3: vr_ETrackedDeviceProperty =
    2065;
pub const vr_ETrackedDeviceProperty_Prop_ImuFactoryAccelerometerBias_Vector3:
    vr_ETrackedDeviceProperty = 2066;
pub const vr_ETrackedDeviceProperty_Prop_ImuFactoryAccelerometerScale_Vector3:
    vr_ETrackedDeviceProperty = 2067;
pub const vr_ETrackedDeviceProperty_Prop_ConfigurationIncludesLighthouse20Features_Bool:
    vr_ETrackedDeviceProperty = 2069;
pub const vr_ETrackedDeviceProperty_Prop_AdditionalRadioFeatures_Uint64: vr_ETrackedDeviceProperty =
    2070;
pub const vr_ETrackedDeviceProperty_Prop_CameraWhiteBalance_Vector4_Array:
    vr_ETrackedDeviceProperty = 2071;
pub const vr_ETrackedDeviceProperty_Prop_CameraDistortionFunction_Int32_Array:
    vr_ETrackedDeviceProperty = 2072;
pub const vr_ETrackedDeviceProperty_Prop_CameraDistortionCoefficients_Float_Array:
    vr_ETrackedDeviceProperty = 2073;
pub const vr_ETrackedDeviceProperty_Prop_ExpectedControllerType_String: vr_ETrackedDeviceProperty =
    2074;
pub const vr_ETrackedDeviceProperty_Prop_HmdTrackingStyle_Int32: vr_ETrackedDeviceProperty = 2075;
pub const vr_ETrackedDeviceProperty_Prop_DriverProvidedChaperoneVisibility_Bool:
    vr_ETrackedDeviceProperty = 2076;
pub const vr_ETrackedDeviceProperty_Prop_HmdColumnCorrectionSettingPrefix_String:
    vr_ETrackedDeviceProperty = 2077;
pub const vr_ETrackedDeviceProperty_Prop_CameraSupportsCompatibilityModes_Bool:
    vr_ETrackedDeviceProperty = 2078;
pub const vr_ETrackedDeviceProperty_Prop_SupportsRoomViewDepthProjection_Bool:
    vr_ETrackedDeviceProperty = 2079;
pub const vr_ETrackedDeviceProperty_Prop_DisplayAvailableFrameRates_Float_Array:
    vr_ETrackedDeviceProperty = 2080;
pub const vr_ETrackedDeviceProperty_Prop_DisplaySupportsMultipleFramerates_Bool:
    vr_ETrackedDeviceProperty = 2081;
pub const vr_ETrackedDeviceProperty_Prop_DisplayColorMultLeft_Vector3: vr_ETrackedDeviceProperty =
    2082;
pub const vr_ETrackedDeviceProperty_Prop_DisplayColorMultRight_Vector3: vr_ETrackedDeviceProperty =
    2083;
pub const vr_ETrackedDeviceProperty_Prop_DisplaySupportsRuntimeFramerateChange_Bool:
    vr_ETrackedDeviceProperty = 2084;
pub const vr_ETrackedDeviceProperty_Prop_DisplaySupportsAnalogGain_Bool: vr_ETrackedDeviceProperty =
    2085;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMinAnalogGain_Float: vr_ETrackedDeviceProperty =
    2086;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMaxAnalogGain_Float: vr_ETrackedDeviceProperty =
    2087;
pub const vr_ETrackedDeviceProperty_Prop_CameraExposureTime_Float: vr_ETrackedDeviceProperty = 2088;
pub const vr_ETrackedDeviceProperty_Prop_CameraGlobalGain_Float: vr_ETrackedDeviceProperty = 2089;
pub const vr_ETrackedDeviceProperty_Prop_DashboardScale_Float: vr_ETrackedDeviceProperty = 2091;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsHDR10_Bool: vr_ETrackedDeviceProperty = 2093;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_EnableParallelRenderCameras_Bool:
    vr_ETrackedDeviceProperty = 2094;
pub const vr_ETrackedDeviceProperty_Prop_DriverProvidedChaperoneJson_String:
    vr_ETrackedDeviceProperty = 2095;
pub const vr_ETrackedDeviceProperty_Prop_ForceSystemLayerUseAppPoses_Bool:
    vr_ETrackedDeviceProperty = 2096;
pub const vr_ETrackedDeviceProperty_Prop_DashboardLinkSupport_Int32: vr_ETrackedDeviceProperty =
    2097;
pub const vr_ETrackedDeviceProperty_Prop_DisplayMinUIAnalogGain_Float: vr_ETrackedDeviceProperty =
    2098;
pub const vr_ETrackedDeviceProperty_Prop_IpdUIRangeMinMeters_Float: vr_ETrackedDeviceProperty =
    2100;
pub const vr_ETrackedDeviceProperty_Prop_IpdUIRangeMaxMeters_Float: vr_ETrackedDeviceProperty =
    2101;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsHDCP14LegacyCompat_Bool:
    vr_ETrackedDeviceProperty = 2102;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsMicMonitoring_Bool: vr_ETrackedDeviceProperty =
    2103;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsDisplayPortTrainingMode_Bool:
    vr_ETrackedDeviceProperty = 2104;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsRoomViewDirect_Bool:
    vr_ETrackedDeviceProperty = 2105;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsAppThrottling_Bool: vr_ETrackedDeviceProperty =
    2106;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_SupportsGpuBusMonitoring_Bool:
    vr_ETrackedDeviceProperty = 2107;
pub const vr_ETrackedDeviceProperty_Prop_DriverDisplaysIPDChanges_Bool: vr_ETrackedDeviceProperty =
    2108;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_2110: vr_ETrackedDeviceProperty = 2110;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_2111: vr_ETrackedDeviceProperty = 2111;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_2112: vr_ETrackedDeviceProperty = 2112;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_MaxDistortedTextureWidth_Int32:
    vr_ETrackedDeviceProperty = 2113;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_MaxDistortedTextureHeight_Int32:
    vr_ETrackedDeviceProperty = 2114;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_AllowSupersampleFiltering_Bool:
    vr_ETrackedDeviceProperty = 2115;
pub const vr_ETrackedDeviceProperty_Prop_Hmd_AllowsClientToControlTextureIndex:
    vr_ETrackedDeviceProperty = 2116;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_2117: vr_ETrackedDeviceProperty = 2117;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraCorrectionMode_Int32:
    vr_ETrackedDeviceProperty = 2200;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_InnerLeft_Int32:
    vr_ETrackedDeviceProperty = 2201;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_InnerRight_Int32:
    vr_ETrackedDeviceProperty = 2202;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_InnerTop_Int32:
    vr_ETrackedDeviceProperty = 2203;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_InnerBottom_Int32:
    vr_ETrackedDeviceProperty = 2204;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_OuterLeft_Int32:
    vr_ETrackedDeviceProperty = 2205;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_OuterRight_Int32:
    vr_ETrackedDeviceProperty = 2206;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_OuterTop_Int32:
    vr_ETrackedDeviceProperty = 2207;
pub const vr_ETrackedDeviceProperty_Prop_DriverRequestedMuraFeather_OuterBottom_Int32:
    vr_ETrackedDeviceProperty = 2208;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DefaultPlaybackDeviceId_String:
    vr_ETrackedDeviceProperty = 2300;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DefaultRecordingDeviceId_String:
    vr_ETrackedDeviceProperty = 2301;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DefaultPlaybackDeviceVolume_Float:
    vr_ETrackedDeviceProperty = 2302;
pub const vr_ETrackedDeviceProperty_Prop_Audio_SupportsDualSpeakerAndJackOutput_Bool:
    vr_ETrackedDeviceProperty = 2303;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DriverManagesPlaybackVolumeControl_Bool:
    vr_ETrackedDeviceProperty = 2304;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DriverPlaybackVolume_Float:
    vr_ETrackedDeviceProperty = 2305;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DriverPlaybackMute_Bool: vr_ETrackedDeviceProperty =
    2306;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DriverManagesRecordingVolumeControl_Bool:
    vr_ETrackedDeviceProperty = 2307;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DriverRecordingVolume_Float:
    vr_ETrackedDeviceProperty = 2308;
pub const vr_ETrackedDeviceProperty_Prop_Audio_DriverRecordingMute_Bool: vr_ETrackedDeviceProperty =
    2309;
pub const vr_ETrackedDeviceProperty_Prop_Audio_PipewirePlaybackNode_Int32:
    vr_ETrackedDeviceProperty = 2400;
pub const vr_ETrackedDeviceProperty_Prop_Audio_PipewireRecordingNode_Int32:
    vr_ETrackedDeviceProperty = 2401;
pub const vr_ETrackedDeviceProperty_Prop_AttachedDeviceId_String: vr_ETrackedDeviceProperty = 3000;
pub const vr_ETrackedDeviceProperty_Prop_SupportedButtons_Uint64: vr_ETrackedDeviceProperty = 3001;
pub const vr_ETrackedDeviceProperty_Prop_Axis0Type_Int32: vr_ETrackedDeviceProperty = 3002;
pub const vr_ETrackedDeviceProperty_Prop_Axis1Type_Int32: vr_ETrackedDeviceProperty = 3003;
pub const vr_ETrackedDeviceProperty_Prop_Axis2Type_Int32: vr_ETrackedDeviceProperty = 3004;
pub const vr_ETrackedDeviceProperty_Prop_Axis3Type_Int32: vr_ETrackedDeviceProperty = 3005;
pub const vr_ETrackedDeviceProperty_Prop_Axis4Type_Int32: vr_ETrackedDeviceProperty = 3006;
pub const vr_ETrackedDeviceProperty_Prop_ControllerRoleHint_Int32: vr_ETrackedDeviceProperty = 3007;
pub const vr_ETrackedDeviceProperty_Prop_FieldOfViewLeftDegrees_Float: vr_ETrackedDeviceProperty =
    4000;
pub const vr_ETrackedDeviceProperty_Prop_FieldOfViewRightDegrees_Float: vr_ETrackedDeviceProperty =
    4001;
pub const vr_ETrackedDeviceProperty_Prop_FieldOfViewTopDegrees_Float: vr_ETrackedDeviceProperty =
    4002;
pub const vr_ETrackedDeviceProperty_Prop_FieldOfViewBottomDegrees_Float: vr_ETrackedDeviceProperty =
    4003;
pub const vr_ETrackedDeviceProperty_Prop_TrackingRangeMinimumMeters_Float:
    vr_ETrackedDeviceProperty = 4004;
pub const vr_ETrackedDeviceProperty_Prop_TrackingRangeMaximumMeters_Float:
    vr_ETrackedDeviceProperty = 4005;
pub const vr_ETrackedDeviceProperty_Prop_ModeLabel_String: vr_ETrackedDeviceProperty = 4006;
pub const vr_ETrackedDeviceProperty_Prop_CanWirelessIdentify_Bool: vr_ETrackedDeviceProperty = 4007;
pub const vr_ETrackedDeviceProperty_Prop_Nonce_Int32: vr_ETrackedDeviceProperty = 4008;
pub const vr_ETrackedDeviceProperty_Prop_IconPathName_String: vr_ETrackedDeviceProperty = 5000;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceOff_String: vr_ETrackedDeviceProperty =
    5001;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceSearching_String:
    vr_ETrackedDeviceProperty = 5002;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceSearchingAlert_String:
    vr_ETrackedDeviceProperty = 5003;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceReady_String:
    vr_ETrackedDeviceProperty = 5004;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceReadyAlert_String:
    vr_ETrackedDeviceProperty = 5005;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceNotReady_String:
    vr_ETrackedDeviceProperty = 5006;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceStandby_String:
    vr_ETrackedDeviceProperty = 5007;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceAlertLow_String:
    vr_ETrackedDeviceProperty = 5008;
pub const vr_ETrackedDeviceProperty_Prop_NamedIconPathDeviceStandbyAlert_String:
    vr_ETrackedDeviceProperty = 5009;
pub const vr_ETrackedDeviceProperty_Prop_DisplayHiddenArea_Binary_Start: vr_ETrackedDeviceProperty =
    5100;
pub const vr_ETrackedDeviceProperty_Prop_DisplayHiddenArea_Binary_End: vr_ETrackedDeviceProperty =
    5150;
pub const vr_ETrackedDeviceProperty_Prop_ParentContainer: vr_ETrackedDeviceProperty = 5151;
pub const vr_ETrackedDeviceProperty_Prop_OverrideContainer_Uint64: vr_ETrackedDeviceProperty = 5152;
pub const vr_ETrackedDeviceProperty_Prop_UserConfigPath_String: vr_ETrackedDeviceProperty = 6000;
pub const vr_ETrackedDeviceProperty_Prop_InstallPath_String: vr_ETrackedDeviceProperty = 6001;
pub const vr_ETrackedDeviceProperty_Prop_HasDisplayComponent_Bool: vr_ETrackedDeviceProperty = 6002;
pub const vr_ETrackedDeviceProperty_Prop_HasControllerComponent_Bool: vr_ETrackedDeviceProperty =
    6003;
pub const vr_ETrackedDeviceProperty_Prop_HasCameraComponent_Bool: vr_ETrackedDeviceProperty = 6004;
pub const vr_ETrackedDeviceProperty_Prop_HasDriverDirectModeComponent_Bool:
    vr_ETrackedDeviceProperty = 6005;
pub const vr_ETrackedDeviceProperty_Prop_HasVirtualDisplayComponent_Bool:
    vr_ETrackedDeviceProperty = 6006;
pub const vr_ETrackedDeviceProperty_Prop_HasSpatialAnchorsSupport_Bool: vr_ETrackedDeviceProperty =
    6007;
pub const vr_ETrackedDeviceProperty_Prop_SupportsXrTextureSets_Bool: vr_ETrackedDeviceProperty =
    6008;
pub const vr_ETrackedDeviceProperty_Prop_SupportsXrEyeGazeInteraction_Bool:
    vr_ETrackedDeviceProperty = 6009;
pub const vr_ETrackedDeviceProperty_Prop_DeviceHasNoIMU_Bool: vr_ETrackedDeviceProperty = 6010;
pub const vr_ETrackedDeviceProperty_Prop_UseAdvancedPrediction_Bool: vr_ETrackedDeviceProperty =
    6011;
pub const vr_ETrackedDeviceProperty_Prop_ControllerType_String: vr_ETrackedDeviceProperty = 7000;
pub const vr_ETrackedDeviceProperty_Prop_ControllerHandSelectionPriority_Int32:
    vr_ETrackedDeviceProperty = 7002;
pub const vr_ETrackedDeviceProperty_Prop_VendorSpecific_Reserved_Start: vr_ETrackedDeviceProperty =
    10000;
pub const vr_ETrackedDeviceProperty_Prop_VendorSpecific_Reserved_End: vr_ETrackedDeviceProperty =
    10999;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_11000: vr_ETrackedDeviceProperty = 11000;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_11001: vr_ETrackedDeviceProperty = 11001;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_11002: vr_ETrackedDeviceProperty = 11002;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_11003: vr_ETrackedDeviceProperty = 11003;
pub const vr_ETrackedDeviceProperty_Prop_Reserved_11004: vr_ETrackedDeviceProperty = 11004;
pub const vr_ETrackedDeviceProperty_Prop_TrackedDeviceProperty_Max: vr_ETrackedDeviceProperty =
    1000000;
#[doc = " Each entry in this enum represents a property that can be retrieved about a\n tracked device. Many fields are only valid for one ETrackedDeviceClass."]
pub type vr_ETrackedDeviceProperty = ::std::os::raw::c_uint;
#[doc = " No string property will ever be longer than this length"]
pub const vr_k_unMaxPropertyStringSize: u32 = 32768;
pub const vr_ETrackedPropertyError_TrackedProp_Success: vr_ETrackedPropertyError = 0;
pub const vr_ETrackedPropertyError_TrackedProp_WrongDataType: vr_ETrackedPropertyError = 1;
pub const vr_ETrackedPropertyError_TrackedProp_WrongDeviceClass: vr_ETrackedPropertyError = 2;
pub const vr_ETrackedPropertyError_TrackedProp_BufferTooSmall: vr_ETrackedPropertyError = 3;
pub const vr_ETrackedPropertyError_TrackedProp_UnknownProperty: vr_ETrackedPropertyError = 4;
pub const vr_ETrackedPropertyError_TrackedProp_InvalidDevice: vr_ETrackedPropertyError = 5;
pub const vr_ETrackedPropertyError_TrackedProp_CouldNotContactServer: vr_ETrackedPropertyError = 6;
pub const vr_ETrackedPropertyError_TrackedProp_ValueNotProvidedByDevice: vr_ETrackedPropertyError =
    7;
pub const vr_ETrackedPropertyError_TrackedProp_StringExceedsMaximumLength:
    vr_ETrackedPropertyError = 8;
pub const vr_ETrackedPropertyError_TrackedProp_NotYetAvailable: vr_ETrackedPropertyError = 9;
pub const vr_ETrackedPropertyError_TrackedProp_PermissionDenied: vr_ETrackedPropertyError = 10;
pub const vr_ETrackedPropertyError_TrackedProp_InvalidOperation: vr_ETrackedPropertyError = 11;
pub const vr_ETrackedPropertyError_TrackedProp_CannotWriteToWildcards: vr_ETrackedPropertyError =
    12;
pub const vr_ETrackedPropertyError_TrackedProp_IPCReadFailure: vr_ETrackedPropertyError = 13;
pub const vr_ETrackedPropertyError_TrackedProp_OutOfMemory: vr_ETrackedPropertyError = 14;
pub const vr_ETrackedPropertyError_TrackedProp_InvalidContainer: vr_ETrackedPropertyError = 15;
#[doc = " Used to return errors that occur when reading properties."]
pub type vr_ETrackedPropertyError = ::std::os::raw::c_uint;
pub const vr_EHmdTrackingStyle_HmdTrackingStyle_Unknown: vr_EHmdTrackingStyle = 0;
pub const vr_EHmdTrackingStyle_HmdTrackingStyle_Lighthouse: vr_EHmdTrackingStyle = 1;
pub const vr_EHmdTrackingStyle_HmdTrackingStyle_OutsideInCameras: vr_EHmdTrackingStyle = 2;
pub const vr_EHmdTrackingStyle_HmdTrackingStyle_InsideOutCameras: vr_EHmdTrackingStyle = 3;
#[doc = " Used to drive certain text in the UI when talking about the tracking system for the HMD"]
pub type vr_EHmdTrackingStyle = ::std::os::raw::c_uint;
pub type vr_VRActionHandle_t = u64;
pub type vr_VRActionSetHandle_t = u64;
pub type vr_VRInputValueHandle_t = u64;
pub type vr_VRInputComponentHandle_t = u64;
pub const vr_k_ulInvalidActionHandle: vr_VRActionHandle_t = 0;
pub const vr_k_ulInvalidActionSetHandle: vr_VRActionSetHandle_t = 0;
pub const vr_k_ulInvalidInputValueHandle: vr_VRInputValueHandle_t = 0;
pub const vr_k_ulInvalidInputComponentHandle: vr_VRInputComponentHandle_t = 0;
pub const vr_EVRSubmitFlags_Submit_Default: vr_EVRSubmitFlags = 0;
pub const vr_EVRSubmitFlags_Submit_LensDistortionAlreadyApplied: vr_EVRSubmitFlags = 1;
pub const vr_EVRSubmitFlags_Submit_GlRenderBuffer: vr_EVRSubmitFlags = 2;
pub const vr_EVRSubmitFlags_Submit_Reserved: vr_EVRSubmitFlags = 4;
pub const vr_EVRSubmitFlags_Submit_TextureWithPose: vr_EVRSubmitFlags = 8;
pub const vr_EVRSubmitFlags_Submit_TextureWithDepth: vr_EVRSubmitFlags = 16;
pub const vr_EVRSubmitFlags_Submit_FrameDiscontinuity: vr_EVRSubmitFlags = 32;
pub const vr_EVRSubmitFlags_Submit_VulkanTextureWithArrayData: vr_EVRSubmitFlags = 64;
pub const vr_EVRSubmitFlags_Submit_GlArrayTexture: vr_EVRSubmitFlags = 128;
pub const vr_EVRSubmitFlags_Submit_IsEgl: vr_EVRSubmitFlags = 256;
pub const vr_EVRSubmitFlags_Submit_Reserved2: vr_EVRSubmitFlags = 32768;
pub const vr_EVRSubmitFlags_Submit_Reserved3: vr_EVRSubmitFlags = 65536;
pub const vr_EVRSubmitFlags_Submit_Reserved4: vr_EVRSubmitFlags = 131072;
pub const vr_EVRSubmitFlags_Submit_Reserved5: vr_EVRSubmitFlags = 262144;
#[doc = " Allows the application to control how scene textures are used by the compositor when calling Submit."]
pub type vr_EVRSubmitFlags = ::std::os::raw::c_uint;
#[doc = " Data required for passing Vulkan textures to IVRCompositor::Submit.\n Be sure to call OpenVR_Shutdown before destroying these resources.\n Please see https://github.com/ValveSoftware/openvr/wiki/Vulkan for Vulkan-specific documentation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRVulkanTextureData_t {
    pub m_nImage: u64,
    pub m_pDevice: *mut VkDevice_T,
    pub m_pPhysicalDevice: *mut VkPhysicalDevice_T,
    pub m_pInstance: *mut VkInstance_T,
    pub m_pQueue: *mut VkQueue_T,
    pub m_nQueueFamilyIndex: u32,
    pub m_nWidth: u32,
    pub m_nHeight: u32,
    pub m_nFormat: u32,
    pub m_nSampleCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRVulkanTextureData_t"]
        [::std::mem::size_of::<vr_VRVulkanTextureData_t>() - 64usize];
    ["Alignment of vr_VRVulkanTextureData_t"]
        [::std::mem::align_of::<vr_VRVulkanTextureData_t>() - 8usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_nImage"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_nImage) - 0usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_pDevice"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_pDevice) - 8usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_pPhysicalDevice"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_pPhysicalDevice) - 16usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_pInstance"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_pInstance) - 24usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_pQueue"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_pQueue) - 32usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_nQueueFamilyIndex"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_nQueueFamilyIndex) - 40usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_nWidth"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_nWidth) - 44usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_nHeight"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_nHeight) - 48usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_nFormat"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_nFormat) - 52usize];
    ["Offset of field: vr_VRVulkanTextureData_t::m_nSampleCount"]
        [::std::mem::offset_of!(vr_VRVulkanTextureData_t, m_nSampleCount) - 56usize];
};
#[doc = " Data required for passing Vulkan texture arrays to IVRCompositor::Submit.\n Be sure to call OpenVR_Shutdown before destroying these resources.\n Please see https://github.com/ValveSoftware/openvr/wiki/Vulkan for Vulkan-specific documentation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRVulkanTextureArrayData_t {
    pub _base: vr_VRVulkanTextureData_t,
    pub m_unArrayIndex: u32,
    pub m_unArraySize: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRVulkanTextureArrayData_t"]
        [::std::mem::size_of::<vr_VRVulkanTextureArrayData_t>() - 72usize];
    ["Alignment of vr_VRVulkanTextureArrayData_t"]
        [::std::mem::align_of::<vr_VRVulkanTextureArrayData_t>() - 8usize];
    ["Offset of field: vr_VRVulkanTextureArrayData_t::m_unArrayIndex"]
        [::std::mem::offset_of!(vr_VRVulkanTextureArrayData_t, m_unArrayIndex) - 64usize];
    ["Offset of field: vr_VRVulkanTextureArrayData_t::m_unArraySize"]
        [::std::mem::offset_of!(vr_VRVulkanTextureArrayData_t, m_unArraySize) - 68usize];
};
#[doc = " Data required for passing D3D12 textures to IVRCompositor::Submit.\n Be sure to call OpenVR_Shutdown before destroying these resources."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_D3D12TextureData_t {
    pub m_pResource: *mut ID3D12Resource,
    pub m_pCommandQueue: *mut ID3D12CommandQueue,
    pub m_nNodeMask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_D3D12TextureData_t"][::std::mem::size_of::<vr_D3D12TextureData_t>() - 24usize];
    ["Alignment of vr_D3D12TextureData_t"]
        [::std::mem::align_of::<vr_D3D12TextureData_t>() - 8usize];
    ["Offset of field: vr_D3D12TextureData_t::m_pResource"]
        [::std::mem::offset_of!(vr_D3D12TextureData_t, m_pResource) - 0usize];
    ["Offset of field: vr_D3D12TextureData_t::m_pCommandQueue"]
        [::std::mem::offset_of!(vr_D3D12TextureData_t, m_pCommandQueue) - 8usize];
    ["Offset of field: vr_D3D12TextureData_t::m_nNodeMask"]
        [::std::mem::offset_of!(vr_D3D12TextureData_t, m_nNodeMask) - 16usize];
};
pub const vr_EVRState_VRState_Undefined: vr_EVRState = -1;
pub const vr_EVRState_VRState_Off: vr_EVRState = 0;
pub const vr_EVRState_VRState_Searching: vr_EVRState = 1;
pub const vr_EVRState_VRState_Searching_Alert: vr_EVRState = 2;
pub const vr_EVRState_VRState_Ready: vr_EVRState = 3;
pub const vr_EVRState_VRState_Ready_Alert: vr_EVRState = 4;
pub const vr_EVRState_VRState_NotReady: vr_EVRState = 5;
pub const vr_EVRState_VRState_Standby: vr_EVRState = 6;
pub const vr_EVRState_VRState_Ready_Alert_Low: vr_EVRState = 7;
#[doc = " Status of the overall system or tracked objects"]
pub type vr_EVRState = ::std::os::raw::c_int;
pub const vr_EVREventType_VREvent_None: vr_EVREventType = 0;
pub const vr_EVREventType_VREvent_TrackedDeviceActivated: vr_EVREventType = 100;
pub const vr_EVREventType_VREvent_TrackedDeviceDeactivated: vr_EVREventType = 101;
pub const vr_EVREventType_VREvent_TrackedDeviceUpdated: vr_EVREventType = 102;
pub const vr_EVREventType_VREvent_TrackedDeviceUserInteractionStarted: vr_EVREventType = 103;
pub const vr_EVREventType_VREvent_TrackedDeviceUserInteractionEnded: vr_EVREventType = 104;
pub const vr_EVREventType_VREvent_IpdChanged: vr_EVREventType = 105;
pub const vr_EVREventType_VREvent_EnterStandbyMode: vr_EVREventType = 106;
pub const vr_EVREventType_VREvent_LeaveStandbyMode: vr_EVREventType = 107;
pub const vr_EVREventType_VREvent_TrackedDeviceRoleChanged: vr_EVREventType = 108;
pub const vr_EVREventType_VREvent_WatchdogWakeUpRequested: vr_EVREventType = 109;
pub const vr_EVREventType_VREvent_LensDistortionChanged: vr_EVREventType = 110;
pub const vr_EVREventType_VREvent_PropertyChanged: vr_EVREventType = 111;
pub const vr_EVREventType_VREvent_WirelessDisconnect: vr_EVREventType = 112;
pub const vr_EVREventType_VREvent_WirelessReconnect: vr_EVREventType = 113;
pub const vr_EVREventType_VREvent_Reserved_0114: vr_EVREventType = 114;
pub const vr_EVREventType_VREvent_Reserved_0115: vr_EVREventType = 115;
pub const vr_EVREventType_VREvent_ButtonPress: vr_EVREventType = 200;
pub const vr_EVREventType_VREvent_ButtonUnpress: vr_EVREventType = 201;
pub const vr_EVREventType_VREvent_ButtonTouch: vr_EVREventType = 202;
pub const vr_EVREventType_VREvent_ButtonUntouch: vr_EVREventType = 203;
pub const vr_EVREventType_VREvent_Modal_Cancel: vr_EVREventType = 257;
pub const vr_EVREventType_VREvent_MouseMove: vr_EVREventType = 300;
pub const vr_EVREventType_VREvent_MouseButtonDown: vr_EVREventType = 301;
pub const vr_EVREventType_VREvent_MouseButtonUp: vr_EVREventType = 302;
pub const vr_EVREventType_VREvent_FocusEnter: vr_EVREventType = 303;
pub const vr_EVREventType_VREvent_FocusLeave: vr_EVREventType = 304;
pub const vr_EVREventType_VREvent_ScrollDiscrete: vr_EVREventType = 305;
pub const vr_EVREventType_VREvent_TouchPadMove: vr_EVREventType = 306;
pub const vr_EVREventType_VREvent_OverlayFocusChanged: vr_EVREventType = 307;
pub const vr_EVREventType_VREvent_ReloadOverlays: vr_EVREventType = 308;
pub const vr_EVREventType_VREvent_ScrollSmooth: vr_EVREventType = 309;
pub const vr_EVREventType_VREvent_LockMousePosition: vr_EVREventType = 310;
pub const vr_EVREventType_VREvent_UnlockMousePosition: vr_EVREventType = 311;
pub const vr_EVREventType_VREvent_InputFocusCaptured: vr_EVREventType = 400;
pub const vr_EVREventType_VREvent_InputFocusReleased: vr_EVREventType = 401;
pub const vr_EVREventType_VREvent_SceneApplicationChanged: vr_EVREventType = 404;
pub const vr_EVREventType_VREvent_InputFocusChanged: vr_EVREventType = 406;
pub const vr_EVREventType_VREvent_SceneApplicationUsingWrongGraphicsAdapter: vr_EVREventType = 408;
pub const vr_EVREventType_VREvent_ActionBindingReloaded: vr_EVREventType = 409;
pub const vr_EVREventType_VREvent_HideRenderModels: vr_EVREventType = 410;
pub const vr_EVREventType_VREvent_ShowRenderModels: vr_EVREventType = 411;
pub const vr_EVREventType_VREvent_SceneApplicationStateChanged: vr_EVREventType = 412;
pub const vr_EVREventType_VREvent_SceneAppPipeDisconnected: vr_EVREventType = 413;
pub const vr_EVREventType_VREvent_ConsoleOpened: vr_EVREventType = 420;
pub const vr_EVREventType_VREvent_ConsoleClosed: vr_EVREventType = 421;
pub const vr_EVREventType_VREvent_OverlayShown: vr_EVREventType = 500;
pub const vr_EVREventType_VREvent_OverlayHidden: vr_EVREventType = 501;
pub const vr_EVREventType_VREvent_DashboardActivated: vr_EVREventType = 502;
pub const vr_EVREventType_VREvent_DashboardDeactivated: vr_EVREventType = 503;
pub const vr_EVREventType_VREvent_ResetDashboard: vr_EVREventType = 506;
pub const vr_EVREventType_VREvent_ImageLoaded: vr_EVREventType = 508;
pub const vr_EVREventType_VREvent_ShowKeyboard: vr_EVREventType = 509;
pub const vr_EVREventType_VREvent_HideKeyboard: vr_EVREventType = 510;
pub const vr_EVREventType_VREvent_OverlayGamepadFocusGained: vr_EVREventType = 511;
pub const vr_EVREventType_VREvent_OverlayGamepadFocusLost: vr_EVREventType = 512;
pub const vr_EVREventType_VREvent_OverlaySharedTextureChanged: vr_EVREventType = 513;
pub const vr_EVREventType_VREvent_ScreenshotTriggered: vr_EVREventType = 516;
pub const vr_EVREventType_VREvent_ImageFailed: vr_EVREventType = 517;
pub const vr_EVREventType_VREvent_DashboardOverlayCreated: vr_EVREventType = 518;
pub const vr_EVREventType_VREvent_SwitchGamepadFocus: vr_EVREventType = 519;
pub const vr_EVREventType_VREvent_RequestScreenshot: vr_EVREventType = 520;
pub const vr_EVREventType_VREvent_ScreenshotTaken: vr_EVREventType = 521;
pub const vr_EVREventType_VREvent_ScreenshotFailed: vr_EVREventType = 522;
pub const vr_EVREventType_VREvent_SubmitScreenshotToDashboard: vr_EVREventType = 523;
pub const vr_EVREventType_VREvent_ScreenshotProgressToDashboard: vr_EVREventType = 524;
pub const vr_EVREventType_VREvent_PrimaryDashboardDeviceChanged: vr_EVREventType = 525;
pub const vr_EVREventType_VREvent_RoomViewShown: vr_EVREventType = 526;
pub const vr_EVREventType_VREvent_RoomViewHidden: vr_EVREventType = 527;
pub const vr_EVREventType_VREvent_ShowUI: vr_EVREventType = 528;
pub const vr_EVREventType_VREvent_ShowDevTools: vr_EVREventType = 529;
pub const vr_EVREventType_VREvent_DesktopViewUpdating: vr_EVREventType = 530;
pub const vr_EVREventType_VREvent_DesktopViewReady: vr_EVREventType = 531;
pub const vr_EVREventType_VREvent_StartDashboard: vr_EVREventType = 532;
pub const vr_EVREventType_VREvent_ElevatePrism: vr_EVREventType = 533;
pub const vr_EVREventType_VREvent_OverlayClosed: vr_EVREventType = 534;
pub const vr_EVREventType_VREvent_DashboardThumbChanged: vr_EVREventType = 535;
pub const vr_EVREventType_VREvent_DesktopMightBeVisible: vr_EVREventType = 536;
pub const vr_EVREventType_VREvent_DesktopMightBeHidden: vr_EVREventType = 537;
pub const vr_EVREventType_VREvent_MutualSteamCapabilitiesChanged: vr_EVREventType = 538;
pub const vr_EVREventType_VREvent_OverlayCreated: vr_EVREventType = 539;
pub const vr_EVREventType_VREvent_OverlayDestroyed: vr_EVREventType = 540;
pub const vr_EVREventType_VREvent_TrackingRecordingStarted: vr_EVREventType = 541;
pub const vr_EVREventType_VREvent_TrackingRecordingStopped: vr_EVREventType = 542;
pub const vr_EVREventType_VREvent_SetTrackingRecordingPath: vr_EVREventType = 543;
pub const vr_EVREventType_VREvent_Reserved_0560: vr_EVREventType = 560;
pub const vr_EVREventType_VREvent_Reserved_0561: vr_EVREventType = 561;
pub const vr_EVREventType_VREvent_Reserved_0562: vr_EVREventType = 562;
pub const vr_EVREventType_VREvent_Reserved_0563: vr_EVREventType = 563;
pub const vr_EVREventType_VREvent_Notification_Shown: vr_EVREventType = 600;
pub const vr_EVREventType_VREvent_Notification_Hidden: vr_EVREventType = 601;
pub const vr_EVREventType_VREvent_Notification_BeginInteraction: vr_EVREventType = 602;
pub const vr_EVREventType_VREvent_Notification_Destroyed: vr_EVREventType = 603;
pub const vr_EVREventType_VREvent_Quit: vr_EVREventType = 700;
pub const vr_EVREventType_VREvent_ProcessQuit: vr_EVREventType = 701;
pub const vr_EVREventType_VREvent_QuitAcknowledged: vr_EVREventType = 703;
pub const vr_EVREventType_VREvent_DriverRequestedQuit: vr_EVREventType = 704;
pub const vr_EVREventType_VREvent_RestartRequested: vr_EVREventType = 705;
pub const vr_EVREventType_VREvent_InvalidateSwapTextureSets: vr_EVREventType = 706;
pub const vr_EVREventType_VREvent_RequestDisconnectWirelessHMD: vr_EVREventType = 707;
pub const vr_EVREventType_VREvent_ChaperoneDataHasChanged: vr_EVREventType = 800;
pub const vr_EVREventType_VREvent_ChaperoneUniverseHasChanged: vr_EVREventType = 801;
pub const vr_EVREventType_VREvent_ChaperoneTempDataHasChanged: vr_EVREventType = 802;
pub const vr_EVREventType_VREvent_ChaperoneSettingsHaveChanged: vr_EVREventType = 803;
pub const vr_EVREventType_VREvent_SeatedZeroPoseReset: vr_EVREventType = 804;
pub const vr_EVREventType_VREvent_ChaperoneFlushCache: vr_EVREventType = 805;
pub const vr_EVREventType_VREvent_ChaperoneRoomSetupStarting: vr_EVREventType = 806;
pub const vr_EVREventType_VREvent_ChaperoneRoomSetupCommitted: vr_EVREventType = 807;
pub const vr_EVREventType_VREvent_StandingZeroPoseReset: vr_EVREventType = 808;
pub const vr_EVREventType_VREvent_Reserved_0809: vr_EVREventType = 809;
pub const vr_EVREventType_VREvent_Reserved_0810: vr_EVREventType = 810;
pub const vr_EVREventType_VREvent_Reserved_0811: vr_EVREventType = 811;
pub const vr_EVREventType_VREvent_AudioSettingsHaveChanged: vr_EVREventType = 820;
pub const vr_EVREventType_VREvent_BackgroundSettingHasChanged: vr_EVREventType = 850;
pub const vr_EVREventType_VREvent_CameraSettingsHaveChanged: vr_EVREventType = 851;
pub const vr_EVREventType_VREvent_ReprojectionSettingHasChanged: vr_EVREventType = 852;
pub const vr_EVREventType_VREvent_ModelSkinSettingsHaveChanged: vr_EVREventType = 853;
pub const vr_EVREventType_VREvent_EnvironmentSettingsHaveChanged: vr_EVREventType = 854;
pub const vr_EVREventType_VREvent_PowerSettingsHaveChanged: vr_EVREventType = 855;
pub const vr_EVREventType_VREvent_EnableHomeAppSettingsHaveChanged: vr_EVREventType = 856;
pub const vr_EVREventType_VREvent_SteamVRSectionSettingChanged: vr_EVREventType = 857;
pub const vr_EVREventType_VREvent_LighthouseSectionSettingChanged: vr_EVREventType = 858;
pub const vr_EVREventType_VREvent_NullSectionSettingChanged: vr_EVREventType = 859;
pub const vr_EVREventType_VREvent_UserInterfaceSectionSettingChanged: vr_EVREventType = 860;
pub const vr_EVREventType_VREvent_NotificationsSectionSettingChanged: vr_EVREventType = 861;
pub const vr_EVREventType_VREvent_KeyboardSectionSettingChanged: vr_EVREventType = 862;
pub const vr_EVREventType_VREvent_PerfSectionSettingChanged: vr_EVREventType = 863;
pub const vr_EVREventType_VREvent_DashboardSectionSettingChanged: vr_EVREventType = 864;
pub const vr_EVREventType_VREvent_WebInterfaceSectionSettingChanged: vr_EVREventType = 865;
pub const vr_EVREventType_VREvent_TrackersSectionSettingChanged: vr_EVREventType = 866;
pub const vr_EVREventType_VREvent_LastKnownSectionSettingChanged: vr_EVREventType = 867;
pub const vr_EVREventType_VREvent_DismissedWarningsSectionSettingChanged: vr_EVREventType = 868;
pub const vr_EVREventType_VREvent_GpuSpeedSectionSettingChanged: vr_EVREventType = 869;
pub const vr_EVREventType_VREvent_WindowsMRSectionSettingChanged: vr_EVREventType = 870;
pub const vr_EVREventType_VREvent_OtherSectionSettingChanged: vr_EVREventType = 871;
pub const vr_EVREventType_VREvent_AnyDriverSettingsChanged: vr_EVREventType = 872;
pub const vr_EVREventType_VREvent_StatusUpdate: vr_EVREventType = 900;
pub const vr_EVREventType_VREvent_WebInterface_InstallDriverCompleted: vr_EVREventType = 950;
pub const vr_EVREventType_VREvent_MCImageUpdated: vr_EVREventType = 1000;
pub const vr_EVREventType_VREvent_FirmwareUpdateStarted: vr_EVREventType = 1100;
pub const vr_EVREventType_VREvent_FirmwareUpdateFinished: vr_EVREventType = 1101;
pub const vr_EVREventType_VREvent_KeyboardClosed: vr_EVREventType = 1200;
pub const vr_EVREventType_VREvent_KeyboardCharInput: vr_EVREventType = 1201;
pub const vr_EVREventType_VREvent_KeyboardDone: vr_EVREventType = 1202;
pub const vr_EVREventType_VREvent_KeyboardOpened_Global: vr_EVREventType = 1203;
pub const vr_EVREventType_VREvent_KeyboardClosed_Global: vr_EVREventType = 1204;
pub const vr_EVREventType_VREvent_ApplicationListUpdated: vr_EVREventType = 1303;
pub const vr_EVREventType_VREvent_ApplicationMimeTypeLoad: vr_EVREventType = 1304;
pub const vr_EVREventType_VREvent_ProcessConnected: vr_EVREventType = 1306;
pub const vr_EVREventType_VREvent_ProcessDisconnected: vr_EVREventType = 1307;
pub const vr_EVREventType_VREvent_Compositor_ChaperoneBoundsShown: vr_EVREventType = 1410;
pub const vr_EVREventType_VREvent_Compositor_ChaperoneBoundsHidden: vr_EVREventType = 1411;
pub const vr_EVREventType_VREvent_Compositor_DisplayDisconnected: vr_EVREventType = 1412;
pub const vr_EVREventType_VREvent_Compositor_DisplayReconnected: vr_EVREventType = 1413;
pub const vr_EVREventType_VREvent_Compositor_HDCPError: vr_EVREventType = 1414;
pub const vr_EVREventType_VREvent_Compositor_ApplicationNotResponding: vr_EVREventType = 1415;
pub const vr_EVREventType_VREvent_Compositor_ApplicationResumed: vr_EVREventType = 1416;
pub const vr_EVREventType_VREvent_Compositor_OutOfVideoMemory: vr_EVREventType = 1417;
pub const vr_EVREventType_VREvent_Compositor_DisplayModeNotSupported: vr_EVREventType = 1418;
pub const vr_EVREventType_VREvent_Compositor_StageOverrideReady: vr_EVREventType = 1419;
pub const vr_EVREventType_VREvent_Compositor_RequestDisconnectReconnect: vr_EVREventType = 1420;
pub const vr_EVREventType_VREvent_TrackedCamera_StartVideoStream: vr_EVREventType = 1500;
pub const vr_EVREventType_VREvent_TrackedCamera_StopVideoStream: vr_EVREventType = 1501;
pub const vr_EVREventType_VREvent_TrackedCamera_PauseVideoStream: vr_EVREventType = 1502;
pub const vr_EVREventType_VREvent_TrackedCamera_ResumeVideoStream: vr_EVREventType = 1503;
pub const vr_EVREventType_VREvent_TrackedCamera_EditingSurface: vr_EVREventType = 1550;
pub const vr_EVREventType_VREvent_PerformanceTest_EnableCapture: vr_EVREventType = 1600;
pub const vr_EVREventType_VREvent_PerformanceTest_DisableCapture: vr_EVREventType = 1601;
pub const vr_EVREventType_VREvent_PerformanceTest_FidelityLevel: vr_EVREventType = 1602;
pub const vr_EVREventType_VREvent_MessageOverlay_Closed: vr_EVREventType = 1650;
pub const vr_EVREventType_VREvent_MessageOverlayCloseRequested: vr_EVREventType = 1651;
pub const vr_EVREventType_VREvent_Input_HapticVibration: vr_EVREventType = 1700;
pub const vr_EVREventType_VREvent_Input_BindingLoadFailed: vr_EVREventType = 1701;
pub const vr_EVREventType_VREvent_Input_BindingLoadSuccessful: vr_EVREventType = 1702;
pub const vr_EVREventType_VREvent_Input_ActionManifestReloaded: vr_EVREventType = 1703;
pub const vr_EVREventType_VREvent_Input_ActionManifestLoadFailed: vr_EVREventType = 1704;
pub const vr_EVREventType_VREvent_Input_ProgressUpdate: vr_EVREventType = 1705;
pub const vr_EVREventType_VREvent_Input_TrackerActivated: vr_EVREventType = 1706;
pub const vr_EVREventType_VREvent_Input_BindingsUpdated: vr_EVREventType = 1707;
pub const vr_EVREventType_VREvent_Input_BindingSubscriptionChanged: vr_EVREventType = 1708;
pub const vr_EVREventType_VREvent_SpatialAnchors_PoseUpdated: vr_EVREventType = 1800;
pub const vr_EVREventType_VREvent_SpatialAnchors_DescriptorUpdated: vr_EVREventType = 1801;
pub const vr_EVREventType_VREvent_SpatialAnchors_RequestPoseUpdate: vr_EVREventType = 1802;
pub const vr_EVREventType_VREvent_SpatialAnchors_RequestDescriptorUpdate: vr_EVREventType = 1803;
pub const vr_EVREventType_VREvent_SystemReport_Started: vr_EVREventType = 1900;
pub const vr_EVREventType_VREvent_Monitor_ShowHeadsetView: vr_EVREventType = 2000;
pub const vr_EVREventType_VREvent_Monitor_HideHeadsetView: vr_EVREventType = 2001;
pub const vr_EVREventType_VREvent_Audio_SetSpeakersVolume: vr_EVREventType = 2100;
pub const vr_EVREventType_VREvent_Audio_SetSpeakersMute: vr_EVREventType = 2101;
pub const vr_EVREventType_VREvent_Audio_SetMicrophoneVolume: vr_EVREventType = 2102;
pub const vr_EVREventType_VREvent_Audio_SetMicrophoneMute: vr_EVREventType = 2103;
pub const vr_EVREventType_VREvent_RenderModel_CountChanged: vr_EVREventType = 2200;
pub const vr_EVREventType_VREvent_VendorSpecific_Reserved_Start: vr_EVREventType = 10000;
pub const vr_EVREventType_VREvent_VendorSpecific_Reserved_End: vr_EVREventType = 19999;
#[doc = " The types of events that could be posted (and what the parameters mean for each event type)"]
pub type vr_EVREventType = ::std::os::raw::c_uint;
pub const vr_EDeviceActivityLevel_k_EDeviceActivityLevel_Unknown: vr_EDeviceActivityLevel = -1;
pub const vr_EDeviceActivityLevel_k_EDeviceActivityLevel_Idle: vr_EDeviceActivityLevel = 0;
pub const vr_EDeviceActivityLevel_k_EDeviceActivityLevel_UserInteraction: vr_EDeviceActivityLevel =
    1;
pub const vr_EDeviceActivityLevel_k_EDeviceActivityLevel_UserInteraction_Timeout:
    vr_EDeviceActivityLevel = 2;
pub const vr_EDeviceActivityLevel_k_EDeviceActivityLevel_Standby: vr_EDeviceActivityLevel = 3;
pub const vr_EDeviceActivityLevel_k_EDeviceActivityLevel_Idle_Timeout: vr_EDeviceActivityLevel = 4;
#[doc = " Level of Hmd activity"]
pub type vr_EDeviceActivityLevel = ::std::os::raw::c_int;
pub const vr_EVRButtonId_k_EButton_System: vr_EVRButtonId = 0;
pub const vr_EVRButtonId_k_EButton_ApplicationMenu: vr_EVRButtonId = 1;
pub const vr_EVRButtonId_k_EButton_Grip: vr_EVRButtonId = 2;
pub const vr_EVRButtonId_k_EButton_DPad_Left: vr_EVRButtonId = 3;
pub const vr_EVRButtonId_k_EButton_DPad_Up: vr_EVRButtonId = 4;
pub const vr_EVRButtonId_k_EButton_DPad_Right: vr_EVRButtonId = 5;
pub const vr_EVRButtonId_k_EButton_DPad_Down: vr_EVRButtonId = 6;
pub const vr_EVRButtonId_k_EButton_A: vr_EVRButtonId = 7;
pub const vr_EVRButtonId_k_EButton_ProximitySensor: vr_EVRButtonId = 31;
pub const vr_EVRButtonId_k_EButton_Axis0: vr_EVRButtonId = 32;
pub const vr_EVRButtonId_k_EButton_Axis1: vr_EVRButtonId = 33;
pub const vr_EVRButtonId_k_EButton_Axis2: vr_EVRButtonId = 34;
pub const vr_EVRButtonId_k_EButton_Axis3: vr_EVRButtonId = 35;
pub const vr_EVRButtonId_k_EButton_Axis4: vr_EVRButtonId = 36;
pub const vr_EVRButtonId_k_EButton_SteamVR_Touchpad: vr_EVRButtonId = 32;
pub const vr_EVRButtonId_k_EButton_SteamVR_Trigger: vr_EVRButtonId = 33;
pub const vr_EVRButtonId_k_EButton_Dashboard_Back: vr_EVRButtonId = 2;
pub const vr_EVRButtonId_k_EButton_IndexController_A: vr_EVRButtonId = 2;
pub const vr_EVRButtonId_k_EButton_IndexController_B: vr_EVRButtonId = 1;
pub const vr_EVRButtonId_k_EButton_IndexController_JoyStick: vr_EVRButtonId = 35;
pub const vr_EVRButtonId_k_EButton_Reserved0: vr_EVRButtonId = 50;
pub const vr_EVRButtonId_k_EButton_Reserved1: vr_EVRButtonId = 51;
pub const vr_EVRButtonId_k_EButton_Max: vr_EVRButtonId = 64;
#[doc = " VR controller button and axis IDs"]
pub type vr_EVRButtonId = ::std::os::raw::c_uint;
#[doc = " used for controller button events"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Controller_t {
    pub button: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Controller_t"][::std::mem::size_of::<vr_VREvent_Controller_t>() - 4usize];
    ["Alignment of vr_VREvent_Controller_t"]
        [::std::mem::align_of::<vr_VREvent_Controller_t>() - 4usize];
    ["Offset of field: vr_VREvent_Controller_t::button"]
        [::std::mem::offset_of!(vr_VREvent_Controller_t, button) - 0usize];
};
pub const vr_EVRMouseButton_VRMouseButton_Left: vr_EVRMouseButton = 1;
pub const vr_EVRMouseButton_VRMouseButton_Right: vr_EVRMouseButton = 2;
pub const vr_EVRMouseButton_VRMouseButton_Middle: vr_EVRMouseButton = 4;
#[doc = " used for simulated mouse events in overlay space"]
pub type vr_EVRMouseButton = ::std::os::raw::c_uint;
#[doc = " used for simulated mouse events in overlay space"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Mouse_t {
    pub x: f32,
    pub y: f32,
    pub button: u32,
    pub cursorIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Mouse_t"][::std::mem::size_of::<vr_VREvent_Mouse_t>() - 16usize];
    ["Alignment of vr_VREvent_Mouse_t"][::std::mem::align_of::<vr_VREvent_Mouse_t>() - 4usize];
    ["Offset of field: vr_VREvent_Mouse_t::x"]
        [::std::mem::offset_of!(vr_VREvent_Mouse_t, x) - 0usize];
    ["Offset of field: vr_VREvent_Mouse_t::y"]
        [::std::mem::offset_of!(vr_VREvent_Mouse_t, y) - 4usize];
    ["Offset of field: vr_VREvent_Mouse_t::button"]
        [::std::mem::offset_of!(vr_VREvent_Mouse_t, button) - 8usize];
    ["Offset of field: vr_VREvent_Mouse_t::cursorIndex"]
        [::std::mem::offset_of!(vr_VREvent_Mouse_t, cursorIndex) - 12usize];
};
#[doc = " used for simulated mouse wheel scroll"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Scroll_t {
    pub xdelta: f32,
    pub ydelta: f32,
    pub unused: u32,
    pub viewportscale: f32,
    pub cursorIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Scroll_t"][::std::mem::size_of::<vr_VREvent_Scroll_t>() - 20usize];
    ["Alignment of vr_VREvent_Scroll_t"][::std::mem::align_of::<vr_VREvent_Scroll_t>() - 4usize];
    ["Offset of field: vr_VREvent_Scroll_t::xdelta"]
        [::std::mem::offset_of!(vr_VREvent_Scroll_t, xdelta) - 0usize];
    ["Offset of field: vr_VREvent_Scroll_t::ydelta"]
        [::std::mem::offset_of!(vr_VREvent_Scroll_t, ydelta) - 4usize];
    ["Offset of field: vr_VREvent_Scroll_t::unused"]
        [::std::mem::offset_of!(vr_VREvent_Scroll_t, unused) - 8usize];
    ["Offset of field: vr_VREvent_Scroll_t::viewportscale"]
        [::std::mem::offset_of!(vr_VREvent_Scroll_t, viewportscale) - 12usize];
    ["Offset of field: vr_VREvent_Scroll_t::cursorIndex"]
        [::std::mem::offset_of!(vr_VREvent_Scroll_t, cursorIndex) - 16usize];
};
#[doc = " when in mouse input mode you can receive data from the touchpad, these events are only sent if the users finger\nis on the touchpad (or just released from it). These events are sent to overlays with the VROverlayFlags_SendVRTouchpadEvents\nflag set."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_TouchPadMove_t {
    pub bFingerDown: bool,
    pub flSecondsFingerDown: f32,
    pub fValueXFirst: f32,
    pub fValueYFirst: f32,
    pub fValueXRaw: f32,
    pub fValueYRaw: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_TouchPadMove_t"]
        [::std::mem::size_of::<vr_VREvent_TouchPadMove_t>() - 24usize];
    ["Alignment of vr_VREvent_TouchPadMove_t"]
        [::std::mem::align_of::<vr_VREvent_TouchPadMove_t>() - 4usize];
    ["Offset of field: vr_VREvent_TouchPadMove_t::bFingerDown"]
        [::std::mem::offset_of!(vr_VREvent_TouchPadMove_t, bFingerDown) - 0usize];
    ["Offset of field: vr_VREvent_TouchPadMove_t::flSecondsFingerDown"]
        [::std::mem::offset_of!(vr_VREvent_TouchPadMove_t, flSecondsFingerDown) - 4usize];
    ["Offset of field: vr_VREvent_TouchPadMove_t::fValueXFirst"]
        [::std::mem::offset_of!(vr_VREvent_TouchPadMove_t, fValueXFirst) - 8usize];
    ["Offset of field: vr_VREvent_TouchPadMove_t::fValueYFirst"]
        [::std::mem::offset_of!(vr_VREvent_TouchPadMove_t, fValueYFirst) - 12usize];
    ["Offset of field: vr_VREvent_TouchPadMove_t::fValueXRaw"]
        [::std::mem::offset_of!(vr_VREvent_TouchPadMove_t, fValueXRaw) - 16usize];
    ["Offset of field: vr_VREvent_TouchPadMove_t::fValueYRaw"]
        [::std::mem::offset_of!(vr_VREvent_TouchPadMove_t, fValueYRaw) - 20usize];
};
#[doc = " notification related events. Details will still change at this point"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Notification_t {
    pub ulUserValue: u64,
    pub notificationId: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Notification_t"]
        [::std::mem::size_of::<vr_VREvent_Notification_t>() - 16usize];
    ["Alignment of vr_VREvent_Notification_t"]
        [::std::mem::align_of::<vr_VREvent_Notification_t>() - 8usize];
    ["Offset of field: vr_VREvent_Notification_t::ulUserValue"]
        [::std::mem::offset_of!(vr_VREvent_Notification_t, ulUserValue) - 0usize];
    ["Offset of field: vr_VREvent_Notification_t::notificationId"]
        [::std::mem::offset_of!(vr_VREvent_Notification_t, notificationId) - 8usize];
};
#[doc = " Used for events about processes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Process_t {
    pub pid: u32,
    pub oldPid: u32,
    pub bForced: bool,
    pub bConnectionLost: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Process_t"][::std::mem::size_of::<vr_VREvent_Process_t>() - 12usize];
    ["Alignment of vr_VREvent_Process_t"][::std::mem::align_of::<vr_VREvent_Process_t>() - 4usize];
    ["Offset of field: vr_VREvent_Process_t::pid"]
        [::std::mem::offset_of!(vr_VREvent_Process_t, pid) - 0usize];
    ["Offset of field: vr_VREvent_Process_t::oldPid"]
        [::std::mem::offset_of!(vr_VREvent_Process_t, oldPid) - 4usize];
    ["Offset of field: vr_VREvent_Process_t::bForced"]
        [::std::mem::offset_of!(vr_VREvent_Process_t, bForced) - 8usize];
    ["Offset of field: vr_VREvent_Process_t::bConnectionLost"]
        [::std::mem::offset_of!(vr_VREvent_Process_t, bConnectionLost) - 9usize];
};
#[doc = " Used for a few events about overlays"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Overlay_t {
    pub overlayHandle: u64,
    pub devicePath: u64,
    pub memoryBlockId: u64,
    pub cursorIndex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Overlay_t"][::std::mem::size_of::<vr_VREvent_Overlay_t>() - 32usize];
    ["Alignment of vr_VREvent_Overlay_t"][::std::mem::align_of::<vr_VREvent_Overlay_t>() - 8usize];
    ["Offset of field: vr_VREvent_Overlay_t::overlayHandle"]
        [::std::mem::offset_of!(vr_VREvent_Overlay_t, overlayHandle) - 0usize];
    ["Offset of field: vr_VREvent_Overlay_t::devicePath"]
        [::std::mem::offset_of!(vr_VREvent_Overlay_t, devicePath) - 8usize];
    ["Offset of field: vr_VREvent_Overlay_t::memoryBlockId"]
        [::std::mem::offset_of!(vr_VREvent_Overlay_t, memoryBlockId) - 16usize];
    ["Offset of field: vr_VREvent_Overlay_t::cursorIndex"]
        [::std::mem::offset_of!(vr_VREvent_Overlay_t, cursorIndex) - 24usize];
};
#[doc = " Used for a few events about overlays"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Status_t {
    pub statusState: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Status_t"][::std::mem::size_of::<vr_VREvent_Status_t>() - 4usize];
    ["Alignment of vr_VREvent_Status_t"][::std::mem::align_of::<vr_VREvent_Status_t>() - 4usize];
    ["Offset of field: vr_VREvent_Status_t::statusState"]
        [::std::mem::offset_of!(vr_VREvent_Status_t, statusState) - 0usize];
};
#[doc = " Used for keyboard events"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Keyboard_t {
    pub cNewInput: [::std::os::raw::c_char; 8usize],
    pub uUserValue: u64,
    pub overlayHandle: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Keyboard_t"][::std::mem::size_of::<vr_VREvent_Keyboard_t>() - 24usize];
    ["Alignment of vr_VREvent_Keyboard_t"]
        [::std::mem::align_of::<vr_VREvent_Keyboard_t>() - 8usize];
    ["Offset of field: vr_VREvent_Keyboard_t::cNewInput"]
        [::std::mem::offset_of!(vr_VREvent_Keyboard_t, cNewInput) - 0usize];
    ["Offset of field: vr_VREvent_Keyboard_t::uUserValue"]
        [::std::mem::offset_of!(vr_VREvent_Keyboard_t, uUserValue) - 8usize];
    ["Offset of field: vr_VREvent_Keyboard_t::overlayHandle"]
        [::std::mem::offset_of!(vr_VREvent_Keyboard_t, overlayHandle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Ipd_t {
    pub ipdMeters: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Ipd_t"][::std::mem::size_of::<vr_VREvent_Ipd_t>() - 4usize];
    ["Alignment of vr_VREvent_Ipd_t"][::std::mem::align_of::<vr_VREvent_Ipd_t>() - 4usize];
    ["Offset of field: vr_VREvent_Ipd_t::ipdMeters"]
        [::std::mem::offset_of!(vr_VREvent_Ipd_t, ipdMeters) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Chaperone_t {
    pub m_nPreviousUniverse: u64,
    pub m_nCurrentUniverse: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Chaperone_t"][::std::mem::size_of::<vr_VREvent_Chaperone_t>() - 16usize];
    ["Alignment of vr_VREvent_Chaperone_t"]
        [::std::mem::align_of::<vr_VREvent_Chaperone_t>() - 8usize];
    ["Offset of field: vr_VREvent_Chaperone_t::m_nPreviousUniverse"]
        [::std::mem::offset_of!(vr_VREvent_Chaperone_t, m_nPreviousUniverse) - 0usize];
    ["Offset of field: vr_VREvent_Chaperone_t::m_nCurrentUniverse"]
        [::std::mem::offset_of!(vr_VREvent_Chaperone_t, m_nCurrentUniverse) - 8usize];
};
#[doc = " Not actually used for any events"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Reserved_t {
    pub reserved0: u64,
    pub reserved1: u64,
    pub reserved2: u64,
    pub reserved3: u64,
    pub reserved4: u64,
    pub reserved5: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Reserved_t"][::std::mem::size_of::<vr_VREvent_Reserved_t>() - 48usize];
    ["Alignment of vr_VREvent_Reserved_t"]
        [::std::mem::align_of::<vr_VREvent_Reserved_t>() - 8usize];
    ["Offset of field: vr_VREvent_Reserved_t::reserved0"]
        [::std::mem::offset_of!(vr_VREvent_Reserved_t, reserved0) - 0usize];
    ["Offset of field: vr_VREvent_Reserved_t::reserved1"]
        [::std::mem::offset_of!(vr_VREvent_Reserved_t, reserved1) - 8usize];
    ["Offset of field: vr_VREvent_Reserved_t::reserved2"]
        [::std::mem::offset_of!(vr_VREvent_Reserved_t, reserved2) - 16usize];
    ["Offset of field: vr_VREvent_Reserved_t::reserved3"]
        [::std::mem::offset_of!(vr_VREvent_Reserved_t, reserved3) - 24usize];
    ["Offset of field: vr_VREvent_Reserved_t::reserved4"]
        [::std::mem::offset_of!(vr_VREvent_Reserved_t, reserved4) - 32usize];
    ["Offset of field: vr_VREvent_Reserved_t::reserved5"]
        [::std::mem::offset_of!(vr_VREvent_Reserved_t, reserved5) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_PerformanceTest_t {
    pub m_nFidelityLevel: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_PerformanceTest_t"]
        [::std::mem::size_of::<vr_VREvent_PerformanceTest_t>() - 4usize];
    ["Alignment of vr_VREvent_PerformanceTest_t"]
        [::std::mem::align_of::<vr_VREvent_PerformanceTest_t>() - 4usize];
    ["Offset of field: vr_VREvent_PerformanceTest_t::m_nFidelityLevel"]
        [::std::mem::offset_of!(vr_VREvent_PerformanceTest_t, m_nFidelityLevel) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_SeatedZeroPoseReset_t {
    pub bResetBySystemMenu: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_SeatedZeroPoseReset_t"]
        [::std::mem::size_of::<vr_VREvent_SeatedZeroPoseReset_t>() - 1usize];
    ["Alignment of vr_VREvent_SeatedZeroPoseReset_t"]
        [::std::mem::align_of::<vr_VREvent_SeatedZeroPoseReset_t>() - 1usize];
    ["Offset of field: vr_VREvent_SeatedZeroPoseReset_t::bResetBySystemMenu"]
        [::std::mem::offset_of!(vr_VREvent_SeatedZeroPoseReset_t, bResetBySystemMenu) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Screenshot_t {
    pub handle: u32,
    pub type_: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Screenshot_t"][::std::mem::size_of::<vr_VREvent_Screenshot_t>() - 8usize];
    ["Alignment of vr_VREvent_Screenshot_t"]
        [::std::mem::align_of::<vr_VREvent_Screenshot_t>() - 4usize];
    ["Offset of field: vr_VREvent_Screenshot_t::handle"]
        [::std::mem::offset_of!(vr_VREvent_Screenshot_t, handle) - 0usize];
    ["Offset of field: vr_VREvent_Screenshot_t::type_"]
        [::std::mem::offset_of!(vr_VREvent_Screenshot_t, type_) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_ScreenshotProgress_t {
    pub progress: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_ScreenshotProgress_t"]
        [::std::mem::size_of::<vr_VREvent_ScreenshotProgress_t>() - 4usize];
    ["Alignment of vr_VREvent_ScreenshotProgress_t"]
        [::std::mem::align_of::<vr_VREvent_ScreenshotProgress_t>() - 4usize];
    ["Offset of field: vr_VREvent_ScreenshotProgress_t::progress"]
        [::std::mem::offset_of!(vr_VREvent_ScreenshotProgress_t, progress) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_ApplicationLaunch_t {
    pub pid: u32,
    pub unArgsHandle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_ApplicationLaunch_t"]
        [::std::mem::size_of::<vr_VREvent_ApplicationLaunch_t>() - 8usize];
    ["Alignment of vr_VREvent_ApplicationLaunch_t"]
        [::std::mem::align_of::<vr_VREvent_ApplicationLaunch_t>() - 4usize];
    ["Offset of field: vr_VREvent_ApplicationLaunch_t::pid"]
        [::std::mem::offset_of!(vr_VREvent_ApplicationLaunch_t, pid) - 0usize];
    ["Offset of field: vr_VREvent_ApplicationLaunch_t::unArgsHandle"]
        [::std::mem::offset_of!(vr_VREvent_ApplicationLaunch_t, unArgsHandle) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_EditingCameraSurface_t {
    pub overlayHandle: u64,
    pub nVisualMode: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_EditingCameraSurface_t"]
        [::std::mem::size_of::<vr_VREvent_EditingCameraSurface_t>() - 16usize];
    ["Alignment of vr_VREvent_EditingCameraSurface_t"]
        [::std::mem::align_of::<vr_VREvent_EditingCameraSurface_t>() - 8usize];
    ["Offset of field: vr_VREvent_EditingCameraSurface_t::overlayHandle"]
        [::std::mem::offset_of!(vr_VREvent_EditingCameraSurface_t, overlayHandle) - 0usize];
    ["Offset of field: vr_VREvent_EditingCameraSurface_t::nVisualMode"]
        [::std::mem::offset_of!(vr_VREvent_EditingCameraSurface_t, nVisualMode) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_MessageOverlay_t {
    pub unVRMessageOverlayResponse: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_MessageOverlay_t"]
        [::std::mem::size_of::<vr_VREvent_MessageOverlay_t>() - 4usize];
    ["Alignment of vr_VREvent_MessageOverlay_t"]
        [::std::mem::align_of::<vr_VREvent_MessageOverlay_t>() - 4usize];
    ["Offset of field: vr_VREvent_MessageOverlay_t::unVRMessageOverlayResponse"]
        [::std::mem::offset_of!(vr_VREvent_MessageOverlay_t, unVRMessageOverlayResponse) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_Property_t {
    pub container: vr_PropertyContainerHandle_t,
    pub prop: vr_ETrackedDeviceProperty,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Property_t"][::std::mem::size_of::<vr_VREvent_Property_t>() - 16usize];
    ["Alignment of vr_VREvent_Property_t"]
        [::std::mem::align_of::<vr_VREvent_Property_t>() - 8usize];
    ["Offset of field: vr_VREvent_Property_t::container"]
        [::std::mem::offset_of!(vr_VREvent_Property_t, container) - 0usize];
    ["Offset of field: vr_VREvent_Property_t::prop"]
        [::std::mem::offset_of!(vr_VREvent_Property_t, prop) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_HapticVibration_t {
    pub containerHandle: u64,
    pub componentHandle: u64,
    pub fDurationSeconds: f32,
    pub fFrequency: f32,
    pub fAmplitude: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_HapticVibration_t"]
        [::std::mem::size_of::<vr_VREvent_HapticVibration_t>() - 32usize];
    ["Alignment of vr_VREvent_HapticVibration_t"]
        [::std::mem::align_of::<vr_VREvent_HapticVibration_t>() - 8usize];
    ["Offset of field: vr_VREvent_HapticVibration_t::containerHandle"]
        [::std::mem::offset_of!(vr_VREvent_HapticVibration_t, containerHandle) - 0usize];
    ["Offset of field: vr_VREvent_HapticVibration_t::componentHandle"]
        [::std::mem::offset_of!(vr_VREvent_HapticVibration_t, componentHandle) - 8usize];
    ["Offset of field: vr_VREvent_HapticVibration_t::fDurationSeconds"]
        [::std::mem::offset_of!(vr_VREvent_HapticVibration_t, fDurationSeconds) - 16usize];
    ["Offset of field: vr_VREvent_HapticVibration_t::fFrequency"]
        [::std::mem::offset_of!(vr_VREvent_HapticVibration_t, fFrequency) - 20usize];
    ["Offset of field: vr_VREvent_HapticVibration_t::fAmplitude"]
        [::std::mem::offset_of!(vr_VREvent_HapticVibration_t, fAmplitude) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_WebConsole_t {
    pub webConsoleHandle: vr_WebConsoleHandle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_WebConsole_t"][::std::mem::size_of::<vr_VREvent_WebConsole_t>() - 8usize];
    ["Alignment of vr_VREvent_WebConsole_t"]
        [::std::mem::align_of::<vr_VREvent_WebConsole_t>() - 8usize];
    ["Offset of field: vr_VREvent_WebConsole_t::webConsoleHandle"]
        [::std::mem::offset_of!(vr_VREvent_WebConsole_t, webConsoleHandle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_InputBindingLoad_t {
    pub ulAppContainer: vr_PropertyContainerHandle_t,
    pub pathMessage: u64,
    pub pathUrl: u64,
    pub pathControllerType: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_InputBindingLoad_t"]
        [::std::mem::size_of::<vr_VREvent_InputBindingLoad_t>() - 32usize];
    ["Alignment of vr_VREvent_InputBindingLoad_t"]
        [::std::mem::align_of::<vr_VREvent_InputBindingLoad_t>() - 8usize];
    ["Offset of field: vr_VREvent_InputBindingLoad_t::ulAppContainer"]
        [::std::mem::offset_of!(vr_VREvent_InputBindingLoad_t, ulAppContainer) - 0usize];
    ["Offset of field: vr_VREvent_InputBindingLoad_t::pathMessage"]
        [::std::mem::offset_of!(vr_VREvent_InputBindingLoad_t, pathMessage) - 8usize];
    ["Offset of field: vr_VREvent_InputBindingLoad_t::pathUrl"]
        [::std::mem::offset_of!(vr_VREvent_InputBindingLoad_t, pathUrl) - 16usize];
    ["Offset of field: vr_VREvent_InputBindingLoad_t::pathControllerType"]
        [::std::mem::offset_of!(vr_VREvent_InputBindingLoad_t, pathControllerType) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_InputActionManifestLoad_t {
    pub pathAppKey: u64,
    pub pathMessage: u64,
    pub pathMessageParam: u64,
    pub pathManifestPath: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_InputActionManifestLoad_t"]
        [::std::mem::size_of::<vr_VREvent_InputActionManifestLoad_t>() - 32usize];
    ["Alignment of vr_VREvent_InputActionManifestLoad_t"]
        [::std::mem::align_of::<vr_VREvent_InputActionManifestLoad_t>() - 8usize];
    ["Offset of field: vr_VREvent_InputActionManifestLoad_t::pathAppKey"]
        [::std::mem::offset_of!(vr_VREvent_InputActionManifestLoad_t, pathAppKey) - 0usize];
    ["Offset of field: vr_VREvent_InputActionManifestLoad_t::pathMessage"]
        [::std::mem::offset_of!(vr_VREvent_InputActionManifestLoad_t, pathMessage) - 8usize];
    ["Offset of field: vr_VREvent_InputActionManifestLoad_t::pathMessageParam"]
        [::std::mem::offset_of!(vr_VREvent_InputActionManifestLoad_t, pathMessageParam) - 16usize];
    ["Offset of field: vr_VREvent_InputActionManifestLoad_t::pathManifestPath"]
        [::std::mem::offset_of!(vr_VREvent_InputActionManifestLoad_t, pathManifestPath) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_SpatialAnchor_t {
    pub unHandle: vr_SpatialAnchorHandle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_SpatialAnchor_t"]
        [::std::mem::size_of::<vr_VREvent_SpatialAnchor_t>() - 4usize];
    ["Alignment of vr_VREvent_SpatialAnchor_t"]
        [::std::mem::align_of::<vr_VREvent_SpatialAnchor_t>() - 4usize];
    ["Offset of field: vr_VREvent_SpatialAnchor_t::unHandle"]
        [::std::mem::offset_of!(vr_VREvent_SpatialAnchor_t, unHandle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_ProgressUpdate_t {
    pub ulApplicationPropertyContainer: u64,
    pub pathDevice: u64,
    pub pathInputSource: u64,
    pub pathProgressAction: u64,
    pub pathIcon: u64,
    pub fProgress: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_ProgressUpdate_t"]
        [::std::mem::size_of::<vr_VREvent_ProgressUpdate_t>() - 48usize];
    ["Alignment of vr_VREvent_ProgressUpdate_t"]
        [::std::mem::align_of::<vr_VREvent_ProgressUpdate_t>() - 8usize];
    ["Offset of field: vr_VREvent_ProgressUpdate_t::ulApplicationPropertyContainer"][::std::mem::offset_of!(
        vr_VREvent_ProgressUpdate_t,
        ulApplicationPropertyContainer
    ) - 0usize];
    ["Offset of field: vr_VREvent_ProgressUpdate_t::pathDevice"]
        [::std::mem::offset_of!(vr_VREvent_ProgressUpdate_t, pathDevice) - 8usize];
    ["Offset of field: vr_VREvent_ProgressUpdate_t::pathInputSource"]
        [::std::mem::offset_of!(vr_VREvent_ProgressUpdate_t, pathInputSource) - 16usize];
    ["Offset of field: vr_VREvent_ProgressUpdate_t::pathProgressAction"]
        [::std::mem::offset_of!(vr_VREvent_ProgressUpdate_t, pathProgressAction) - 24usize];
    ["Offset of field: vr_VREvent_ProgressUpdate_t::pathIcon"]
        [::std::mem::offset_of!(vr_VREvent_ProgressUpdate_t, pathIcon) - 32usize];
    ["Offset of field: vr_VREvent_ProgressUpdate_t::fProgress"]
        [::std::mem::offset_of!(vr_VREvent_ProgressUpdate_t, fProgress) - 40usize];
};
pub const vr_EShowUIType_ShowUI_ControllerBinding: vr_EShowUIType = 0;
pub const vr_EShowUIType_ShowUI_ManageTrackers: vr_EShowUIType = 1;
pub const vr_EShowUIType_ShowUI_Pairing: vr_EShowUIType = 3;
pub const vr_EShowUIType_ShowUI_Settings: vr_EShowUIType = 4;
pub const vr_EShowUIType_ShowUI_DebugCommands: vr_EShowUIType = 5;
pub const vr_EShowUIType_ShowUI_FullControllerBinding: vr_EShowUIType = 6;
pub const vr_EShowUIType_ShowUI_ManageDrivers: vr_EShowUIType = 7;
pub type vr_EShowUIType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_ShowUI_t {
    pub eType: vr_EShowUIType,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_ShowUI_t"][::std::mem::size_of::<vr_VREvent_ShowUI_t>() - 4usize];
    ["Alignment of vr_VREvent_ShowUI_t"][::std::mem::align_of::<vr_VREvent_ShowUI_t>() - 4usize];
    ["Offset of field: vr_VREvent_ShowUI_t::eType"]
        [::std::mem::offset_of!(vr_VREvent_ShowUI_t, eType) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_ShowDevTools_t {
    pub nBrowserIdentifier: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_ShowDevTools_t"]
        [::std::mem::size_of::<vr_VREvent_ShowDevTools_t>() - 4usize];
    ["Alignment of vr_VREvent_ShowDevTools_t"]
        [::std::mem::align_of::<vr_VREvent_ShowDevTools_t>() - 4usize];
    ["Offset of field: vr_VREvent_ShowDevTools_t::nBrowserIdentifier"]
        [::std::mem::offset_of!(vr_VREvent_ShowDevTools_t, nBrowserIdentifier) - 0usize];
};
pub const vr_EHDCPError_HDCPError_None: vr_EHDCPError = 0;
pub const vr_EHDCPError_HDCPError_LinkLost: vr_EHDCPError = 1;
pub const vr_EHDCPError_HDCPError_Tampered: vr_EHDCPError = 2;
pub const vr_EHDCPError_HDCPError_DeviceRevoked: vr_EHDCPError = 3;
pub const vr_EHDCPError_HDCPError_Unknown: vr_EHDCPError = 4;
pub type vr_EHDCPError = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_HDCPError_t {
    pub eCode: vr_EHDCPError,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_HDCPError_t"][::std::mem::size_of::<vr_VREvent_HDCPError_t>() - 4usize];
    ["Alignment of vr_VREvent_HDCPError_t"]
        [::std::mem::align_of::<vr_VREvent_HDCPError_t>() - 4usize];
    ["Offset of field: vr_VREvent_HDCPError_t::eCode"]
        [::std::mem::offset_of!(vr_VREvent_HDCPError_t, eCode) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_AudioVolumeControl_t {
    pub fVolumeLevel: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_AudioVolumeControl_t"]
        [::std::mem::size_of::<vr_VREvent_AudioVolumeControl_t>() - 4usize];
    ["Alignment of vr_VREvent_AudioVolumeControl_t"]
        [::std::mem::align_of::<vr_VREvent_AudioVolumeControl_t>() - 4usize];
    ["Offset of field: vr_VREvent_AudioVolumeControl_t::fVolumeLevel"]
        [::std::mem::offset_of!(vr_VREvent_AudioVolumeControl_t, fVolumeLevel) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VREvent_AudioMuteControl_t {
    pub bMute: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_AudioMuteControl_t"]
        [::std::mem::size_of::<vr_VREvent_AudioMuteControl_t>() - 1usize];
    ["Alignment of vr_VREvent_AudioMuteControl_t"]
        [::std::mem::align_of::<vr_VREvent_AudioMuteControl_t>() - 1usize];
    ["Offset of field: vr_VREvent_AudioMuteControl_t::bMute"]
        [::std::mem::offset_of!(vr_VREvent_AudioMuteControl_t, bMute) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union vr_VREvent_Data_t {
    pub reserved: vr_VREvent_Reserved_t,
    pub controller: vr_VREvent_Controller_t,
    pub mouse: vr_VREvent_Mouse_t,
    pub scroll: vr_VREvent_Scroll_t,
    pub process: vr_VREvent_Process_t,
    pub notification: vr_VREvent_Notification_t,
    pub overlay: vr_VREvent_Overlay_t,
    pub status: vr_VREvent_Status_t,
    pub keyboard: vr_VREvent_Keyboard_t,
    pub ipd: vr_VREvent_Ipd_t,
    pub chaperone: vr_VREvent_Chaperone_t,
    pub performanceTest: vr_VREvent_PerformanceTest_t,
    pub touchPadMove: vr_VREvent_TouchPadMove_t,
    pub seatedZeroPoseReset: vr_VREvent_SeatedZeroPoseReset_t,
    pub screenshot: vr_VREvent_Screenshot_t,
    pub screenshotProgress: vr_VREvent_ScreenshotProgress_t,
    pub applicationLaunch: vr_VREvent_ApplicationLaunch_t,
    pub cameraSurface: vr_VREvent_EditingCameraSurface_t,
    pub messageOverlay: vr_VREvent_MessageOverlay_t,
    pub property: vr_VREvent_Property_t,
    pub hapticVibration: vr_VREvent_HapticVibration_t,
    pub webConsole: vr_VREvent_WebConsole_t,
    pub inputBinding: vr_VREvent_InputBindingLoad_t,
    pub actionManifest: vr_VREvent_InputActionManifestLoad_t,
    pub spatialAnchor: vr_VREvent_SpatialAnchor_t,
    pub progressUpdate: vr_VREvent_ProgressUpdate_t,
    pub showUi: vr_VREvent_ShowUI_t,
    pub showDevTools: vr_VREvent_ShowDevTools_t,
    pub hdcpError: vr_VREvent_HDCPError_t,
    pub audioVolumeControl: vr_VREvent_AudioVolumeControl_t,
    pub audioMuteControl: vr_VREvent_AudioMuteControl_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_Data_t"][::std::mem::size_of::<vr_VREvent_Data_t>() - 48usize];
    ["Alignment of vr_VREvent_Data_t"][::std::mem::align_of::<vr_VREvent_Data_t>() - 8usize];
    ["Offset of field: vr_VREvent_Data_t::reserved"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, reserved) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::controller"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, controller) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::mouse"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, mouse) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::scroll"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, scroll) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::process"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, process) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::notification"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, notification) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::overlay"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, overlay) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::status"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, status) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::keyboard"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, keyboard) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::ipd"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, ipd) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::chaperone"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, chaperone) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::performanceTest"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, performanceTest) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::touchPadMove"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, touchPadMove) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::seatedZeroPoseReset"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, seatedZeroPoseReset) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::screenshot"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, screenshot) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::screenshotProgress"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, screenshotProgress) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::applicationLaunch"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, applicationLaunch) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::cameraSurface"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, cameraSurface) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::messageOverlay"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, messageOverlay) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::property"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, property) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::hapticVibration"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, hapticVibration) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::webConsole"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, webConsole) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::inputBinding"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, inputBinding) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::actionManifest"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, actionManifest) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::spatialAnchor"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, spatialAnchor) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::progressUpdate"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, progressUpdate) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::showUi"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, showUi) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::showDevTools"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, showDevTools) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::hdcpError"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, hdcpError) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::audioVolumeControl"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, audioVolumeControl) - 0usize];
    ["Offset of field: vr_VREvent_Data_t::audioMuteControl"]
        [::std::mem::offset_of!(vr_VREvent_Data_t, audioMuteControl) - 0usize];
};
#[doc = " An event posted by the server to all running applications"]
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct vr_VREvent_t {
    pub eventType: u32,
    pub trackedDeviceIndex: vr_TrackedDeviceIndex_t,
    pub eventAgeSeconds: f32,
    pub data: vr_VREvent_Data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VREvent_t"][::std::mem::size_of::<vr_VREvent_t>() - 60usize];
    ["Alignment of vr_VREvent_t"][::std::mem::align_of::<vr_VREvent_t>() - 4usize];
    ["Offset of field: vr_VREvent_t::eventType"]
        [::std::mem::offset_of!(vr_VREvent_t, eventType) - 0usize];
    ["Offset of field: vr_VREvent_t::trackedDeviceIndex"]
        [::std::mem::offset_of!(vr_VREvent_t, trackedDeviceIndex) - 4usize];
    ["Offset of field: vr_VREvent_t::eventAgeSeconds"]
        [::std::mem::offset_of!(vr_VREvent_t, eventAgeSeconds) - 8usize];
    ["Offset of field: vr_VREvent_t::data"][::std::mem::offset_of!(vr_VREvent_t, data) - 12usize];
};
pub type vr_VRComponentProperties = u32;
pub const vr_EVRComponentProperty_VRComponentProperty_IsStatic: vr_EVRComponentProperty = 1;
pub const vr_EVRComponentProperty_VRComponentProperty_IsVisible: vr_EVRComponentProperty = 2;
pub const vr_EVRComponentProperty_VRComponentProperty_IsTouched: vr_EVRComponentProperty = 4;
pub const vr_EVRComponentProperty_VRComponentProperty_IsPressed: vr_EVRComponentProperty = 8;
pub const vr_EVRComponentProperty_VRComponentProperty_IsScrolled: vr_EVRComponentProperty = 16;
pub const vr_EVRComponentProperty_VRComponentProperty_IsHighlighted: vr_EVRComponentProperty = 32;
pub type vr_EVRComponentProperty = ::std::os::raw::c_uint;
#[doc = " Describes state information about a render-model component, including transforms and other dynamic properties"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_RenderModel_ComponentState_t {
    pub mTrackingToComponentRenderModel: vr_HmdMatrix34_t,
    pub mTrackingToComponentLocal: vr_HmdMatrix34_t,
    pub uProperties: vr_VRComponentProperties,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_RenderModel_ComponentState_t"]
        [::std::mem::size_of::<vr_RenderModel_ComponentState_t>() - 100usize];
    ["Alignment of vr_RenderModel_ComponentState_t"]
        [::std::mem::align_of::<vr_RenderModel_ComponentState_t>() - 4usize];
    ["Offset of field: vr_RenderModel_ComponentState_t::mTrackingToComponentRenderModel"][::std::mem::offset_of!(
        vr_RenderModel_ComponentState_t,
        mTrackingToComponentRenderModel
    )
        - 0usize];
    ["Offset of field: vr_RenderModel_ComponentState_t::mTrackingToComponentLocal"][::std::mem::offset_of!(
        vr_RenderModel_ComponentState_t,
        mTrackingToComponentLocal
    ) - 48usize];
    ["Offset of field: vr_RenderModel_ComponentState_t::uProperties"]
        [::std::mem::offset_of!(vr_RenderModel_ComponentState_t, uProperties) - 96usize];
};
pub const vr_EVRInputError_VRInputError_None: vr_EVRInputError = 0;
pub const vr_EVRInputError_VRInputError_NameNotFound: vr_EVRInputError = 1;
pub const vr_EVRInputError_VRInputError_WrongType: vr_EVRInputError = 2;
pub const vr_EVRInputError_VRInputError_InvalidHandle: vr_EVRInputError = 3;
pub const vr_EVRInputError_VRInputError_InvalidParam: vr_EVRInputError = 4;
pub const vr_EVRInputError_VRInputError_NoSteam: vr_EVRInputError = 5;
pub const vr_EVRInputError_VRInputError_MaxCapacityReached: vr_EVRInputError = 6;
pub const vr_EVRInputError_VRInputError_IPCError: vr_EVRInputError = 7;
pub const vr_EVRInputError_VRInputError_NoActiveActionSet: vr_EVRInputError = 8;
pub const vr_EVRInputError_VRInputError_InvalidDevice: vr_EVRInputError = 9;
pub const vr_EVRInputError_VRInputError_InvalidSkeleton: vr_EVRInputError = 10;
pub const vr_EVRInputError_VRInputError_InvalidBoneCount: vr_EVRInputError = 11;
pub const vr_EVRInputError_VRInputError_InvalidCompressedData: vr_EVRInputError = 12;
pub const vr_EVRInputError_VRInputError_NoData: vr_EVRInputError = 13;
pub const vr_EVRInputError_VRInputError_BufferTooSmall: vr_EVRInputError = 14;
pub const vr_EVRInputError_VRInputError_MismatchedActionManifest: vr_EVRInputError = 15;
pub const vr_EVRInputError_VRInputError_MissingSkeletonData: vr_EVRInputError = 16;
pub const vr_EVRInputError_VRInputError_InvalidBoneIndex: vr_EVRInputError = 17;
pub const vr_EVRInputError_VRInputError_InvalidPriority: vr_EVRInputError = 18;
pub const vr_EVRInputError_VRInputError_PermissionDenied: vr_EVRInputError = 19;
pub const vr_EVRInputError_VRInputError_InvalidRenderModel: vr_EVRInputError = 20;
pub type vr_EVRInputError = ::std::os::raw::c_uint;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_Success: vr_EVRSpatialAnchorError = 0;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_Internal: vr_EVRSpatialAnchorError = 1;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_UnknownHandle: vr_EVRSpatialAnchorError = 2;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_ArrayTooSmall: vr_EVRSpatialAnchorError = 3;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_InvalidDescriptorChar:
    vr_EVRSpatialAnchorError = 4;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_NotYetAvailable: vr_EVRSpatialAnchorError =
    5;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_NotAvailableInThisUniverse:
    vr_EVRSpatialAnchorError = 6;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_PermanentlyUnavailable:
    vr_EVRSpatialAnchorError = 7;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_WrongDriver: vr_EVRSpatialAnchorError = 8;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_DescriptorTooLong:
    vr_EVRSpatialAnchorError = 9;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_Unknown: vr_EVRSpatialAnchorError = 10;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_NoRoomCalibration:
    vr_EVRSpatialAnchorError = 11;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_InvalidArgument: vr_EVRSpatialAnchorError =
    12;
pub const vr_EVRSpatialAnchorError_VRSpatialAnchorError_UnknownDriver: vr_EVRSpatialAnchorError =
    13;
pub type vr_EVRSpatialAnchorError = ::std::os::raw::c_uint;
#[doc = " The mesh to draw into the stencil (or depth) buffer to perform\n early stencil (or depth) kills of pixels that will never appear on the HMD.\n This mesh draws on all the pixels that will be hidden after distortion.\n\n If the HMD does not provide a visible area mesh pVertexData will be\n NULL and unTriangleCount will be 0."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_HiddenAreaMesh_t {
    pub pVertexData: *const vr_HmdVector2_t,
    pub unTriangleCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_HiddenAreaMesh_t"][::std::mem::size_of::<vr_HiddenAreaMesh_t>() - 16usize];
    ["Alignment of vr_HiddenAreaMesh_t"][::std::mem::align_of::<vr_HiddenAreaMesh_t>() - 8usize];
    ["Offset of field: vr_HiddenAreaMesh_t::pVertexData"]
        [::std::mem::offset_of!(vr_HiddenAreaMesh_t, pVertexData) - 0usize];
    ["Offset of field: vr_HiddenAreaMesh_t::unTriangleCount"]
        [::std::mem::offset_of!(vr_HiddenAreaMesh_t, unTriangleCount) - 8usize];
};
pub const vr_EHiddenAreaMeshType_k_eHiddenAreaMesh_Standard: vr_EHiddenAreaMeshType = 0;
pub const vr_EHiddenAreaMeshType_k_eHiddenAreaMesh_Inverse: vr_EHiddenAreaMeshType = 1;
pub const vr_EHiddenAreaMeshType_k_eHiddenAreaMesh_LineLoop: vr_EHiddenAreaMeshType = 2;
pub const vr_EHiddenAreaMeshType_k_eHiddenAreaMesh_Max: vr_EHiddenAreaMeshType = 3;
pub type vr_EHiddenAreaMeshType = ::std::os::raw::c_uint;
pub const vr_EVRControllerAxisType_k_eControllerAxis_None: vr_EVRControllerAxisType = 0;
pub const vr_EVRControllerAxisType_k_eControllerAxis_TrackPad: vr_EVRControllerAxisType = 1;
pub const vr_EVRControllerAxisType_k_eControllerAxis_Joystick: vr_EVRControllerAxisType = 2;
pub const vr_EVRControllerAxisType_k_eControllerAxis_Trigger: vr_EVRControllerAxisType = 3;
#[doc = " Identifies what kind of axis is on the controller at index n. Read this type\n with pVRSystem->Get( nControllerDeviceIndex, Prop_Axis0Type_Int32 + n );"]
pub type vr_EVRControllerAxisType = ::std::os::raw::c_uint;
#[doc = " contains information about one axis on the controller"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRControllerAxis_t {
    pub x: f32,
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRControllerAxis_t"][::std::mem::size_of::<vr_VRControllerAxis_t>() - 8usize];
    ["Alignment of vr_VRControllerAxis_t"]
        [::std::mem::align_of::<vr_VRControllerAxis_t>() - 4usize];
    ["Offset of field: vr_VRControllerAxis_t::x"]
        [::std::mem::offset_of!(vr_VRControllerAxis_t, x) - 0usize];
    ["Offset of field: vr_VRControllerAxis_t::y"]
        [::std::mem::offset_of!(vr_VRControllerAxis_t, y) - 4usize];
};
#[doc = " the number of axes in the controller state"]
pub const vr_k_unControllerStateAxisCount: u32 = 5;
#[doc = " Holds all the state of a controller at one moment in time."]
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct vr_VRControllerState001_t {
    pub unPacketNum: u32,
    pub ulButtonPressed: u64,
    pub ulButtonTouched: u64,
    pub rAxis: [vr_VRControllerAxis_t; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_VRControllerState001_t"]
        [::std::mem::size_of::<vr_VRControllerState001_t>() - 60usize];
    ["Alignment of vr_VRControllerState001_t"]
        [::std::mem::align_of::<vr_VRControllerState001_t>() - 4usize];
    ["Offset of field: vr_VRControllerState001_t::unPacketNum"]
        [::std::mem::offset_of!(vr_VRControllerState001_t, unPacketNum) - 0usize];
    ["Offset of field: vr_VRControllerState001_t::ulButtonPressed"]
        [::std::mem::offset_of!(vr_VRControllerState001_t, ulButtonPressed) - 4usize];
    ["Offset of field: vr_VRControllerState001_t::ulButtonTouched"]
        [::std::mem::offset_of!(vr_VRControllerState001_t, ulButtonTouched) - 12usize];
    ["Offset of field: vr_VRControllerState001_t::rAxis"]
        [::std::mem::offset_of!(vr_VRControllerState001_t, rAxis) - 20usize];
};
#[doc = " Holds all the state of a controller at one moment in time."]
pub type vr_VRControllerState_t = vr_VRControllerState001_t;
pub const vr_EVRControllerEventOutputType_ControllerEventOutput_OSEvents:
    vr_EVRControllerEventOutputType = 0;
pub const vr_EVRControllerEventOutputType_ControllerEventOutput_VREvents:
    vr_EVRControllerEventOutputType = 1;
#[doc = " determines how to provide output to the application of various event processing functions."]
pub type vr_EVRControllerEventOutputType = ::std::os::raw::c_uint;
pub const vr_ECollisionBoundsStyle_COLLISION_BOUNDS_STYLE_BEGINNER: vr_ECollisionBoundsStyle = 0;
pub const vr_ECollisionBoundsStyle_COLLISION_BOUNDS_STYLE_INTERMEDIATE: vr_ECollisionBoundsStyle =
    1;
pub const vr_ECollisionBoundsStyle_COLLISION_BOUNDS_STYLE_SQUARES: vr_ECollisionBoundsStyle = 2;
pub const vr_ECollisionBoundsStyle_COLLISION_BOUNDS_STYLE_ADVANCED: vr_ECollisionBoundsStyle = 3;
pub const vr_ECollisionBoundsStyle_COLLISION_BOUNDS_STYLE_NONE: vr_ECollisionBoundsStyle = 4;
pub const vr_ECollisionBoundsStyle_COLLISION_BOUNDS_STYLE_COUNT: vr_ECollisionBoundsStyle = 5;
#[doc = " Collision Bounds Style"]
pub type vr_ECollisionBoundsStyle = ::std::os::raw::c_uint;
#[doc = " used to refer to a single VR overlay"]
pub type vr_VROverlayHandle_t = u64;
pub const vr_k_ulOverlayHandleInvalid: vr_VROverlayHandle_t = 0;
pub const vr_EVROverlayError_VROverlayError_None: vr_EVROverlayError = 0;
pub const vr_EVROverlayError_VROverlayError_UnknownOverlay: vr_EVROverlayError = 10;
pub const vr_EVROverlayError_VROverlayError_InvalidHandle: vr_EVROverlayError = 11;
pub const vr_EVROverlayError_VROverlayError_PermissionDenied: vr_EVROverlayError = 12;
pub const vr_EVROverlayError_VROverlayError_OverlayLimitExceeded: vr_EVROverlayError = 13;
pub const vr_EVROverlayError_VROverlayError_WrongVisibilityType: vr_EVROverlayError = 14;
pub const vr_EVROverlayError_VROverlayError_KeyTooLong: vr_EVROverlayError = 15;
pub const vr_EVROverlayError_VROverlayError_NameTooLong: vr_EVROverlayError = 16;
pub const vr_EVROverlayError_VROverlayError_KeyInUse: vr_EVROverlayError = 17;
pub const vr_EVROverlayError_VROverlayError_WrongTransformType: vr_EVROverlayError = 18;
pub const vr_EVROverlayError_VROverlayError_InvalidTrackedDevice: vr_EVROverlayError = 19;
pub const vr_EVROverlayError_VROverlayError_InvalidParameter: vr_EVROverlayError = 20;
pub const vr_EVROverlayError_VROverlayError_ThumbnailCantBeDestroyed: vr_EVROverlayError = 21;
pub const vr_EVROverlayError_VROverlayError_ArrayTooSmall: vr_EVROverlayError = 22;
pub const vr_EVROverlayError_VROverlayError_RequestFailed: vr_EVROverlayError = 23;
pub const vr_EVROverlayError_VROverlayError_InvalidTexture: vr_EVROverlayError = 24;
pub const vr_EVROverlayError_VROverlayError_UnableToLoadFile: vr_EVROverlayError = 25;
pub const vr_EVROverlayError_VROverlayError_KeyboardAlreadyInUse: vr_EVROverlayError = 26;
pub const vr_EVROverlayError_VROverlayError_NoNeighbor: vr_EVROverlayError = 27;
pub const vr_EVROverlayError_VROverlayError_TooManyMaskPrimitives: vr_EVROverlayError = 29;
pub const vr_EVROverlayError_VROverlayError_BadMaskPrimitive: vr_EVROverlayError = 30;
pub const vr_EVROverlayError_VROverlayError_TextureAlreadyLocked: vr_EVROverlayError = 31;
pub const vr_EVROverlayError_VROverlayError_TextureLockCapacityReached: vr_EVROverlayError = 32;
pub const vr_EVROverlayError_VROverlayError_TextureNotLocked: vr_EVROverlayError = 33;
pub const vr_EVROverlayError_VROverlayError_TimedOut: vr_EVROverlayError = 34;
#[doc = " Errors that can occur around VR overlays"]
pub type vr_EVROverlayError = ::std::os::raw::c_uint;
pub const vr_EVRApplicationType_VRApplication_Other: vr_EVRApplicationType = 0;
pub const vr_EVRApplicationType_VRApplication_Scene: vr_EVRApplicationType = 1;
pub const vr_EVRApplicationType_VRApplication_Overlay: vr_EVRApplicationType = 2;
pub const vr_EVRApplicationType_VRApplication_Background: vr_EVRApplicationType = 3;
pub const vr_EVRApplicationType_VRApplication_Utility: vr_EVRApplicationType = 4;
pub const vr_EVRApplicationType_VRApplication_VRMonitor: vr_EVRApplicationType = 5;
pub const vr_EVRApplicationType_VRApplication_SteamWatchdog: vr_EVRApplicationType = 6;
pub const vr_EVRApplicationType_VRApplication_Bootstrapper: vr_EVRApplicationType = 7;
pub const vr_EVRApplicationType_VRApplication_WebHelper: vr_EVRApplicationType = 8;
pub const vr_EVRApplicationType_VRApplication_OpenXRInstance: vr_EVRApplicationType = 9;
pub const vr_EVRApplicationType_VRApplication_OpenXRScene: vr_EVRApplicationType = 10;
pub const vr_EVRApplicationType_VRApplication_OpenXROverlay: vr_EVRApplicationType = 11;
pub const vr_EVRApplicationType_VRApplication_Prism: vr_EVRApplicationType = 12;
pub const vr_EVRApplicationType_VRApplication_RoomView: vr_EVRApplicationType = 13;
pub const vr_EVRApplicationType_VRApplication_Max: vr_EVRApplicationType = 14;
#[doc = " enum values to pass in to VR_Init to identify whether the application will\n draw a 3D scene."]
pub type vr_EVRApplicationType = ::std::os::raw::c_uint;
pub const vr_EVRFirmwareError_VRFirmwareError_None: vr_EVRFirmwareError = 0;
pub const vr_EVRFirmwareError_VRFirmwareError_Success: vr_EVRFirmwareError = 1;
pub const vr_EVRFirmwareError_VRFirmwareError_Fail: vr_EVRFirmwareError = 2;
#[doc = " error codes for firmware"]
pub type vr_EVRFirmwareError = ::std::os::raw::c_uint;
pub const vr_EVRNotificationError_VRNotificationError_OK: vr_EVRNotificationError = 0;
pub const vr_EVRNotificationError_VRNotificationError_InvalidNotificationId:
    vr_EVRNotificationError = 100;
pub const vr_EVRNotificationError_VRNotificationError_NotificationQueueFull:
    vr_EVRNotificationError = 101;
pub const vr_EVRNotificationError_VRNotificationError_InvalidOverlayHandle:
    vr_EVRNotificationError = 102;
pub const vr_EVRNotificationError_VRNotificationError_SystemWithUserValueAlreadyExists:
    vr_EVRNotificationError = 103;
pub const vr_EVRNotificationError_VRNotificationError_ServiceUnavailable: vr_EVRNotificationError =
    104;
#[doc = " error codes for notifications"]
pub type vr_EVRNotificationError = ::std::os::raw::c_uint;
pub const vr_EVRSkeletalMotionRange_VRSkeletalMotionRange_WithController:
    vr_EVRSkeletalMotionRange = 0;
pub const vr_EVRSkeletalMotionRange_VRSkeletalMotionRange_WithoutController:
    vr_EVRSkeletalMotionRange = 1;
pub type vr_EVRSkeletalMotionRange = ::std::os::raw::c_uint;
pub const vr_EVRSkeletalTrackingLevel_VRSkeletalTracking_Estimated: vr_EVRSkeletalTrackingLevel = 0;
pub const vr_EVRSkeletalTrackingLevel_VRSkeletalTracking_Partial: vr_EVRSkeletalTrackingLevel = 1;
pub const vr_EVRSkeletalTrackingLevel_VRSkeletalTracking_Full: vr_EVRSkeletalTrackingLevel = 2;
pub const vr_EVRSkeletalTrackingLevel_VRSkeletalTrackingLevel_Count: vr_EVRSkeletalTrackingLevel =
    3;
pub const vr_EVRSkeletalTrackingLevel_VRSkeletalTrackingLevel_Max: vr_EVRSkeletalTrackingLevel = 2;
pub type vr_EVRSkeletalTrackingLevel = ::std::os::raw::c_uint;
#[doc = " Type used for referring to bones by their index"]
pub type vr_BoneIndex_t = i32;
pub const vr_k_unInvalidBoneIndex: vr_BoneIndex_t = -1;
pub const vr_EVRInitError_VRInitError_None: vr_EVRInitError = 0;
pub const vr_EVRInitError_VRInitError_Unknown: vr_EVRInitError = 1;
pub const vr_EVRInitError_VRInitError_Init_InstallationNotFound: vr_EVRInitError = 100;
pub const vr_EVRInitError_VRInitError_Init_InstallationCorrupt: vr_EVRInitError = 101;
pub const vr_EVRInitError_VRInitError_Init_VRClientDLLNotFound: vr_EVRInitError = 102;
pub const vr_EVRInitError_VRInitError_Init_FileNotFound: vr_EVRInitError = 103;
pub const vr_EVRInitError_VRInitError_Init_FactoryNotFound: vr_EVRInitError = 104;
pub const vr_EVRInitError_VRInitError_Init_InterfaceNotFound: vr_EVRInitError = 105;
pub const vr_EVRInitError_VRInitError_Init_InvalidInterface: vr_EVRInitError = 106;
pub const vr_EVRInitError_VRInitError_Init_UserConfigDirectoryInvalid: vr_EVRInitError = 107;
pub const vr_EVRInitError_VRInitError_Init_HmdNotFound: vr_EVRInitError = 108;
pub const vr_EVRInitError_VRInitError_Init_NotInitialized: vr_EVRInitError = 109;
pub const vr_EVRInitError_VRInitError_Init_PathRegistryNotFound: vr_EVRInitError = 110;
pub const vr_EVRInitError_VRInitError_Init_NoConfigPath: vr_EVRInitError = 111;
pub const vr_EVRInitError_VRInitError_Init_NoLogPath: vr_EVRInitError = 112;
pub const vr_EVRInitError_VRInitError_Init_PathRegistryNotWritable: vr_EVRInitError = 113;
pub const vr_EVRInitError_VRInitError_Init_AppInfoInitFailed: vr_EVRInitError = 114;
pub const vr_EVRInitError_VRInitError_Init_Retry: vr_EVRInitError = 115;
pub const vr_EVRInitError_VRInitError_Init_InitCanceledByUser: vr_EVRInitError = 116;
pub const vr_EVRInitError_VRInitError_Init_AnotherAppLaunching: vr_EVRInitError = 117;
pub const vr_EVRInitError_VRInitError_Init_SettingsInitFailed: vr_EVRInitError = 118;
pub const vr_EVRInitError_VRInitError_Init_ShuttingDown: vr_EVRInitError = 119;
pub const vr_EVRInitError_VRInitError_Init_TooManyObjects: vr_EVRInitError = 120;
pub const vr_EVRInitError_VRInitError_Init_NoServerForBackgroundApp: vr_EVRInitError = 121;
pub const vr_EVRInitError_VRInitError_Init_NotSupportedWithCompositor: vr_EVRInitError = 122;
pub const vr_EVRInitError_VRInitError_Init_NotAvailableToUtilityApps: vr_EVRInitError = 123;
pub const vr_EVRInitError_VRInitError_Init_Internal: vr_EVRInitError = 124;
pub const vr_EVRInitError_VRInitError_Init_HmdDriverIdIsNone: vr_EVRInitError = 125;
pub const vr_EVRInitError_VRInitError_Init_HmdNotFoundPresenceFailed: vr_EVRInitError = 126;
pub const vr_EVRInitError_VRInitError_Init_VRMonitorNotFound: vr_EVRInitError = 127;
pub const vr_EVRInitError_VRInitError_Init_VRMonitorStartupFailed: vr_EVRInitError = 128;
pub const vr_EVRInitError_VRInitError_Init_LowPowerWatchdogNotSupported: vr_EVRInitError = 129;
pub const vr_EVRInitError_VRInitError_Init_InvalidApplicationType: vr_EVRInitError = 130;
pub const vr_EVRInitError_VRInitError_Init_NotAvailableToWatchdogApps: vr_EVRInitError = 131;
pub const vr_EVRInitError_VRInitError_Init_WatchdogDisabledInSettings: vr_EVRInitError = 132;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardNotFound: vr_EVRInitError = 133;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardStartupFailed: vr_EVRInitError = 134;
pub const vr_EVRInitError_VRInitError_Init_VRHomeNotFound: vr_EVRInitError = 135;
pub const vr_EVRInitError_VRInitError_Init_VRHomeStartupFailed: vr_EVRInitError = 136;
pub const vr_EVRInitError_VRInitError_Init_RebootingBusy: vr_EVRInitError = 137;
pub const vr_EVRInitError_VRInitError_Init_FirmwareUpdateBusy: vr_EVRInitError = 138;
pub const vr_EVRInitError_VRInitError_Init_FirmwareRecoveryBusy: vr_EVRInitError = 139;
pub const vr_EVRInitError_VRInitError_Init_USBServiceBusy: vr_EVRInitError = 140;
pub const vr_EVRInitError_VRInitError_Init_VRWebHelperStartupFailed: vr_EVRInitError = 141;
pub const vr_EVRInitError_VRInitError_Init_TrackerManagerInitFailed: vr_EVRInitError = 142;
pub const vr_EVRInitError_VRInitError_Init_AlreadyRunning: vr_EVRInitError = 143;
pub const vr_EVRInitError_VRInitError_Init_FailedForVrMonitor: vr_EVRInitError = 144;
pub const vr_EVRInitError_VRInitError_Init_PropertyManagerInitFailed: vr_EVRInitError = 145;
pub const vr_EVRInitError_VRInitError_Init_WebServerFailed: vr_EVRInitError = 146;
pub const vr_EVRInitError_VRInitError_Init_IllegalTypeTransition: vr_EVRInitError = 147;
pub const vr_EVRInitError_VRInitError_Init_MismatchedRuntimes: vr_EVRInitError = 148;
pub const vr_EVRInitError_VRInitError_Init_InvalidProcessId: vr_EVRInitError = 149;
pub const vr_EVRInitError_VRInitError_Init_VRServiceStartupFailed: vr_EVRInitError = 150;
pub const vr_EVRInitError_VRInitError_Init_PrismNeedsNewDrivers: vr_EVRInitError = 151;
pub const vr_EVRInitError_VRInitError_Init_PrismStartupTimedOut: vr_EVRInitError = 152;
pub const vr_EVRInitError_VRInitError_Init_CouldNotStartPrism: vr_EVRInitError = 153;
pub const vr_EVRInitError_VRInitError_Init_PrismClientInitFailed: vr_EVRInitError = 154;
pub const vr_EVRInitError_VRInitError_Init_PrismClientStartFailed: vr_EVRInitError = 155;
pub const vr_EVRInitError_VRInitError_Init_PrismExitedUnexpectedly: vr_EVRInitError = 156;
pub const vr_EVRInitError_VRInitError_Init_BadLuid: vr_EVRInitError = 157;
pub const vr_EVRInitError_VRInitError_Init_NoServerForAppContainer: vr_EVRInitError = 158;
pub const vr_EVRInitError_VRInitError_Init_DuplicateBootstrapper: vr_EVRInitError = 159;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardServicePending: vr_EVRInitError = 160;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardServiceTimeout: vr_EVRInitError = 161;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardServiceStopped: vr_EVRInitError = 162;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardAlreadyStarted: vr_EVRInitError = 163;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardCopyFailed: vr_EVRInitError = 164;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardTokenFailure: vr_EVRInitError = 165;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardEnvironmentFailure: vr_EVRInitError = 166;
pub const vr_EVRInitError_VRInitError_Init_VRDashboardPathFailure: vr_EVRInitError = 167;
pub const vr_EVRInitError_VRInitError_Driver_Failed: vr_EVRInitError = 200;
pub const vr_EVRInitError_VRInitError_Driver_Unknown: vr_EVRInitError = 201;
pub const vr_EVRInitError_VRInitError_Driver_HmdUnknown: vr_EVRInitError = 202;
pub const vr_EVRInitError_VRInitError_Driver_NotLoaded: vr_EVRInitError = 203;
pub const vr_EVRInitError_VRInitError_Driver_RuntimeOutOfDate: vr_EVRInitError = 204;
pub const vr_EVRInitError_VRInitError_Driver_HmdInUse: vr_EVRInitError = 205;
pub const vr_EVRInitError_VRInitError_Driver_NotCalibrated: vr_EVRInitError = 206;
pub const vr_EVRInitError_VRInitError_Driver_CalibrationInvalid: vr_EVRInitError = 207;
pub const vr_EVRInitError_VRInitError_Driver_HmdDisplayNotFound: vr_EVRInitError = 208;
pub const vr_EVRInitError_VRInitError_Driver_TrackedDeviceInterfaceUnknown: vr_EVRInitError = 209;
pub const vr_EVRInitError_VRInitError_Driver_HmdDriverIdOutOfBounds: vr_EVRInitError = 211;
pub const vr_EVRInitError_VRInitError_Driver_HmdDisplayMirrored: vr_EVRInitError = 212;
pub const vr_EVRInitError_VRInitError_Driver_HmdDisplayNotFoundLaptop: vr_EVRInitError = 213;
pub const vr_EVRInitError_VRInitError_Driver_PeerDriverNotInstalled: vr_EVRInitError = 214;
pub const vr_EVRInitError_VRInitError_Driver_WirelessHmdNotConnected: vr_EVRInitError = 215;
pub const vr_EVRInitError_VRInitError_IPC_ServerInitFailed: vr_EVRInitError = 300;
pub const vr_EVRInitError_VRInitError_IPC_ConnectFailed: vr_EVRInitError = 301;
pub const vr_EVRInitError_VRInitError_IPC_SharedStateInitFailed: vr_EVRInitError = 302;
pub const vr_EVRInitError_VRInitError_IPC_CompositorInitFailed: vr_EVRInitError = 303;
pub const vr_EVRInitError_VRInitError_IPC_MutexInitFailed: vr_EVRInitError = 304;
pub const vr_EVRInitError_VRInitError_IPC_Failed: vr_EVRInitError = 305;
pub const vr_EVRInitError_VRInitError_IPC_CompositorConnectFailed: vr_EVRInitError = 306;
pub const vr_EVRInitError_VRInitError_IPC_CompositorInvalidConnectResponse: vr_EVRInitError = 307;
pub const vr_EVRInitError_VRInitError_IPC_ConnectFailedAfterMultipleAttempts: vr_EVRInitError = 308;
pub const vr_EVRInitError_VRInitError_IPC_ConnectFailedAfterTargetExited: vr_EVRInitError = 309;
pub const vr_EVRInitError_VRInitError_IPC_NamespaceUnavailable: vr_EVRInitError = 310;
pub const vr_EVRInitError_VRInitError_Compositor_Failed: vr_EVRInitError = 400;
pub const vr_EVRInitError_VRInitError_Compositor_D3D11HardwareRequired: vr_EVRInitError = 401;
pub const vr_EVRInitError_VRInitError_Compositor_FirmwareRequiresUpdate: vr_EVRInitError = 402;
pub const vr_EVRInitError_VRInitError_Compositor_OverlayInitFailed: vr_EVRInitError = 403;
pub const vr_EVRInitError_VRInitError_Compositor_ScreenshotsInitFailed: vr_EVRInitError = 404;
pub const vr_EVRInitError_VRInitError_Compositor_UnableToCreateDevice: vr_EVRInitError = 405;
pub const vr_EVRInitError_VRInitError_Compositor_SharedStateIsNull: vr_EVRInitError = 406;
pub const vr_EVRInitError_VRInitError_Compositor_NotificationManagerIsNull: vr_EVRInitError = 407;
pub const vr_EVRInitError_VRInitError_Compositor_ResourceManagerClientIsNull: vr_EVRInitError = 408;
pub const vr_EVRInitError_VRInitError_Compositor_MessageOverlaySharedStateInitFailure:
    vr_EVRInitError = 409;
pub const vr_EVRInitError_VRInitError_Compositor_PropertiesInterfaceIsNull: vr_EVRInitError = 410;
pub const vr_EVRInitError_VRInitError_Compositor_CreateFullscreenWindowFailed: vr_EVRInitError =
    411;
pub const vr_EVRInitError_VRInitError_Compositor_SettingsInterfaceIsNull: vr_EVRInitError = 412;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToShowWindow: vr_EVRInitError = 413;
pub const vr_EVRInitError_VRInitError_Compositor_DistortInterfaceIsNull: vr_EVRInitError = 414;
pub const vr_EVRInitError_VRInitError_Compositor_DisplayFrequencyFailure: vr_EVRInitError = 415;
pub const vr_EVRInitError_VRInitError_Compositor_RendererInitializationFailed: vr_EVRInitError =
    416;
pub const vr_EVRInitError_VRInitError_Compositor_DXGIFactoryInterfaceIsNull: vr_EVRInitError = 417;
pub const vr_EVRInitError_VRInitError_Compositor_DXGIFactoryCreateFailed: vr_EVRInitError = 418;
pub const vr_EVRInitError_VRInitError_Compositor_DXGIFactoryQueryFailed: vr_EVRInitError = 419;
pub const vr_EVRInitError_VRInitError_Compositor_InvalidAdapterDesktop: vr_EVRInitError = 420;
pub const vr_EVRInitError_VRInitError_Compositor_InvalidHmdAttachment: vr_EVRInitError = 421;
pub const vr_EVRInitError_VRInitError_Compositor_InvalidOutputDesktop: vr_EVRInitError = 422;
pub const vr_EVRInitError_VRInitError_Compositor_InvalidDeviceProvided: vr_EVRInitError = 423;
pub const vr_EVRInitError_VRInitError_Compositor_D3D11RendererInitializationFailed:
    vr_EVRInitError = 424;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToFindDisplayMode: vr_EVRInitError = 425;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateSwapChain: vr_EVRInitError = 426;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToGetBackBuffer: vr_EVRInitError = 427;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateRenderTarget: vr_EVRInitError = 428;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateDXGI2SwapChain: vr_EVRInitError =
    429;
pub const vr_EVRInitError_VRInitError_Compositor_FailedtoGetDXGI2BackBuffer: vr_EVRInitError = 430;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateDXGI2RenderTarget: vr_EVRInitError =
    431;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToGetDXGIDeviceInterface: vr_EVRInitError =
    432;
pub const vr_EVRInitError_VRInitError_Compositor_SelectDisplayMode: vr_EVRInitError = 433;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateNvAPIRenderTargets: vr_EVRInitError =
    434;
pub const vr_EVRInitError_VRInitError_Compositor_NvAPISetDisplayMode: vr_EVRInitError = 435;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateDirectModeDisplay: vr_EVRInitError =
    436;
pub const vr_EVRInitError_VRInitError_Compositor_InvalidHmdPropertyContainer: vr_EVRInitError = 437;
pub const vr_EVRInitError_VRInitError_Compositor_UpdateDisplayFrequency: vr_EVRInitError = 438;
pub const vr_EVRInitError_VRInitError_Compositor_CreateRasterizerState: vr_EVRInitError = 439;
pub const vr_EVRInitError_VRInitError_Compositor_CreateWireframeRasterizerState: vr_EVRInitError =
    440;
pub const vr_EVRInitError_VRInitError_Compositor_CreateSamplerState: vr_EVRInitError = 441;
pub const vr_EVRInitError_VRInitError_Compositor_CreateClampToBorderSamplerState: vr_EVRInitError =
    442;
pub const vr_EVRInitError_VRInitError_Compositor_CreateAnisoSamplerState: vr_EVRInitError = 443;
pub const vr_EVRInitError_VRInitError_Compositor_CreateOverlaySamplerState: vr_EVRInitError = 444;
pub const vr_EVRInitError_VRInitError_Compositor_CreatePanoramaSamplerState: vr_EVRInitError = 445;
pub const vr_EVRInitError_VRInitError_Compositor_CreateFontSamplerState: vr_EVRInitError = 446;
pub const vr_EVRInitError_VRInitError_Compositor_CreateNoBlendState: vr_EVRInitError = 447;
pub const vr_EVRInitError_VRInitError_Compositor_CreateBlendState: vr_EVRInitError = 448;
pub const vr_EVRInitError_VRInitError_Compositor_CreateAlphaBlendState: vr_EVRInitError = 449;
pub const vr_EVRInitError_VRInitError_Compositor_CreateBlendStateMaskR: vr_EVRInitError = 450;
pub const vr_EVRInitError_VRInitError_Compositor_CreateBlendStateMaskG: vr_EVRInitError = 451;
pub const vr_EVRInitError_VRInitError_Compositor_CreateBlendStateMaskB: vr_EVRInitError = 452;
pub const vr_EVRInitError_VRInitError_Compositor_CreateDepthStencilState: vr_EVRInitError = 453;
pub const vr_EVRInitError_VRInitError_Compositor_CreateDepthStencilStateNoWrite: vr_EVRInitError =
    454;
pub const vr_EVRInitError_VRInitError_Compositor_CreateDepthStencilStateNoDepth: vr_EVRInitError =
    455;
pub const vr_EVRInitError_VRInitError_Compositor_CreateFlushTexture: vr_EVRInitError = 456;
pub const vr_EVRInitError_VRInitError_Compositor_CreateDistortionSurfaces: vr_EVRInitError = 457;
pub const vr_EVRInitError_VRInitError_Compositor_CreateConstantBuffer: vr_EVRInitError = 458;
pub const vr_EVRInitError_VRInitError_Compositor_CreateHmdPoseConstantBuffer: vr_EVRInitError = 459;
pub const vr_EVRInitError_VRInitError_Compositor_CreateHmdPoseStagingConstantBuffer:
    vr_EVRInitError = 460;
pub const vr_EVRInitError_VRInitError_Compositor_CreateSharedFrameInfoConstantBuffer:
    vr_EVRInitError = 461;
pub const vr_EVRInitError_VRInitError_Compositor_CreateOverlayConstantBuffer: vr_EVRInitError = 462;
pub const vr_EVRInitError_VRInitError_Compositor_CreateSceneTextureIndexConstantBuffer:
    vr_EVRInitError = 463;
pub const vr_EVRInitError_VRInitError_Compositor_CreateReadableSceneTextureIndexConstantBuffer:
    vr_EVRInitError = 464;
pub const vr_EVRInitError_VRInitError_Compositor_CreateLayerGraphicsTextureIndexConstantBuffer:
    vr_EVRInitError = 465;
pub const vr_EVRInitError_VRInitError_Compositor_CreateLayerComputeTextureIndexConstantBuffer:
    vr_EVRInitError = 466;
pub const vr_EVRInitError_VRInitError_Compositor_CreateLayerComputeSceneTextureIndexConstantBuffer : vr_EVRInitError = 467 ;
pub const vr_EVRInitError_VRInitError_Compositor_CreateComputeHmdPoseConstantBuffer:
    vr_EVRInitError = 468;
pub const vr_EVRInitError_VRInitError_Compositor_CreateGeomConstantBuffer: vr_EVRInitError = 469;
pub const vr_EVRInitError_VRInitError_Compositor_CreatePanelMaskConstantBuffer: vr_EVRInitError =
    470;
pub const vr_EVRInitError_VRInitError_Compositor_CreatePixelSimUBO: vr_EVRInitError = 471;
pub const vr_EVRInitError_VRInitError_Compositor_CreateMSAARenderTextures: vr_EVRInitError = 472;
pub const vr_EVRInitError_VRInitError_Compositor_CreateResolveRenderTextures: vr_EVRInitError = 473;
pub const vr_EVRInitError_VRInitError_Compositor_CreateComputeResolveRenderTextures:
    vr_EVRInitError = 474;
pub const vr_EVRInitError_VRInitError_Compositor_CreateDriverDirectModeResolveTextures:
    vr_EVRInitError = 475;
pub const vr_EVRInitError_VRInitError_Compositor_OpenDriverDirectModeResolveTextures:
    vr_EVRInitError = 476;
pub const vr_EVRInitError_VRInitError_Compositor_CreateFallbackSyncTexture: vr_EVRInitError = 477;
pub const vr_EVRInitError_VRInitError_Compositor_ShareFallbackSyncTexture: vr_EVRInitError = 478;
pub const vr_EVRInitError_VRInitError_Compositor_CreateOverlayIndexBuffer: vr_EVRInitError = 479;
pub const vr_EVRInitError_VRInitError_Compositor_CreateOverlayVertexBuffer: vr_EVRInitError = 480;
pub const vr_EVRInitError_VRInitError_Compositor_CreateTextVertexBuffer: vr_EVRInitError = 481;
pub const vr_EVRInitError_VRInitError_Compositor_CreateTextIndexBuffer: vr_EVRInitError = 482;
pub const vr_EVRInitError_VRInitError_Compositor_CreateMirrorTextures: vr_EVRInitError = 483;
pub const vr_EVRInitError_VRInitError_Compositor_CreateLastFrameRenderTexture: vr_EVRInitError =
    484;
pub const vr_EVRInitError_VRInitError_Compositor_CreateMirrorOverlay: vr_EVRInitError = 485;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateVirtualDisplayBackbuffer:
    vr_EVRInitError = 486;
pub const vr_EVRInitError_VRInitError_Compositor_DisplayModeNotSupported: vr_EVRInitError = 487;
pub const vr_EVRInitError_VRInitError_Compositor_CreateOverlayInvalidCall: vr_EVRInitError = 488;
pub const vr_EVRInitError_VRInitError_Compositor_CreateOverlayAlreadyInitialized: vr_EVRInitError =
    489;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToCreateMailbox: vr_EVRInitError = 490;
pub const vr_EVRInitError_VRInitError_Compositor_WindowInterfaceIsNull: vr_EVRInitError = 491;
pub const vr_EVRInitError_VRInitError_Compositor_SystemLayerCreateInstance: vr_EVRInitError = 492;
pub const vr_EVRInitError_VRInitError_Compositor_SystemLayerCreateSession: vr_EVRInitError = 493;
pub const vr_EVRInitError_VRInitError_Compositor_CreateInverseDistortUVs: vr_EVRInitError = 494;
pub const vr_EVRInitError_VRInitError_Compositor_CreateBackbufferDepth: vr_EVRInitError = 495;
pub const vr_EVRInitError_VRInitError_Compositor_CannotDRMLeaseDisplay: vr_EVRInitError = 496;
pub const vr_EVRInitError_VRInitError_Compositor_CannotConnectToDisplayServer: vr_EVRInitError =
    497;
pub const vr_EVRInitError_VRInitError_Compositor_GnomeNoDRMLeasing: vr_EVRInitError = 498;
pub const vr_EVRInitError_VRInitError_Compositor_FailedToInitializeEncoder: vr_EVRInitError = 499;
pub const vr_EVRInitError_VRInitError_Compositor_CreateBlurTexture: vr_EVRInitError = 500;
pub const vr_EVRInitError_VRInitError_VendorSpecific_UnableToConnectToOculusRuntime:
    vr_EVRInitError = 1000;
pub const vr_EVRInitError_VRInitError_VendorSpecific_WindowsNotInDevMode: vr_EVRInitError = 1001;
pub const vr_EVRInitError_VRInitError_VendorSpecific_OculusLinkNotEnabled: vr_EVRInitError = 1002;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_CantOpenDevice: vr_EVRInitError =
    1101;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UnableToRequestConfigStart:
    vr_EVRInitError = 1102;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_NoStoredConfig: vr_EVRInitError =
    1103;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_ConfigTooBig: vr_EVRInitError = 1104;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_ConfigTooSmall: vr_EVRInitError =
    1105;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UnableToInitZLib: vr_EVRInitError =
    1106;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_CantReadFirmwareVersion:
    vr_EVRInitError = 1107;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UnableToSendUserDataStart:
    vr_EVRInitError = 1108;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UnableToGetUserDataStart:
    vr_EVRInitError = 1109;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UnableToGetUserDataNext:
    vr_EVRInitError = 1110;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UserDataAddressRange:
    vr_EVRInitError = 1111;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UserDataError: vr_EVRInitError = 1112;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_ConfigFailedSanityCheck:
    vr_EVRInitError = 1113;
pub const vr_EVRInitError_VRInitError_VendorSpecific_OculusRuntimeBadInstall: vr_EVRInitError =
    1114;
pub const vr_EVRInitError_VRInitError_VendorSpecific_HmdFound_UnexpectedConfiguration_1:
    vr_EVRInitError = 1115;
pub const vr_EVRInitError_VRInitError_Steam_SteamInstallationNotFound: vr_EVRInitError = 2000;
pub const vr_EVRInitError_VRInitError_LastError: vr_EVRInitError = 2001;
#[doc = " error codes returned by Vr_Init"]
pub type vr_EVRInitError = ::std::os::raw::c_uint;
pub const vr_EVRScreenshotType_VRScreenshotType_None: vr_EVRScreenshotType = 0;
pub const vr_EVRScreenshotType_VRScreenshotType_Mono: vr_EVRScreenshotType = 1;
pub const vr_EVRScreenshotType_VRScreenshotType_Stereo: vr_EVRScreenshotType = 2;
pub const vr_EVRScreenshotType_VRScreenshotType_Cubemap: vr_EVRScreenshotType = 3;
pub const vr_EVRScreenshotType_VRScreenshotType_MonoPanorama: vr_EVRScreenshotType = 4;
pub const vr_EVRScreenshotType_VRScreenshotType_StereoPanorama: vr_EVRScreenshotType = 5;
pub type vr_EVRScreenshotType = ::std::os::raw::c_uint;
pub const vr_EVRScreenshotPropertyFilenames_VRScreenshotPropertyFilenames_Preview:
    vr_EVRScreenshotPropertyFilenames = 0;
pub const vr_EVRScreenshotPropertyFilenames_VRScreenshotPropertyFilenames_VR:
    vr_EVRScreenshotPropertyFilenames = 1;
pub type vr_EVRScreenshotPropertyFilenames = ::std::os::raw::c_uint;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_None: vr_EVRTrackedCameraError = 0;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_OperationFailed: vr_EVRTrackedCameraError =
    100;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_InvalidHandle: vr_EVRTrackedCameraError =
    101;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_InvalidFrameHeaderVersion:
    vr_EVRTrackedCameraError = 102;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_OutOfHandles: vr_EVRTrackedCameraError =
    103;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_IPCFailure: vr_EVRTrackedCameraError = 104;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_NotSupportedForThisDevice:
    vr_EVRTrackedCameraError = 105;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_SharedMemoryFailure:
    vr_EVRTrackedCameraError = 106;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_FrameBufferingFailure:
    vr_EVRTrackedCameraError = 107;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_StreamSetupFailure:
    vr_EVRTrackedCameraError = 108;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_InvalidGLTextureId:
    vr_EVRTrackedCameraError = 109;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_InvalidSharedTextureHandle:
    vr_EVRTrackedCameraError = 110;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_FailedToGetGLTextureId:
    vr_EVRTrackedCameraError = 111;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_SharedTextureFailure:
    vr_EVRTrackedCameraError = 112;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_NoFrameAvailable: vr_EVRTrackedCameraError =
    113;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_InvalidArgument: vr_EVRTrackedCameraError =
    114;
pub const vr_EVRTrackedCameraError_VRTrackedCameraError_InvalidFrameBufferSize:
    vr_EVRTrackedCameraError = 115;
pub type vr_EVRTrackedCameraError = ::std::os::raw::c_uint;
pub const vr_EVRTrackedCameraFrameLayout_EVRTrackedCameraFrameLayout_Mono:
    vr_EVRTrackedCameraFrameLayout = 1;
pub const vr_EVRTrackedCameraFrameLayout_EVRTrackedCameraFrameLayout_Stereo:
    vr_EVRTrackedCameraFrameLayout = 2;
pub const vr_EVRTrackedCameraFrameLayout_EVRTrackedCameraFrameLayout_VerticalLayout:
    vr_EVRTrackedCameraFrameLayout = 16;
pub const vr_EVRTrackedCameraFrameLayout_EVRTrackedCameraFrameLayout_HorizontalLayout:
    vr_EVRTrackedCameraFrameLayout = 32;
pub type vr_EVRTrackedCameraFrameLayout = ::std::os::raw::c_uint;
pub const vr_EVRTrackedCameraFrameType_VRTrackedCameraFrameType_Distorted:
    vr_EVRTrackedCameraFrameType = 0;
pub const vr_EVRTrackedCameraFrameType_VRTrackedCameraFrameType_Undistorted:
    vr_EVRTrackedCameraFrameType = 1;
pub const vr_EVRTrackedCameraFrameType_VRTrackedCameraFrameType_MaximumUndistorted:
    vr_EVRTrackedCameraFrameType = 2;
pub const vr_EVRTrackedCameraFrameType_MAX_CAMERA_FRAME_TYPES: vr_EVRTrackedCameraFrameType = 3;
pub type vr_EVRTrackedCameraFrameType = ::std::os::raw::c_uint;
pub const vr_EVRDistortionFunctionType_VRDistortionFunctionType_None: vr_EVRDistortionFunctionType =
    0;
pub const vr_EVRDistortionFunctionType_VRDistortionFunctionType_FTheta:
    vr_EVRDistortionFunctionType = 1;
pub const vr_EVRDistortionFunctionType_VRDistortionFunctionType_Extended_FTheta:
    vr_EVRDistortionFunctionType = 2;
pub const vr_EVRDistortionFunctionType_MAX_DISTORTION_FUNCTION_TYPES: vr_EVRDistortionFunctionType =
    3;
pub type vr_EVRDistortionFunctionType = ::std::os::raw::c_uint;
pub const vr_k_unMaxDistortionFunctionParameters: u32 = 8;
pub type vr_TrackedCameraHandle_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_CameraVideoStreamFrameHeader_t {
    pub eFrameType: vr_EVRTrackedCameraFrameType,
    pub nWidth: u32,
    pub nHeight: u32,
    pub nBytesPerPixel: u32,
    pub nFrameSequence: u32,
    pub trackedDevicePose: vr_TrackedDevicePose_t,
    pub ulFrameExposureTime: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_CameraVideoStreamFrameHeader_t"]
        [::std::mem::size_of::<vr_CameraVideoStreamFrameHeader_t>() - 112usize];
    ["Alignment of vr_CameraVideoStreamFrameHeader_t"]
        [::std::mem::align_of::<vr_CameraVideoStreamFrameHeader_t>() - 8usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::eFrameType"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, eFrameType) - 0usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::nWidth"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, nWidth) - 4usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::nHeight"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, nHeight) - 8usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::nBytesPerPixel"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, nBytesPerPixel) - 12usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::nFrameSequence"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, nFrameSequence) - 16usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::trackedDevicePose"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, trackedDevicePose) - 20usize];
    ["Offset of field: vr_CameraVideoStreamFrameHeader_t::ulFrameExposureTime"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrameHeader_t, ulFrameExposureTime) - 104usize];
};
pub type vr_ScreenshotHandle_t = u32;
pub const vr_k_unScreenshotHandleInvalid: u32 = 0;
#[doc = " Compositor frame timing reprojection flags."]
pub const vr_VRCompositor_ReprojectionReason_Cpu: u32 = 1;
pub const vr_VRCompositor_ReprojectionReason_Gpu: u32 = 2;
pub const vr_VRCompositor_ReprojectionAsync: u32 = 4;
pub const vr_VRCompositor_ReprojectionMotion: u32 = 8;
pub const vr_VRCompositor_PredictionMask: u32 = 240;
pub const vr_VRCompositor_ThrottleMask: u32 = 3840;
#[doc = " Provides a single frame's timing information to the app"]
#[repr(C, packed(4))]
#[derive(Debug, Copy, Clone)]
pub struct vr_Compositor_FrameTiming {
    pub m_nSize: u32,
    pub m_nFrameIndex: u32,
    pub m_nNumFramePresents: u32,
    pub m_nNumMisPresented: u32,
    pub m_nNumDroppedFrames: u32,
    pub m_nReprojectionFlags: u32,
    #[doc = " Absolute time reference for comparing frames.  This aligns with the vsync that running start is relative to."]
    pub m_flSystemTimeInSeconds: f64,
    #[doc = " These times may include work from other processes due to OS scheduling.\n The fewer packets of work these are broken up into, the less likely this will happen.\n GPU work can be broken up by calling Flush.  This can sometimes be useful to get the GPU started\n processing that work earlier in the frame."]
    pub m_flPreSubmitGpuMs: f32,
    pub m_flPostSubmitGpuMs: f32,
    pub m_flTotalRenderGpuMs: f32,
    pub m_flCompositorRenderGpuMs: f32,
    pub m_flCompositorRenderCpuMs: f32,
    pub m_flCompositorIdleCpuMs: f32,
    #[doc = " Miscellaneous measured intervals."]
    pub m_flClientFrameIntervalMs: f32,
    pub m_flPresentCallCpuMs: f32,
    pub m_flWaitForPresentCpuMs: f32,
    pub m_flSubmitFrameMs: f32,
    #[doc = " The following are all relative to this frame's SystemTimeInSeconds"]
    pub m_flWaitGetPosesCalledMs: f32,
    pub m_flNewPosesReadyMs: f32,
    pub m_flNewFrameReadyMs: f32,
    pub m_flCompositorUpdateStartMs: f32,
    pub m_flCompositorUpdateEndMs: f32,
    pub m_flCompositorRenderStartMs: f32,
    pub m_HmdPose: vr_TrackedDevicePose_t,
    pub m_nNumVSyncsReadyForUse: u32,
    pub m_nNumVSyncsToFirstView: u32,
    pub m_flTransferLatencyMs: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_Compositor_FrameTiming"]
        [::std::mem::size_of::<vr_Compositor_FrameTiming>() - 188usize];
    ["Alignment of vr_Compositor_FrameTiming"]
        [::std::mem::align_of::<vr_Compositor_FrameTiming>() - 4usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nSize"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nSize) - 0usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nFrameIndex"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nFrameIndex) - 4usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nNumFramePresents"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nNumFramePresents) - 8usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nNumMisPresented"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nNumMisPresented) - 12usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nNumDroppedFrames"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nNumDroppedFrames) - 16usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nReprojectionFlags"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nReprojectionFlags) - 20usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flSystemTimeInSeconds"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flSystemTimeInSeconds) - 24usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flPreSubmitGpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flPreSubmitGpuMs) - 32usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flPostSubmitGpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flPostSubmitGpuMs) - 36usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flTotalRenderGpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flTotalRenderGpuMs) - 40usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flCompositorRenderGpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flCompositorRenderGpuMs) - 44usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flCompositorRenderCpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flCompositorRenderCpuMs) - 48usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flCompositorIdleCpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flCompositorIdleCpuMs) - 52usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flClientFrameIntervalMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flClientFrameIntervalMs) - 56usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flPresentCallCpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flPresentCallCpuMs) - 60usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flWaitForPresentCpuMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flWaitForPresentCpuMs) - 64usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flSubmitFrameMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flSubmitFrameMs) - 68usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flWaitGetPosesCalledMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flWaitGetPosesCalledMs) - 72usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flNewPosesReadyMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flNewPosesReadyMs) - 76usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flNewFrameReadyMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flNewFrameReadyMs) - 80usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flCompositorUpdateStartMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flCompositorUpdateStartMs) - 84usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flCompositorUpdateEndMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flCompositorUpdateEndMs) - 88usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flCompositorRenderStartMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flCompositorRenderStartMs) - 92usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_HmdPose"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_HmdPose) - 96usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nNumVSyncsReadyForUse"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nNumVSyncsReadyForUse) - 176usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_nNumVSyncsToFirstView"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_nNumVSyncsToFirstView) - 180usize];
    ["Offset of field: vr_Compositor_FrameTiming::m_flTransferLatencyMs"]
        [::std::mem::offset_of!(vr_Compositor_FrameTiming, m_flTransferLatencyMs) - 184usize];
};
#[doc = " Provides compositor benchmark results to the app"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_Compositor_BenchmarkResults {
    pub m_flMegaPixelsPerSecond: f32,
    pub m_flHmdRecommendedMegaPixelsPerSecond: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_Compositor_BenchmarkResults"]
        [::std::mem::size_of::<vr_Compositor_BenchmarkResults>() - 8usize];
    ["Alignment of vr_Compositor_BenchmarkResults"]
        [::std::mem::align_of::<vr_Compositor_BenchmarkResults>() - 4usize];
    ["Offset of field: vr_Compositor_BenchmarkResults::m_flMegaPixelsPerSecond"]
        [::std::mem::offset_of!(vr_Compositor_BenchmarkResults, m_flMegaPixelsPerSecond) - 0usize];
    ["Offset of field: vr_Compositor_BenchmarkResults::m_flHmdRecommendedMegaPixelsPerSecond"][::std::mem::offset_of!(
        vr_Compositor_BenchmarkResults,
        m_flHmdRecommendedMegaPixelsPerSecond
    )
        - 4usize];
};
#[doc = " Frame timing data provided by direct mode drivers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_DriverDirectMode_FrameTiming {
    pub m_nSize: u32,
    pub m_nNumFramePresents: u32,
    pub m_nNumMisPresented: u32,
    pub m_nNumDroppedFrames: u32,
    pub m_nReprojectionFlags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_DriverDirectMode_FrameTiming"]
        [::std::mem::size_of::<vr_DriverDirectMode_FrameTiming>() - 20usize];
    ["Alignment of vr_DriverDirectMode_FrameTiming"]
        [::std::mem::align_of::<vr_DriverDirectMode_FrameTiming>() - 4usize];
    ["Offset of field: vr_DriverDirectMode_FrameTiming::m_nSize"]
        [::std::mem::offset_of!(vr_DriverDirectMode_FrameTiming, m_nSize) - 0usize];
    ["Offset of field: vr_DriverDirectMode_FrameTiming::m_nNumFramePresents"]
        [::std::mem::offset_of!(vr_DriverDirectMode_FrameTiming, m_nNumFramePresents) - 4usize];
    ["Offset of field: vr_DriverDirectMode_FrameTiming::m_nNumMisPresented"]
        [::std::mem::offset_of!(vr_DriverDirectMode_FrameTiming, m_nNumMisPresented) - 8usize];
    ["Offset of field: vr_DriverDirectMode_FrameTiming::m_nNumDroppedFrames"]
        [::std::mem::offset_of!(vr_DriverDirectMode_FrameTiming, m_nNumDroppedFrames) - 12usize];
    ["Offset of field: vr_DriverDirectMode_FrameTiming::m_nReprojectionFlags"]
        [::std::mem::offset_of!(vr_DriverDirectMode_FrameTiming, m_nReprojectionFlags) - 16usize];
};
#[doc = " These flags will be set on DriverDirectMode_FrameTiming::m_nReprojectionFlags when IVRDriverDirectModeComponent::GetFrameTiming is called for drivers to optionally respond to."]
pub const vr_VRCompositor_ReprojectionMotion_Enabled: u32 = 256;
pub const vr_VRCompositor_ReprojectionMotion_ForcedOn: u32 = 512;
pub const vr_VRCompositor_ReprojectionMotion_AppThrottled: u32 = 1024;
pub const vr_EVSync_VSync_None: vr_EVSync = 0;
pub const vr_EVSync_VSync_WaitRender: vr_EVSync = 1;
pub const vr_EVSync_VSync_NoWaitRender: vr_EVSync = 2;
pub type vr_EVSync = ::std::os::raw::c_uint;
pub const vr_EVRMuraCorrectionMode_EVRMuraCorrectionMode_Default: vr_EVRMuraCorrectionMode = 0;
pub const vr_EVRMuraCorrectionMode_EVRMuraCorrectionMode_NoCorrection: vr_EVRMuraCorrectionMode = 1;
pub type vr_EVRMuraCorrectionMode = ::std::os::raw::c_uint;
pub const vr_Imu_OffScaleFlags_OffScale_AccelX: vr_Imu_OffScaleFlags = 1;
pub const vr_Imu_OffScaleFlags_OffScale_AccelY: vr_Imu_OffScaleFlags = 2;
pub const vr_Imu_OffScaleFlags_OffScale_AccelZ: vr_Imu_OffScaleFlags = 4;
pub const vr_Imu_OffScaleFlags_OffScale_GyroX: vr_Imu_OffScaleFlags = 8;
pub const vr_Imu_OffScaleFlags_OffScale_GyroY: vr_Imu_OffScaleFlags = 16;
pub const vr_Imu_OffScaleFlags_OffScale_GyroZ: vr_Imu_OffScaleFlags = 32;
#[doc = " raw IMU data provided by IVRIOBuffer from paths to tracked devices with IMUs"]
pub type vr_Imu_OffScaleFlags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_ImuSample_t {
    pub fSampleTime: f64,
    pub vAccel: vr_HmdVector3d_t,
    pub vGyro: vr_HmdVector3d_t,
    pub unOffScaleFlags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_ImuSample_t"][::std::mem::size_of::<vr_ImuSample_t>() - 64usize];
    ["Alignment of vr_ImuSample_t"][::std::mem::align_of::<vr_ImuSample_t>() - 8usize];
    ["Offset of field: vr_ImuSample_t::fSampleTime"]
        [::std::mem::offset_of!(vr_ImuSample_t, fSampleTime) - 0usize];
    ["Offset of field: vr_ImuSample_t::vAccel"]
        [::std::mem::offset_of!(vr_ImuSample_t, vAccel) - 8usize];
    ["Offset of field: vr_ImuSample_t::vGyro"]
        [::std::mem::offset_of!(vr_ImuSample_t, vGyro) - 32usize];
    ["Offset of field: vr_ImuSample_t::unOffScaleFlags"]
        [::std::mem::offset_of!(vr_ImuSample_t, unOffScaleFlags) - 56usize];
};
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_UNKNOWN: vr_ECameraVideoStreamFormat = 0;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_RAW10: vr_ECameraVideoStreamFormat = 1;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_NV12: vr_ECameraVideoStreamFormat = 2;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_RGB24: vr_ECameraVideoStreamFormat = 3;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_NV12_2: vr_ECameraVideoStreamFormat = 4;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_YUYV16: vr_ECameraVideoStreamFormat = 5;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_BAYER16BG: vr_ECameraVideoStreamFormat = 6;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_MJPEG: vr_ECameraVideoStreamFormat = 7;
pub const vr_ECameraVideoStreamFormat_CVS_FORMAT_RGBX32: vr_ECameraVideoStreamFormat = 8;
pub const vr_ECameraVideoStreamFormat_CVS_MAX_FORMATS: vr_ECameraVideoStreamFormat = 9;
pub type vr_ECameraVideoStreamFormat = ::std::os::raw::c_uint;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_BULK_DEFAULT: vr_ECameraCompatibilityMode =
    0;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_BULK_64K_DMA: vr_ECameraCompatibilityMode =
    1;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_BULK_16K_DMA: vr_ECameraCompatibilityMode =
    2;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_BULK_8K_DMA: vr_ECameraCompatibilityMode =
    3;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_52FPS: vr_ECameraCompatibilityMode = 4;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_50FPS: vr_ECameraCompatibilityMode = 5;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_48FPS: vr_ECameraCompatibilityMode = 6;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_46FPS: vr_ECameraCompatibilityMode = 7;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_44FPS: vr_ECameraCompatibilityMode = 8;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_42FPS: vr_ECameraCompatibilityMode = 9;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_40FPS: vr_ECameraCompatibilityMode =
    10;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_35FPS: vr_ECameraCompatibilityMode =
    11;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_30FPS: vr_ECameraCompatibilityMode =
    12;
pub const vr_ECameraCompatibilityMode_CAMERA_COMPAT_MODE_ISO_15FPS: vr_ECameraCompatibilityMode =
    13;
pub const vr_ECameraCompatibilityMode_MAX_CAMERA_COMPAT_MODES: vr_ECameraCompatibilityMode = 14;
pub type vr_ECameraCompatibilityMode = ::std::os::raw::c_uint;
pub const vr_ECameraRoomViewStyle_CAMERA_ROOMVIEW_STYLE_DEFAULT: vr_ECameraRoomViewStyle = 0;
pub const vr_ECameraRoomViewStyle_CAMERA_ROOMVIEW_STYLE_EDGE_A: vr_ECameraRoomViewStyle = 1;
pub const vr_ECameraRoomViewStyle_CAMERA_ROOMVIEW_STYLE_EDGE_B: vr_ECameraRoomViewStyle = 2;
pub const vr_ECameraRoomViewStyle_CAMERA_ROOMVIEW_STYLE_VIDEO_TRANSLUSCENT:
    vr_ECameraRoomViewStyle = 3;
pub const vr_ECameraRoomViewStyle_CAMERA_ROOMVIEW_STYLE_VIDEO_OPAQUE: vr_ECameraRoomViewStyle = 4;
pub const vr_ECameraRoomViewStyle_CAMERA_ROOMVIEW_STYLE_COUNT: vr_ECameraRoomViewStyle = 5;
pub type vr_ECameraRoomViewStyle = ::std::os::raw::c_uint;
pub const vr_k_unMaxCameras: u32 = 4;
pub const vr_k_unMaxCameraFrameSharedHandles: u32 = 4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_CameraVideoStreamFrame_t {
    pub m_nStreamFormat: vr_ECameraVideoStreamFormat,
    pub m_nWidth: u32,
    pub m_nHeight: u32,
    pub m_nImageDataSize: u32,
    pub m_nFrameSequence: u32,
    pub m_nBufferIndex: u32,
    pub m_nBufferCount: u32,
    pub m_nExposureTime: u32,
    pub m_nISPFrameTimeStamp: u32,
    pub m_nISPReferenceTimeStamp: u32,
    pub m_nSyncCounter: u32,
    pub m_nCamSyncEvents: u32,
    pub m_nISPSyncEvents: u32,
    pub m_flReferenceCamSyncTime: f64,
    pub m_flFrameElapsedTime: f64,
    pub m_flFrameDeliveryRate: f64,
    pub m_flFrameCaptureTime_DriverAbsolute: f64,
    pub m_flFrameCaptureTime_ServerRelative: f64,
    pub m_nFrameCaptureTicks_ServerAbsolute: u64,
    pub m_flFrameCaptureTime_ClientRelative: f64,
    pub m_flSyncMarkerError: f64,
    pub m_RawTrackedDevicePose: vr_TrackedDevicePose_t,
    pub m_pImageData: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_CameraVideoStreamFrame_t"]
        [::std::mem::size_of::<vr_CameraVideoStreamFrame_t>() - 208usize];
    ["Alignment of vr_CameraVideoStreamFrame_t"]
        [::std::mem::align_of::<vr_CameraVideoStreamFrame_t>() - 8usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nStreamFormat"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nStreamFormat) - 0usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nWidth"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nWidth) - 4usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nHeight"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nHeight) - 8usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nImageDataSize"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nImageDataSize) - 12usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nFrameSequence"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nFrameSequence) - 16usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nBufferIndex"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nBufferIndex) - 20usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nBufferCount"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nBufferCount) - 24usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nExposureTime"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nExposureTime) - 28usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nISPFrameTimeStamp"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nISPFrameTimeStamp) - 32usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nISPReferenceTimeStamp"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nISPReferenceTimeStamp) - 36usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nSyncCounter"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nSyncCounter) - 40usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nCamSyncEvents"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nCamSyncEvents) - 44usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nISPSyncEvents"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_nISPSyncEvents) - 48usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flReferenceCamSyncTime"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_flReferenceCamSyncTime) - 56usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flFrameElapsedTime"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_flFrameElapsedTime) - 64usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flFrameDeliveryRate"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_flFrameDeliveryRate) - 72usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flFrameCaptureTime_DriverAbsolute"][::std::mem::offset_of!(
        vr_CameraVideoStreamFrame_t,
        m_flFrameCaptureTime_DriverAbsolute
    )
        - 80usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flFrameCaptureTime_ServerRelative"][::std::mem::offset_of!(
        vr_CameraVideoStreamFrame_t,
        m_flFrameCaptureTime_ServerRelative
    )
        - 88usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_nFrameCaptureTicks_ServerAbsolute"][::std::mem::offset_of!(
        vr_CameraVideoStreamFrame_t,
        m_nFrameCaptureTicks_ServerAbsolute
    )
        - 96usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flFrameCaptureTime_ClientRelative"][::std::mem::offset_of!(
        vr_CameraVideoStreamFrame_t,
        m_flFrameCaptureTime_ClientRelative
    )
        - 104usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_flSyncMarkerError"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_flSyncMarkerError) - 112usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_RawTrackedDevicePose"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_RawTrackedDevicePose) - 120usize];
    ["Offset of field: vr_CameraVideoStreamFrame_t::m_pImageData"]
        [::std::mem::offset_of!(vr_CameraVideoStreamFrame_t, m_pImageData) - 200usize];
};
pub const vr_EVRSettingsError_VRSettingsError_None: vr_EVRSettingsError = 0;
pub const vr_EVRSettingsError_VRSettingsError_IPCFailed: vr_EVRSettingsError = 1;
pub const vr_EVRSettingsError_VRSettingsError_WriteFailed: vr_EVRSettingsError = 2;
pub const vr_EVRSettingsError_VRSettingsError_ReadFailed: vr_EVRSettingsError = 3;
pub const vr_EVRSettingsError_VRSettingsError_JsonParseFailed: vr_EVRSettingsError = 4;
pub const vr_EVRSettingsError_VRSettingsError_UnsetSettingHasNoDefault: vr_EVRSettingsError = 5;
pub const vr_EVRSettingsError_VRSettingsError_AccessDenied: vr_EVRSettingsError = 6;
pub type vr_EVRSettingsError = ::std::os::raw::c_uint;
pub const vr_k_unMaxSettingsKeyLength: u32 = 128;
#[repr(C)]
pub struct vr_IVRSettings__bindgen_vtable {
    pub vr_IVRSettings_GetSettingsErrorNameFromEnum:
        unsafe extern "C" fn(
            this: *mut vr_IVRSettings,
            eError: vr_EVRSettingsError,
        ) -> *const ::std::os::raw::c_char,
    pub vr_IVRSettings_SetBool: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        bValue: bool,
        peError: *mut vr_EVRSettingsError,
    ),
    pub vr_IVRSettings_SetInt32: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        nValue: i32,
        peError: *mut vr_EVRSettingsError,
    ),
    pub vr_IVRSettings_SetFloat: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        flValue: f32,
        peError: *mut vr_EVRSettingsError,
    ),
    pub vr_IVRSettings_SetString: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        pchValue: *const ::std::os::raw::c_char,
        peError: *mut vr_EVRSettingsError,
    ),
    pub vr_IVRSettings_GetBool: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        peError: *mut vr_EVRSettingsError,
    ) -> bool,
    pub vr_IVRSettings_GetInt32: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        peError: *mut vr_EVRSettingsError,
    ) -> i32,
    pub vr_IVRSettings_GetFloat: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        peError: *mut vr_EVRSettingsError,
    ) -> f32,
    pub vr_IVRSettings_GetString: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        pchValue: *mut ::std::os::raw::c_char,
        unValueLen: u32,
        peError: *mut vr_EVRSettingsError,
    ),
    pub vr_IVRSettings_RemoveSection: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        peError: *mut vr_EVRSettingsError,
    ),
    pub vr_IVRSettings_RemoveKeyInSection: unsafe extern "C" fn(
        this: *mut vr_IVRSettings,
        pchSection: *const ::std::os::raw::c_char,
        pchSettingsKey: *const ::std::os::raw::c_char,
        peError: *mut vr_EVRSettingsError,
    ),
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRSettings {
    pub vtable_: *const vr_IVRSettings__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRSettings"][::std::mem::size_of::<vr_IVRSettings>() - 8usize];
    ["Alignment of vr_IVRSettings"][::std::mem::align_of::<vr_IVRSettings>() - 8usize];
};
pub const vr_IVRSettings_Version: &[u8; 16] = b"IVRSettings_003\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_CVRSettingHelper {
    pub m_pSettings: *mut vr_IVRSettings,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_CVRSettingHelper"][::std::mem::size_of::<vr_CVRSettingHelper>() - 8usize];
    ["Alignment of vr_CVRSettingHelper"][::std::mem::align_of::<vr_CVRSettingHelper>() - 8usize];
    ["Offset of field: vr_CVRSettingHelper::m_pSettings"]
        [::std::mem::offset_of!(vr_CVRSettingHelper, m_pSettings) - 0usize];
};
pub const vr_k_pch_SteamVR_Section: &[u8; 8] = b"steamvr\0";
pub const vr_k_pch_SteamVR_RequireHmd_String: &[u8; 11] = b"requireHmd\0";
pub const vr_k_pch_SteamVR_ForcedDriverKey_String: &[u8; 13] = b"forcedDriver\0";
pub const vr_k_pch_SteamVR_ForcedHmdKey_String: &[u8; 10] = b"forcedHmd\0";
pub const vr_k_pch_SteamVR_DisplayDebug_Bool: &[u8; 13] = b"displayDebug\0";
pub const vr_k_pch_SteamVR_DebugProcessPipe_String: &[u8; 17] = b"debugProcessPipe\0";
pub const vr_k_pch_SteamVR_DisplayDebugX_Int32: &[u8; 14] = b"displayDebugX\0";
pub const vr_k_pch_SteamVR_DisplayDebugY_Int32: &[u8; 14] = b"displayDebugY\0";
pub const vr_k_pch_SteamVR_SendSystemButtonToAllApps_Bool: &[u8; 26] =
    b"sendSystemButtonToAllApps\0";
pub const vr_k_pch_SteamVR_LogLevel_Int32: &[u8; 9] = b"loglevel\0";
pub const vr_k_pch_SteamVR_IPD_Float: &[u8; 4] = b"ipd\0";
pub const vr_k_pch_SteamVR_Background_String: &[u8; 11] = b"background\0";
pub const vr_k_pch_SteamVR_BackgroundUseDomeProjection_Bool: &[u8; 28] =
    b"backgroundUseDomeProjection\0";
pub const vr_k_pch_SteamVR_BackgroundCameraHeight_Float: &[u8; 23] = b"backgroundCameraHeight\0";
pub const vr_k_pch_SteamVR_BackgroundDomeRadius_Float: &[u8; 21] = b"backgroundDomeRadius\0";
pub const vr_k_pch_SteamVR_GridColor_String: &[u8; 10] = b"gridColor\0";
pub const vr_k_pch_SteamVR_PlayAreaColor_String: &[u8; 14] = b"playAreaColor\0";
pub const vr_k_pch_SteamVR_TrackingLossColor_String: &[u8; 18] = b"trackingLossColor\0";
pub const vr_k_pch_SteamVR_ShowStage_Bool: &[u8; 10] = b"showStage\0";
pub const vr_k_pch_SteamVR_DrawTrackingReferences_Bool: &[u8; 23] = b"drawTrackingReferences\0";
pub const vr_k_pch_SteamVR_ActivateMultipleDrivers_Bool: &[u8; 24] = b"activateMultipleDrivers\0";
pub const vr_k_pch_SteamVR_UsingSpeakers_Bool: &[u8; 14] = b"usingSpeakers\0";
pub const vr_k_pch_SteamVR_SpeakersForwardYawOffsetDegrees_Float: &[u8; 32] =
    b"speakersForwardYawOffsetDegrees\0";
pub const vr_k_pch_SteamVR_BaseStationPowerManagement_Int32: &[u8; 27] =
    b"basestationPowerManagement\0";
pub const vr_k_pch_SteamVR_ShowBaseStationPowerManagementTip_Int32: &[u8; 34] =
    b"ShowBaseStationPowerManagementTip\0";
pub const vr_k_pch_SteamVR_NeverKillProcesses_Bool: &[u8; 19] = b"neverKillProcesses\0";
pub const vr_k_pch_SteamVR_SupersampleScale_Float: &[u8; 17] = b"supersampleScale\0";
pub const vr_k_pch_SteamVR_MaxRecommendedResolution_Int32: &[u8; 25] =
    b"maxRecommendedResolution\0";
pub const vr_k_pch_SteamVR_MotionSmoothing_Bool: &[u8; 16] = b"motionSmoothing\0";
pub const vr_k_pch_SteamVR_MotionSmoothingOverride_Int32: &[u8; 24] = b"motionSmoothingOverride\0";
pub const vr_k_pch_SteamVR_FramesToThrottle_Int32: &[u8; 17] = b"framesToThrottle\0";
pub const vr_k_pch_SteamVR_AdditionalFramesToPredict_Int32: &[u8; 26] =
    b"additionalFramesToPredict\0";
pub const vr_k_pch_SteamVR_WorldScale_Float: &[u8; 11] = b"worldScale\0";
pub const vr_k_pch_SteamVR_FovScale_Int32: &[u8; 9] = b"fovScale\0";
pub const vr_k_pch_SteamVR_FovScaleInner_Int32: &[u8; 14] = b"fovScaleInner\0";
pub const vr_k_pch_SteamVR_FovScaleUpper_Int32: &[u8; 14] = b"fovScaleUpper\0";
pub const vr_k_pch_SteamVR_FovScaleLower_Int32: &[u8; 14] = b"fovScaleLower\0";
pub const vr_k_pch_SteamVR_FovScaleFormat_Int32: &[u8; 15] = b"fovScaleFormat\0";
pub const vr_k_pch_SteamVR_FovScaleLetterboxed_Bool: &[u8; 20] = b"fovScaleLetterboxed\0";
pub const vr_k_pch_SteamVR_DisableAsyncReprojection_Bool: &[u8; 13] = b"disableAsync\0";
pub const vr_k_pch_SteamVR_ForceFadeOnBadTracking_Bool: &[u8; 23] = b"forceFadeOnBadTracking\0";
pub const vr_k_pch_SteamVR_DefaultMirrorView_Int32: &[u8; 11] = b"mirrorView\0";
pub const vr_k_pch_SteamVR_ShowLegacyMirrorView_Bool: &[u8; 21] = b"showLegacyMirrorView\0";
pub const vr_k_pch_SteamVR_MirrorViewVisibility_Bool: &[u8; 15] = b"showMirrorView\0";
pub const vr_k_pch_SteamVR_MirrorViewDisplayMode_Int32: &[u8; 22] = b"mirrorViewDisplayMode\0";
pub const vr_k_pch_SteamVR_MirrorViewEye_Int32: &[u8; 14] = b"mirrorViewEye\0";
pub const vr_k_pch_SteamVR_MirrorViewGeometry_String: &[u8; 19] = b"mirrorViewGeometry\0";
pub const vr_k_pch_SteamVR_MirrorViewGeometryMaximized_String: &[u8; 28] =
    b"mirrorViewGeometryMaximized\0";
pub const vr_k_pch_SteamVR_PerfGraphVisibility_Bool: &[u8; 14] = b"showPerfGraph\0";
pub const vr_k_pch_SteamVR_StartMonitorFromAppLaunch: &[u8; 26] = b"startMonitorFromAppLaunch\0";
pub const vr_k_pch_SteamVR_StartCompositorFromAppLaunch_Bool: &[u8; 29] =
    b"startCompositorFromAppLaunch\0";
pub const vr_k_pch_SteamVR_StartDashboardFromAppLaunch_Bool: &[u8; 28] =
    b"startDashboardFromAppLaunch\0";
pub const vr_k_pch_SteamVR_StartOverlayAppsFromDashboard_Bool: &[u8; 30] =
    b"startOverlayAppsFromDashboard\0";
pub const vr_k_pch_SteamVR_EnableHomeApp: &[u8; 14] = b"enableHomeApp\0";
pub const vr_k_pch_SteamVR_CycleBackgroundImageTimeSec_Int32: &[u8; 28] =
    b"CycleBackgroundImageTimeSec\0";
pub const vr_k_pch_SteamVR_RetailDemo_Bool: &[u8; 11] = b"retailDemo\0";
pub const vr_k_pch_SteamVR_IpdOffset_Float: &[u8; 10] = b"ipdOffset\0";
pub const vr_k_pch_SteamVR_AllowSupersampleFiltering_Bool: &[u8; 26] =
    b"allowSupersampleFiltering\0";
pub const vr_k_pch_SteamVR_SupersampleManualOverride_Bool: &[u8; 26] =
    b"supersampleManualOverride\0";
pub const vr_k_pch_SteamVR_EnableLinuxVulkanAsync_Bool: &[u8; 23] = b"enableLinuxVulkanAsync\0";
pub const vr_k_pch_SteamVR_AllowDisplayLockedMode_Bool: &[u8; 23] = b"allowDisplayLockedMode\0";
pub const vr_k_pch_SteamVR_HaveStartedTutorialForNativeChaperoneDriver_Bool: &[u8; 44] =
    b"haveStartedTutorialForNativeChaperoneDriver\0";
pub const vr_k_pch_SteamVR_DebugInputBinding: &[u8; 18] = b"debugInputBinding\0";
pub const vr_k_pch_SteamVR_DoNotFadeToGrid: &[u8; 16] = b"doNotFadeToGrid\0";
pub const vr_k_pch_SteamVR_EnableSharedResourceJournaling: &[u8; 31] =
    b"enableSharedResourceJournaling\0";
pub const vr_k_pch_SteamVR_EnableSafeMode: &[u8; 15] = b"enableSafeMode\0";
pub const vr_k_pch_SteamVR_PreferredRefreshRate: &[u8; 21] = b"preferredRefreshRate\0";
pub const vr_k_pch_SteamVR_LastVersionNotice: &[u8; 18] = b"lastVersionNotice\0";
pub const vr_k_pch_SteamVR_LastVersionNoticeDate: &[u8; 22] = b"lastVersionNoticeDate\0";
pub const vr_k_pch_SteamVR_HmdDisplayColorGainR_Float: &[u8; 21] = b"hmdDisplayColorGainR\0";
pub const vr_k_pch_SteamVR_HmdDisplayColorGainG_Float: &[u8; 21] = b"hmdDisplayColorGainG\0";
pub const vr_k_pch_SteamVR_HmdDisplayColorGainB_Float: &[u8; 21] = b"hmdDisplayColorGainB\0";
pub const vr_k_pch_SteamVR_CustomIconStyle_String: &[u8; 16] = b"customIconStyle\0";
pub const vr_k_pch_SteamVR_CustomOffIconStyle_String: &[u8; 19] = b"customOffIconStyle\0";
pub const vr_k_pch_SteamVR_CustomIconForceUpdate_String: &[u8; 22] = b"customIconForceUpdate\0";
pub const vr_k_pch_SteamVR_AllowGlobalActionSetPriority: &[u8; 24] = b"globalActionSetPriority\0";
pub const vr_k_pch_SteamVR_OverlayRenderQuality: &[u8; 23] = b"overlayRenderQuality_2\0";
pub const vr_k_pch_SteamVR_BlockOculusSDKOnOpenVRLaunchOption_Bool: &[u8; 35] =
    b"blockOculusSDKOnOpenVRLaunchOption\0";
pub const vr_k_pch_SteamVR_BlockOculusSDKOnAllLaunches_Bool: &[u8; 28] =
    b"blockOculusSDKOnAllLaunches\0";
pub const vr_k_pch_SteamVR_HDCPLegacyCompatibility_Bool: &[u8; 26] = b"hdcp14legacyCompatibility\0";
pub const vr_k_pch_SteamVR_DisplayPortTrainingMode_Int: &[u8; 24] = b"displayPortTrainingMode\0";
pub const vr_k_pch_SteamVR_UsePrism_Bool: &[u8; 9] = b"usePrism\0";
pub const vr_k_pch_SteamVR_AllowFallbackMirrorWindowLinux_Bool: &[u8; 31] =
    b"allowFallbackMirrorWindowLinux\0";
pub const vr_k_pch_SteamVR_DisableKeyboardPrivacy_Bool: &[u8; 23] = b"disableKeyboardPrivacy\0";
pub const vr_k_pch_OpenXR_Section: &[u8; 7] = b"openxr\0";
pub const vr_k_pch_OpenXR_MetaUnityPluginCompatibility_Int32: &[u8; 29] =
    b"metaUnityPluginCompatibility\0";
pub const vr_k_pch_DirectMode_Section: &[u8; 12] = b"direct_mode\0";
pub const vr_k_pch_DirectMode_Enable_Bool: &[u8; 7] = b"enable\0";
pub const vr_k_pch_DirectMode_Count_Int32: &[u8; 6] = b"count\0";
pub const vr_k_pch_DirectMode_EdidVid_Int32: &[u8; 8] = b"edidVid\0";
pub const vr_k_pch_DirectMode_EdidPid_Int32: &[u8; 8] = b"edidPid\0";
pub const vr_k_pch_Lighthouse_Section: &[u8; 18] = b"driver_lighthouse\0";
pub const vr_k_pch_Lighthouse_DisableIMU_Bool: &[u8; 11] = b"disableimu\0";
pub const vr_k_pch_Lighthouse_DisableIMUExceptHMD_Bool: &[u8; 20] = b"disableimuexcepthmd\0";
pub const vr_k_pch_Lighthouse_UseDisambiguation_String: &[u8; 18] = b"usedisambiguation\0";
pub const vr_k_pch_Lighthouse_DisambiguationDebug_Int32: &[u8; 20] = b"disambiguationdebug\0";
pub const vr_k_pch_Lighthouse_PrimaryBasestation_Int32: &[u8; 19] = b"primarybasestation\0";
pub const vr_k_pch_Lighthouse_DBHistory_Bool: &[u8; 10] = b"dbhistory\0";
pub const vr_k_pch_Lighthouse_EnableBluetooth_Bool: &[u8; 16] = b"enableBluetooth\0";
pub const vr_k_pch_Lighthouse_PowerManagedBaseStations_String: &[u8; 25] =
    b"PowerManagedBaseStations\0";
pub const vr_k_pch_Lighthouse_PowerManagedBaseStations2_String: &[u8; 26] =
    b"PowerManagedBaseStations2\0";
pub const vr_k_pch_Lighthouse_InactivityTimeoutForBaseStations_Int32: &[u8; 33] =
    b"InactivityTimeoutForBaseStations\0";
pub const vr_k_pch_Lighthouse_EnableImuFallback_Bool: &[u8; 18] = b"enableImuFallback\0";
pub const vr_k_pch_Null_Section: &[u8; 12] = b"driver_null\0";
pub const vr_k_pch_Null_SerialNumber_String: &[u8; 13] = b"serialNumber\0";
pub const vr_k_pch_Null_ModelNumber_String: &[u8; 12] = b"modelNumber\0";
pub const vr_k_pch_Null_WindowX_Int32: &[u8; 8] = b"windowX\0";
pub const vr_k_pch_Null_WindowY_Int32: &[u8; 8] = b"windowY\0";
pub const vr_k_pch_Null_WindowWidth_Int32: &[u8; 12] = b"windowWidth\0";
pub const vr_k_pch_Null_WindowHeight_Int32: &[u8; 13] = b"windowHeight\0";
pub const vr_k_pch_Null_RenderWidth_Int32: &[u8; 12] = b"renderWidth\0";
pub const vr_k_pch_Null_RenderHeight_Int32: &[u8; 13] = b"renderHeight\0";
pub const vr_k_pch_Null_SecondsFromVsyncToPhotons_Float: &[u8; 26] = b"secondsFromVsyncToPhotons\0";
pub const vr_k_pch_Null_DisplayFrequency_Float: &[u8; 17] = b"displayFrequency\0";
pub const vr_k_pch_WindowsMR_Section: &[u8; 19] = b"driver_holographic\0";
pub const vr_k_pch_UserInterface_Section: &[u8; 14] = b"userinterface\0";
pub const vr_k_pch_UserInterface_StatusAlwaysOnTop_Bool: &[u8; 18] = b"StatusAlwaysOnTop\0";
pub const vr_k_pch_UserInterface_MinimizeToTray_Bool: &[u8; 15] = b"MinimizeToTray\0";
pub const vr_k_pch_UserInterface_HidePopupsWhenStatusMinimized_Bool: &[u8; 30] =
    b"HidePopupsWhenStatusMinimized\0";
pub const vr_k_pch_UserInterface_Screenshots_Bool: &[u8; 12] = b"screenshots\0";
pub const vr_k_pch_UserInterface_ScreenshotType_Int: &[u8; 15] = b"screenshotType\0";
pub const vr_k_pch_UserInterface_CheckStatusInterval_Int: &[u8; 23] = b"vrmStatusCheckInterval\0";
pub const vr_k_pch_UserInterface_CheckForSteam_Bool: &[u8; 17] = b"vrmCheckForSteam\0";
pub const vr_k_pch_Notifications_Section: &[u8; 14] = b"notifications\0";
pub const vr_k_pch_Notifications_DoNotDisturb_Bool: &[u8; 13] = b"DoNotDisturb\0";
pub const vr_k_pch_Keyboard_Section: &[u8; 9] = b"keyboard\0";
pub const vr_k_pch_Keyboard_TutorialCompletions: &[u8; 20] = b"TutorialCompletions\0";
pub const vr_k_pch_Keyboard_ScaleX: &[u8; 7] = b"ScaleX\0";
pub const vr_k_pch_Keyboard_ScaleY: &[u8; 7] = b"ScaleY\0";
pub const vr_k_pch_Keyboard_OffsetLeftX: &[u8; 12] = b"OffsetLeftX\0";
pub const vr_k_pch_Keyboard_OffsetRightX: &[u8; 13] = b"OffsetRightX\0";
pub const vr_k_pch_Keyboard_OffsetY: &[u8; 8] = b"OffsetY\0";
pub const vr_k_pch_Keyboard_Smoothing: &[u8; 10] = b"Smoothing\0";
pub const vr_k_pch_Perf_Section: &[u8; 10] = b"perfcheck\0";
pub const vr_k_pch_Perf_PerfGraphInHMD_Bool: &[u8; 15] = b"perfGraphInHMD\0";
pub const vr_k_pch_Perf_AllowTimingStore_Bool: &[u8; 17] = b"allowTimingStore\0";
pub const vr_k_pch_Perf_SaveTimingsOnExit_Bool: &[u8; 18] = b"saveTimingsOnExit\0";
pub const vr_k_pch_Perf_TestData_Float: &[u8; 13] = b"perfTestData\0";
pub const vr_k_pch_Perf_GPUProfiling_Bool: &[u8; 13] = b"GPUProfiling\0";
pub const vr_k_pch_Perf_GpuBusMonitoring_Bool: &[u8; 17] = b"gpuBusMonitoring\0";
pub const vr_k_pch_CollisionBounds_Section: &[u8; 16] = b"collisionBounds\0";
pub const vr_k_pch_CollisionBounds_Style_Int32: &[u8; 21] = b"CollisionBoundsStyle\0";
pub const vr_k_pch_CollisionBounds_GroundPerimeterOn_Bool: &[u8; 33] =
    b"CollisionBoundsGroundPerimeterOn\0";
pub const vr_k_pch_CollisionBounds_CenterMarkerOn_Bool: &[u8; 30] =
    b"CollisionBoundsCenterMarkerOn\0";
pub const vr_k_pch_CollisionBounds_PlaySpaceOn_Bool: &[u8; 27] = b"CollisionBoundsPlaySpaceOn\0";
pub const vr_k_pch_CollisionBounds_FadeDistance_Float: &[u8; 28] = b"CollisionBoundsFadeDistance\0";
pub const vr_k_pch_CollisionBounds_WallHeight_Float: &[u8; 26] = b"CollisionBoundsWallHeight\0";
pub const vr_k_pch_CollisionBounds_ColorGammaR_Int32: &[u8; 27] = b"CollisionBoundsColorGammaR\0";
pub const vr_k_pch_CollisionBounds_ColorGammaG_Int32: &[u8; 27] = b"CollisionBoundsColorGammaG\0";
pub const vr_k_pch_CollisionBounds_ColorGammaB_Int32: &[u8; 27] = b"CollisionBoundsColorGammaB\0";
pub const vr_k_pch_CollisionBounds_ColorGammaA_Int32: &[u8; 27] = b"CollisionBoundsColorGammaA\0";
pub const vr_k_pch_CollisionBounds_EnableDriverImport: &[u8; 25] = b"enableDriverBoundsImport\0";
pub const vr_k_pch_Camera_Section: &[u8; 7] = b"camera\0";
pub const vr_k_pch_Camera_EnableCamera_Bool: &[u8; 13] = b"enableCamera\0";
pub const vr_k_pch_Camera_ShowOnController_Bool: &[u8; 17] = b"showOnController\0";
pub const vr_k_pch_Camera_EnableCameraForCollisionBounds_Bool: &[u8; 31] =
    b"enableCameraForCollisionBounds\0";
pub const vr_k_pch_Camera_RoomView_Int32: &[u8; 9] = b"roomView\0";
pub const vr_k_pch_Camera_BoundsColorGammaR_Int32: &[u8; 24] = b"cameraBoundsColorGammaR\0";
pub const vr_k_pch_Camera_BoundsColorGammaG_Int32: &[u8; 24] = b"cameraBoundsColorGammaG\0";
pub const vr_k_pch_Camera_BoundsColorGammaB_Int32: &[u8; 24] = b"cameraBoundsColorGammaB\0";
pub const vr_k_pch_Camera_BoundsColorGammaA_Int32: &[u8; 24] = b"cameraBoundsColorGammaA\0";
pub const vr_k_pch_Camera_BoundsStrength_Int32: &[u8; 21] = b"cameraBoundsStrength\0";
pub const vr_k_pch_Camera_RoomViewStyle_Int32: &[u8; 14] = b"roomViewStyle\0";
pub const vr_k_pch_audio_Section: &[u8; 6] = b"audio\0";
pub const vr_k_pch_audio_SetOsDefaultPlaybackDevice_Bool: &[u8; 27] =
    b"setOsDefaultPlaybackDevice\0";
pub const vr_k_pch_audio_EnablePlaybackDeviceOverride_Bool: &[u8; 29] =
    b"enablePlaybackDeviceOverride\0";
pub const vr_k_pch_audio_PlaybackDeviceOverride_String: &[u8; 23] = b"playbackDeviceOverride\0";
pub const vr_k_pch_audio_PlaybackDeviceOverrideName_String: &[u8; 27] =
    b"playbackDeviceOverrideName\0";
pub const vr_k_pch_audio_SetOsDefaultRecordingDevice_Bool: &[u8; 28] =
    b"setOsDefaultRecordingDevice\0";
pub const vr_k_pch_audio_EnableRecordingDeviceOverride_Bool: &[u8; 30] =
    b"enableRecordingDeviceOverride\0";
pub const vr_k_pch_audio_RecordingDeviceOverride_String: &[u8; 24] = b"recordingDeviceOverride\0";
pub const vr_k_pch_audio_RecordingDeviceOverrideName_String: &[u8; 28] =
    b"recordingDeviceOverrideName\0";
pub const vr_k_pch_audio_EnablePlaybackMirror_Bool: &[u8; 21] = b"enablePlaybackMirror\0";
pub const vr_k_pch_audio_PlaybackMirrorDevice_String: &[u8; 21] = b"playbackMirrorDevice\0";
pub const vr_k_pch_audio_PlaybackMirrorDeviceName_String: &[u8; 25] = b"playbackMirrorDeviceName\0";
pub const vr_k_pch_audio_OldPlaybackMirrorDevice_String: &[u8; 23] = b"onPlaybackMirrorDevice\0";
pub const vr_k_pch_audio_ActiveMirrorDevice_String: &[u8; 27] = b"activePlaybackMirrorDevice\0";
pub const vr_k_pch_audio_EnablePlaybackMirrorIndependentVolume_Bool: &[u8; 38] =
    b"enablePlaybackMirrorIndependentVolume\0";
pub const vr_k_pch_audio_LastHmdPlaybackDeviceId_String: &[u8; 24] = b"lastHmdPlaybackDeviceId\0";
pub const vr_k_pch_audio_VIVEHDMIGain: &[u8; 13] = b"viveHDMIGain\0";
pub const vr_k_pch_audio_DualSpeakerAndJackOutput_Bool: &[u8; 25] = b"dualSpeakerAndJackOutput\0";
pub const vr_k_pch_audio_MuteMicMonitor_Bool: &[u8; 15] = b"muteMicMonitor\0";
pub const vr_k_pch_Power_Section: &[u8; 6] = b"power\0";
pub const vr_k_pch_Power_PowerOffOnExit_Bool: &[u8; 15] = b"powerOffOnExit\0";
pub const vr_k_pch_Power_TurnOffScreensTimeout_Float: &[u8; 22] = b"turnOffScreensTimeout\0";
pub const vr_k_pch_Power_TurnOffControllersTimeout_Float: &[u8; 26] =
    b"turnOffControllersTimeout\0";
pub const vr_k_pch_Power_ReturnToWatchdogTimeout_Float: &[u8; 24] = b"returnToWatchdogTimeout\0";
pub const vr_k_pch_Power_AutoLaunchSteamVROnButtonPress: &[u8; 31] =
    b"autoLaunchSteamVROnButtonPress\0";
pub const vr_k_pch_Power_PauseCompositorOnStandby_Bool: &[u8; 25] = b"pauseCompositorOnStandby\0";
pub const vr_k_pch_Dashboard_Section: &[u8; 10] = b"dashboard\0";
pub const vr_k_pch_Dashboard_EnableDashboard_Bool: &[u8; 16] = b"enableDashboard\0";
pub const vr_k_pch_Dashboard_ArcadeMode_Bool: &[u8; 11] = b"arcadeMode\0";
pub const vr_k_pch_Dashboard_Position: &[u8; 9] = b"position\0";
pub const vr_k_pch_Dashboard_DesktopScale: &[u8; 13] = b"desktopScale\0";
pub const vr_k_pch_Dashboard_DashboardScale: &[u8; 15] = b"dashboardScale\0";
pub const vr_k_pch_Dashboard_UseStandaloneSystemLayer: &[u8; 22] = b"standaloneSystemLayer\0";
pub const vr_k_pch_Dashboard_AllowSteamOverlays_Bool: &[u8; 19] = b"allowSteamOverlays\0";
pub const vr_k_pch_Dashboard_AllowVRGamepadUI_Bool: &[u8; 17] = b"allowVRGamepadUI\0";
pub const vr_k_pch_Dashboard_AllowVRGamepadUIViaGamescope_Bool: &[u8; 29] =
    b"allowVRGamepadUIViaGamescope\0";
pub const vr_k_pch_Dashboard_SteamMatchesHMDFramerate: &[u8; 25] = b"steamMatchesHMDFramerate\0";
pub const vr_k_pch_Dashboard_GrabHandleAcceleration: &[u8; 23] = b"grabHandleAcceleration\0";
pub const vr_k_pch_modelskin_Section: &[u8; 11] = b"modelskins\0";
pub const vr_k_pch_Driver_Enable_Bool: &[u8; 7] = b"enable\0";
pub const vr_k_pch_Driver_BlockedBySafemode_Bool: &[u8; 21] = b"blocked_by_safe_mode\0";
pub const vr_k_pch_Driver_LoadPriority_Int32: &[u8; 13] = b"loadPriority\0";
pub const vr_k_pch_Driver_Hmd_AllowsClientToControlTextureIndex_Bool: &[u8; 37] =
    b"hmdAllowsClientToControlTextureIndex\0";
pub const vr_k_pch_Driver_ForceSystemLayerUseAppPoses_Bool: &[u8; 28] =
    b"forceSystemLayerUseAppPoses\0";
pub const vr_k_pch_WebInterface_Section: &[u8; 13] = b"WebInterface\0";
pub const vr_k_pch_VRWebHelper_Section: &[u8; 12] = b"VRWebHelper\0";
pub const vr_k_pch_VRWebHelper_DebuggerEnabled_Bool: &[u8; 16] = b"DebuggerEnabled\0";
pub const vr_k_pch_VRWebHelper_DebuggerPort_Int32: &[u8; 13] = b"DebuggerPort\0";
pub const vr_k_pch_TrackingOverride_Section: &[u8; 18] = b"TrackingOverrides\0";
pub const vr_k_pch_App_BindingAutosaveURLSuffix_String: &[u8; 12] = b"AutosaveURL\0";
pub const vr_k_pch_App_BindingLegacyAPISuffix_String: &[u8; 8] = b"_legacy\0";
pub const vr_k_pch_App_BindingSteamVRInputAPISuffix_String: &[u8; 14] = b"_steamvrinput\0";
pub const vr_k_pch_App_BindingOpenXRAPISuffix_String: &[u8; 8] = b"_openxr\0";
pub const vr_k_pch_App_BindingCurrentURLSuffix_String: &[u8; 11] = b"CurrentURL\0";
pub const vr_k_pch_App_BindingPreviousURLSuffix_String: &[u8; 12] = b"PreviousURL\0";
pub const vr_k_pch_App_NeedToUpdateAutosaveSuffix_Bool: &[u8; 21] = b"NeedToUpdateAutosave\0";
pub const vr_k_pch_App_DominantHand_Int32: &[u8; 13] = b"DominantHand\0";
pub const vr_k_pch_App_BlockOculusSDK_Bool: &[u8; 15] = b"blockOculusSDK\0";
pub const vr_k_pch_Trackers_Section: &[u8; 9] = b"trackers\0";
pub const vr_k_pch_DesktopUI_Section: &[u8; 10] = b"DesktopUI\0";
pub const vr_k_pch_LastKnown_Section: &[u8; 10] = b"LastKnown\0";
pub const vr_k_pch_LastKnown_HMDManufacturer_String: &[u8; 16] = b"HMDManufacturer\0";
pub const vr_k_pch_LastKnown_HMDModel_String: &[u8; 9] = b"HMDModel\0";
pub const vr_k_pch_LastKnown_ActualHMDDriver_String: &[u8; 16] = b"ActualHMDDriver\0";
pub const vr_k_pch_LastKnown_HMDSerialNumber_String: &[u8; 16] = b"HMDSerialNumber\0";
pub const vr_k_pch_LastKnown_HMDRemoteClientID_String: &[u8; 15] = b"RemoteClientID\0";
pub const vr_k_pch_DismissedWarnings_Section: &[u8; 18] = b"DismissedWarnings\0";
pub const vr_k_pch_Input_Section: &[u8; 6] = b"input\0";
pub const vr_k_pch_Input_LeftThumbstickRotation_Float: &[u8; 23] = b"leftThumbstickRotation\0";
pub const vr_k_pch_Input_RightThumbstickRotation_Float: &[u8; 24] = b"rightThumbstickRotation\0";
pub const vr_k_pch_Input_ThumbstickDeadzone_Float: &[u8; 19] = b"thumbstickDeadzone\0";
pub const vr_k_pch_GpuSpeed_Section: &[u8; 9] = b"GpuSpeed\0";
pub const vr_k_pch_XRRenderModelCache_Section: &[u8; 23] = b"XRRenderModelUuidCache\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_DriverPoseQuaternion_t {
    pub w: f64,
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_DriverPoseQuaternion_t"]
        [::std::mem::size_of::<vr_DriverPoseQuaternion_t>() - 32usize];
    ["Alignment of vr_DriverPoseQuaternion_t"]
        [::std::mem::align_of::<vr_DriverPoseQuaternion_t>() - 8usize];
    ["Offset of field: vr_DriverPoseQuaternion_t::w"]
        [::std::mem::offset_of!(vr_DriverPoseQuaternion_t, w) - 0usize];
    ["Offset of field: vr_DriverPoseQuaternion_t::x"]
        [::std::mem::offset_of!(vr_DriverPoseQuaternion_t, x) - 8usize];
    ["Offset of field: vr_DriverPoseQuaternion_t::y"]
        [::std::mem::offset_of!(vr_DriverPoseQuaternion_t, y) - 16usize];
    ["Offset of field: vr_DriverPoseQuaternion_t::z"]
        [::std::mem::offset_of!(vr_DriverPoseQuaternion_t, z) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_DriverPose_t {
    pub poseTimeOffset: f64,
    pub qWorldFromDriverRotation: vr_HmdQuaternion_t,
    pub vecWorldFromDriverTranslation: [f64; 3usize],
    pub qDriverFromHeadRotation: vr_HmdQuaternion_t,
    pub vecDriverFromHeadTranslation: [f64; 3usize],
    pub vecPosition: [f64; 3usize],
    pub vecVelocity: [f64; 3usize],
    pub vecAcceleration: [f64; 3usize],
    pub qRotation: vr_HmdQuaternion_t,
    pub vecAngularVelocity: [f64; 3usize],
    pub vecAngularAcceleration: [f64; 3usize],
    pub result: vr_ETrackingResult,
    pub poseIsValid: bool,
    pub willDriftInYaw: bool,
    pub shouldApplyHeadModel: bool,
    pub deviceIsConnected: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_DriverPose_t"][::std::mem::size_of::<vr_DriverPose_t>() - 280usize];
    ["Alignment of vr_DriverPose_t"][::std::mem::align_of::<vr_DriverPose_t>() - 8usize];
    ["Offset of field: vr_DriverPose_t::poseTimeOffset"]
        [::std::mem::offset_of!(vr_DriverPose_t, poseTimeOffset) - 0usize];
    ["Offset of field: vr_DriverPose_t::qWorldFromDriverRotation"]
        [::std::mem::offset_of!(vr_DriverPose_t, qWorldFromDriverRotation) - 8usize];
    ["Offset of field: vr_DriverPose_t::vecWorldFromDriverTranslation"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecWorldFromDriverTranslation) - 40usize];
    ["Offset of field: vr_DriverPose_t::qDriverFromHeadRotation"]
        [::std::mem::offset_of!(vr_DriverPose_t, qDriverFromHeadRotation) - 64usize];
    ["Offset of field: vr_DriverPose_t::vecDriverFromHeadTranslation"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecDriverFromHeadTranslation) - 96usize];
    ["Offset of field: vr_DriverPose_t::vecPosition"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecPosition) - 120usize];
    ["Offset of field: vr_DriverPose_t::vecVelocity"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecVelocity) - 144usize];
    ["Offset of field: vr_DriverPose_t::vecAcceleration"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecAcceleration) - 168usize];
    ["Offset of field: vr_DriverPose_t::qRotation"]
        [::std::mem::offset_of!(vr_DriverPose_t, qRotation) - 192usize];
    ["Offset of field: vr_DriverPose_t::vecAngularVelocity"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecAngularVelocity) - 224usize];
    ["Offset of field: vr_DriverPose_t::vecAngularAcceleration"]
        [::std::mem::offset_of!(vr_DriverPose_t, vecAngularAcceleration) - 248usize];
    ["Offset of field: vr_DriverPose_t::result"]
        [::std::mem::offset_of!(vr_DriverPose_t, result) - 272usize];
    ["Offset of field: vr_DriverPose_t::poseIsValid"]
        [::std::mem::offset_of!(vr_DriverPose_t, poseIsValid) - 276usize];
    ["Offset of field: vr_DriverPose_t::willDriftInYaw"]
        [::std::mem::offset_of!(vr_DriverPose_t, willDriftInYaw) - 277usize];
    ["Offset of field: vr_DriverPose_t::shouldApplyHeadModel"]
        [::std::mem::offset_of!(vr_DriverPose_t, shouldApplyHeadModel) - 278usize];
    ["Offset of field: vr_DriverPose_t::deviceIsConnected"]
        [::std::mem::offset_of!(vr_DriverPose_t, deviceIsConnected) - 279usize];
};
#[repr(C)]
pub struct vr_ITrackedDeviceServerDriver__bindgen_vtable {
    pub vr_ITrackedDeviceServerDriver_Activate: unsafe extern "C" fn(
        this: *mut vr_ITrackedDeviceServerDriver,
        unObjectId: u32,
    ) -> vr_EVRInitError,
    pub vr_ITrackedDeviceServerDriver_Deactivate:
        unsafe extern "C" fn(this: *mut vr_ITrackedDeviceServerDriver),
    pub vr_ITrackedDeviceServerDriver_EnterStandby:
        unsafe extern "C" fn(this: *mut vr_ITrackedDeviceServerDriver),
    pub vr_ITrackedDeviceServerDriver_GetComponent:
        unsafe extern "C" fn(
            this: *mut vr_ITrackedDeviceServerDriver,
            pchComponentNameAndVersion: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_void,
    pub vr_ITrackedDeviceServerDriver_DebugRequest: unsafe extern "C" fn(
        this: *mut vr_ITrackedDeviceServerDriver,
        pchRequest: *const ::std::os::raw::c_char,
        pchResponseBuffer: *mut ::std::os::raw::c_char,
        unResponseBufferSize: u32,
    ),
    pub vr_ITrackedDeviceServerDriver_GetPose:
        unsafe extern "C" fn(this: *mut vr_ITrackedDeviceServerDriver) -> vr_DriverPose_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_ITrackedDeviceServerDriver {
    pub vtable_: *const vr_ITrackedDeviceServerDriver__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_ITrackedDeviceServerDriver"]
        [::std::mem::size_of::<vr_ITrackedDeviceServerDriver>() - 8usize];
    ["Alignment of vr_ITrackedDeviceServerDriver"]
        [::std::mem::align_of::<vr_ITrackedDeviceServerDriver>() - 8usize];
};
pub const vr_ITrackedDeviceServerDriver_Version: &[u8; 31] = b"ITrackedDeviceServerDriver_005\0";
#[repr(C)]
pub struct vr_IVRDisplayComponent__bindgen_vtable {
    pub vr_IVRDisplayComponent_GetWindowBounds: unsafe extern "C" fn(
        this: *mut vr_IVRDisplayComponent,
        pnX: *mut i32,
        pnY: *mut i32,
        pnWidth: *mut u32,
        pnHeight: *mut u32,
    ),
    pub vr_IVRDisplayComponent_IsDisplayOnDesktop:
        unsafe extern "C" fn(this: *mut vr_IVRDisplayComponent) -> bool,
    pub vr_IVRDisplayComponent_IsDisplayRealDisplay:
        unsafe extern "C" fn(this: *mut vr_IVRDisplayComponent) -> bool,
    pub vr_IVRDisplayComponent_GetRecommendedRenderTargetSize: unsafe extern "C" fn(
        this: *mut vr_IVRDisplayComponent,
        pnWidth: *mut u32,
        pnHeight: *mut u32,
    ),
    pub vr_IVRDisplayComponent_GetEyeOutputViewport: unsafe extern "C" fn(
        this: *mut vr_IVRDisplayComponent,
        eEye: vr_EVREye,
        pnX: *mut u32,
        pnY: *mut u32,
        pnWidth: *mut u32,
        pnHeight: *mut u32,
    ),
    pub vr_IVRDisplayComponent_GetProjectionRaw: unsafe extern "C" fn(
        this: *mut vr_IVRDisplayComponent,
        eEye: vr_EVREye,
        pfLeft: *mut f32,
        pfRight: *mut f32,
        pfTop: *mut f32,
        pfBottom: *mut f32,
    ),
    pub vr_IVRDisplayComponent_ComputeDistortion:
        unsafe extern "C" fn(
            this: *mut vr_IVRDisplayComponent,
            eEye: vr_EVREye,
            fU: f32,
            fV: f32,
        ) -> vr_DistortionCoordinates_t,
    pub vr_IVRDisplayComponent_ComputeInverseDistortion: unsafe extern "C" fn(
        this: *mut vr_IVRDisplayComponent,
        pResult: *mut vr_HmdVector2_t,
        eEye: vr_EVREye,
        unChannel: u32,
        fU: f32,
        fV: f32,
    ) -> bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDisplayComponent {
    pub vtable_: *const vr_IVRDisplayComponent__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDisplayComponent"][::std::mem::size_of::<vr_IVRDisplayComponent>() - 8usize];
    ["Alignment of vr_IVRDisplayComponent"]
        [::std::mem::align_of::<vr_IVRDisplayComponent>() - 8usize];
};
pub const vr_IVRDisplayComponent_Version: &[u8; 24] = b"IVRDisplayComponent_003\0";
pub const vr_VRSwapTextureFlag_VRSwapTextureFlag_Shared_NTHandle: vr_VRSwapTextureFlag = 1;
pub type vr_VRSwapTextureFlag = ::std::os::raw::c_uint;
#[repr(C)]
pub struct vr_IVRDriverDirectModeComponent__bindgen_vtable {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverDirectModeComponent {
    pub vtable_: *const vr_IVRDriverDirectModeComponent__bindgen_vtable,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t {
    pub nWidth: u32,
    pub nHeight: u32,
    pub nFormat: u32,
    pub nSampleCount: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t"]
        [::std::mem::size_of::<vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t>() - 16usize];
    ["Alignment of vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t"]
        [::std::mem::align_of::<vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t>() - 4usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t::nWidth"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t,
        nWidth
    ) - 0usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t::nHeight"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t,
        nHeight
    ) - 4usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t::nFormat"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t,
        nFormat
    ) - 8usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t::nSampleCount"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SwapTextureSetDesc_t,
        nSampleCount
    )
        - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverDirectModeComponent_SwapTextureSet_t {
    pub rSharedTextureHandles: [vr_SharedTextureHandle_t; 3usize],
    pub unTextureFlags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverDirectModeComponent_SwapTextureSet_t"]
        [::std::mem::size_of::<vr_IVRDriverDirectModeComponent_SwapTextureSet_t>() - 32usize];
    ["Alignment of vr_IVRDriverDirectModeComponent_SwapTextureSet_t"]
        [::std::mem::align_of::<vr_IVRDriverDirectModeComponent_SwapTextureSet_t>() - 8usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SwapTextureSet_t::rSharedTextureHandles"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SwapTextureSet_t,
        rSharedTextureHandles
    )
        - 0usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SwapTextureSet_t::unTextureFlags"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SwapTextureSet_t,
        unTextureFlags
    )
        - 24usize];
};
#[doc = " Call once per layer to draw for this frame.  One shared texture handle per eye.  Textures must be created\n using CreateSwapTextureSet and should be alternated per frame.  Call Present once all layers have been submitted."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t {
    pub hTexture: vr_SharedTextureHandle_t,
    pub hDepthTexture: vr_SharedTextureHandle_t,
    pub bounds: vr_VRTextureBounds_t,
    pub mProjection: vr_HmdMatrix44_t,
    pub mHmdPose: vr_HmdMatrix34_t,
    pub flHmdPosePredictionTimeInSecondsFromNow: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t"]
        [::std::mem::size_of::<vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t>() - 152usize];
    ["Alignment of vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t"]
        [::std::mem::align_of::<vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t>() - 8usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t::hTexture"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t,
        hTexture
    ) - 0usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t::hDepthTexture"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t,
        hDepthTexture
    )
        - 8usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t::bounds"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t,
        bounds
    ) - 16usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t::mProjection"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t,
        mProjection
    )
        - 32usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t::mHmdPose"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t,
        mHmdPose
    ) - 96usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t::flHmdPosePredictionTimeInSecondsFromNow"] [:: std :: mem :: offset_of ! (vr_IVRDriverDirectModeComponent_SubmitLayerPerEye_t , flHmdPosePredictionTimeInSecondsFromNow) - 144usize] ;
};
#[doc = " Called after Present to allow driver to take more time until vsync after they've successfully acquired the sync texture in Present.\n Set Prop_Hmd_SupportsAppThrottling_Bool to enable throttling / prediction UI in per-app video settings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverDirectModeComponent_Throttling_t {
    pub nFramesToThrottle: u32,
    pub nAdditionalFramesToPredict: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverDirectModeComponent_Throttling_t"]
        [::std::mem::size_of::<vr_IVRDriverDirectModeComponent_Throttling_t>() - 8usize];
    ["Alignment of vr_IVRDriverDirectModeComponent_Throttling_t"]
        [::std::mem::align_of::<vr_IVRDriverDirectModeComponent_Throttling_t>() - 4usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_Throttling_t::nFramesToThrottle"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_Throttling_t,
        nFramesToThrottle
    )
        - 0usize];
    ["Offset of field: vr_IVRDriverDirectModeComponent_Throttling_t::nAdditionalFramesToPredict"][::std::mem::offset_of!(
        vr_IVRDriverDirectModeComponent_Throttling_t,
        nAdditionalFramesToPredict
    )
        - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverDirectModeComponent"]
        [::std::mem::size_of::<vr_IVRDriverDirectModeComponent>() - 8usize];
    ["Alignment of vr_IVRDriverDirectModeComponent"]
        [::std::mem::align_of::<vr_IVRDriverDirectModeComponent>() - 8usize];
};
pub const vr_IVRDriverDirectModeComponent_Version: &[u8; 33] =
    b"IVRDriverDirectModeComponent_009\0";
#[repr(C)]
pub struct vr_ICameraVideoSinkCallback__bindgen_vtable {
    pub vr_ICameraVideoSinkCallback_OnCameraVideoSinkCallback:
        unsafe extern "C" fn(this: *mut vr_ICameraVideoSinkCallback),
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_ICameraVideoSinkCallback {
    pub vtable_: *const vr_ICameraVideoSinkCallback__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_ICameraVideoSinkCallback"]
        [::std::mem::size_of::<vr_ICameraVideoSinkCallback>() - 8usize];
    ["Alignment of vr_ICameraVideoSinkCallback"]
        [::std::mem::align_of::<vr_ICameraVideoSinkCallback>() - 8usize];
};
#[repr(C)]
pub struct vr_IVRCameraComponent__bindgen_vtable {
    pub vr_IVRCameraComponent_GetCameraFrameDimensions: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nVideoStreamFormat: vr_ECameraVideoStreamFormat,
        pWidth: *mut u32,
        pHeight: *mut u32,
    ) -> bool,
    pub vr_IVRCameraComponent_GetCameraFrameBufferingRequirements: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        pDefaultFrameQueueSize: *mut ::std::os::raw::c_int,
        pFrameBufferDataSize: *mut u32,
    )
        -> bool,
    pub vr_IVRCameraComponent_SetCameraFrameBuffering: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nFrameBufferCount: ::std::os::raw::c_int,
        ppFrameBuffers: *mut *mut ::std::os::raw::c_void,
        nFrameBufferDataSize: u32,
    ) -> bool,
    pub vr_IVRCameraComponent_SetCameraVideoStreamFormat: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nVideoStreamFormat: vr_ECameraVideoStreamFormat,
    ) -> bool,
    pub vr_IVRCameraComponent_GetCameraVideoStreamFormat:
        unsafe extern "C" fn(this: *mut vr_IVRCameraComponent) -> vr_ECameraVideoStreamFormat,
    pub vr_IVRCameraComponent_StartVideoStream:
        unsafe extern "C" fn(this: *mut vr_IVRCameraComponent) -> bool,
    pub vr_IVRCameraComponent_StopVideoStream:
        unsafe extern "C" fn(this: *mut vr_IVRCameraComponent),
    pub vr_IVRCameraComponent_IsVideoStreamActive: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        pbPaused: *mut bool,
        pflElapsedTime: *mut f32,
    ) -> bool,
    pub vr_IVRCameraComponent_GetVideoStreamFrame:
        unsafe extern "C" fn(
            this: *mut vr_IVRCameraComponent,
        ) -> *const vr_CameraVideoStreamFrame_t,
    pub vr_IVRCameraComponent_ReleaseVideoStreamFrame: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        pFrameImage: *const vr_CameraVideoStreamFrame_t,
    ),
    pub vr_IVRCameraComponent_SetAutoExposure:
        unsafe extern "C" fn(this: *mut vr_IVRCameraComponent, bEnable: bool) -> bool,
    pub vr_IVRCameraComponent_PauseVideoStream:
        unsafe extern "C" fn(this: *mut vr_IVRCameraComponent) -> bool,
    pub vr_IVRCameraComponent_ResumeVideoStream:
        unsafe extern "C" fn(this: *mut vr_IVRCameraComponent) -> bool,
    pub vr_IVRCameraComponent_GetCameraDistortion: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nCameraIndex: u32,
        flInputU: f32,
        flInputV: f32,
        pflOutputU: *mut f32,
        pflOutputV: *mut f32,
    ) -> bool,
    pub vr_IVRCameraComponent_GetCameraProjection: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nCameraIndex: u32,
        eFrameType: vr_EVRTrackedCameraFrameType,
        flZNear: f32,
        flZFar: f32,
        pProjection: *mut vr_HmdMatrix44_t,
    ) -> bool,
    pub vr_IVRCameraComponent_SetFrameRate: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nISPFrameRate: ::std::os::raw::c_int,
        nSensorFrameRate: ::std::os::raw::c_int,
    ) -> bool,
    pub vr_IVRCameraComponent_SetCameraVideoSinkCallback: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        pCameraVideoSinkCallback: *mut vr_ICameraVideoSinkCallback,
    ) -> bool,
    pub vr_IVRCameraComponent_GetCameraCompatibilityMode: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        pCameraCompatibilityMode: *mut vr_ECameraCompatibilityMode,
    ) -> bool,
    pub vr_IVRCameraComponent_SetCameraCompatibilityMode: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nCameraCompatibilityMode: vr_ECameraCompatibilityMode,
    ) -> bool,
    pub vr_IVRCameraComponent_GetCameraFrameBounds: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        eFrameType: vr_EVRTrackedCameraFrameType,
        pLeft: *mut u32,
        pTop: *mut u32,
        pWidth: *mut u32,
        pHeight: *mut u32,
    ) -> bool,
    pub vr_IVRCameraComponent_GetCameraIntrinsics: unsafe extern "C" fn(
        this: *mut vr_IVRCameraComponent,
        nCameraIndex: u32,
        eFrameType: vr_EVRTrackedCameraFrameType,
        pFocalLength: *mut vr_HmdVector2_t,
        pCenter: *mut vr_HmdVector2_t,
        peDistortionType: *mut vr_EVRDistortionFunctionType,
        rCoefficients: *mut f64,
    ) -> bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRCameraComponent {
    pub vtable_: *const vr_IVRCameraComponent__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRCameraComponent"][::std::mem::size_of::<vr_IVRCameraComponent>() - 8usize];
    ["Alignment of vr_IVRCameraComponent"]
        [::std::mem::align_of::<vr_IVRCameraComponent>() - 8usize];
};
pub const vr_IVRCameraComponent_Version: &[u8; 23] = b"IVRCameraComponent_003\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_TrackedDeviceDriverInfo_t {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct vr_IVRDriverContext__bindgen_vtable {
    pub vr_IVRDriverContext_GetGenericInterface:
        unsafe extern "C" fn(
            this: *mut vr_IVRDriverContext,
            pchInterfaceVersion: *const ::std::os::raw::c_char,
            peError: *mut vr_EVRInitError,
        ) -> *mut ::std::os::raw::c_void,
    pub vr_IVRDriverContext_GetDriverHandle:
        unsafe extern "C" fn(this: *mut vr_IVRDriverContext) -> vr_DriverHandle_t,
}
#[doc = " This interface is provided by vrserver to allow the driver to notify\n the system when something changes about a device. These changes must\n not change the serial number or class of the device because those values\n are permanently associated with the device's index."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverContext {
    pub vtable_: *const vr_IVRDriverContext__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverContext"][::std::mem::size_of::<vr_IVRDriverContext>() - 8usize];
    ["Alignment of vr_IVRDriverContext"][::std::mem::align_of::<vr_IVRDriverContext>() - 8usize];
};
#[repr(C)]
pub struct vr_IServerTrackedDeviceProvider__bindgen_vtable {
    pub vr_IServerTrackedDeviceProvider_Init: unsafe extern "C" fn(
        this: *mut vr_IServerTrackedDeviceProvider,
        pDriverContext: *mut vr_IVRDriverContext,
    ) -> vr_EVRInitError,
    pub vr_IServerTrackedDeviceProvider_Cleanup:
        unsafe extern "C" fn(this: *mut vr_IServerTrackedDeviceProvider),
    pub vr_IServerTrackedDeviceProvider_GetInterfaceVersions:
        unsafe extern "C" fn(
            this: *mut vr_IServerTrackedDeviceProvider,
        ) -> *const *const ::std::os::raw::c_char,
    pub vr_IServerTrackedDeviceProvider_RunFrame:
        unsafe extern "C" fn(this: *mut vr_IServerTrackedDeviceProvider),
    pub vr_IServerTrackedDeviceProvider_ShouldBlockStandbyMode:
        unsafe extern "C" fn(this: *mut vr_IServerTrackedDeviceProvider) -> bool,
    pub vr_IServerTrackedDeviceProvider_EnterStandby:
        unsafe extern "C" fn(this: *mut vr_IServerTrackedDeviceProvider),
    pub vr_IServerTrackedDeviceProvider_LeaveStandby:
        unsafe extern "C" fn(this: *mut vr_IServerTrackedDeviceProvider),
}
#[doc = " This interface must be implemented in each driver. It will be loaded in vrserver.exe"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IServerTrackedDeviceProvider {
    pub vtable_: *const vr_IServerTrackedDeviceProvider__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IServerTrackedDeviceProvider"]
        [::std::mem::size_of::<vr_IServerTrackedDeviceProvider>() - 8usize];
    ["Alignment of vr_IServerTrackedDeviceProvider"]
        [::std::mem::align_of::<vr_IServerTrackedDeviceProvider>() - 8usize];
};
pub const vr_IServerTrackedDeviceProvider_Version: &[u8; 33] =
    b"IServerTrackedDeviceProvider_004\0";
#[repr(C)]
pub struct vr_IVRWatchdogProvider__bindgen_vtable {
    pub vr_IVRWatchdogProvider_Init: unsafe extern "C" fn(
        this: *mut vr_IVRWatchdogProvider,
        pDriverContext: *mut vr_IVRDriverContext,
    ) -> vr_EVRInitError,
    pub vr_IVRWatchdogProvider_Cleanup: unsafe extern "C" fn(this: *mut vr_IVRWatchdogProvider),
}
#[doc = " This interface must be implemented in each driver. It will be loaded in vrclient.dll"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRWatchdogProvider {
    pub vtable_: *const vr_IVRWatchdogProvider__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRWatchdogProvider"][::std::mem::size_of::<vr_IVRWatchdogProvider>() - 8usize];
    ["Alignment of vr_IVRWatchdogProvider"]
        [::std::mem::align_of::<vr_IVRWatchdogProvider>() - 8usize];
};
pub const vr_IVRWatchdogProvider_Version: &[u8; 24] = b"IVRWatchdogProvider_001\0";
#[repr(C)]
pub struct vr_IVRCompositorPluginProvider__bindgen_vtable {
    pub vr_IVRCompositorPluginProvider_Init: unsafe extern "C" fn(
        this: *mut vr_IVRCompositorPluginProvider,
        pDriverContext: *mut vr_IVRDriverContext,
    ) -> vr_EVRInitError,
    pub vr_IVRCompositorPluginProvider_Cleanup:
        unsafe extern "C" fn(this: *mut vr_IVRCompositorPluginProvider),
    pub vr_IVRCompositorPluginProvider_GetInterfaceVersions:
        unsafe extern "C" fn(
            this: *mut vr_IVRCompositorPluginProvider,
        ) -> *const *const ::std::os::raw::c_char,
    pub vr_IVRCompositorPluginProvider_GetComponent:
        unsafe extern "C" fn(
            this: *mut vr_IVRCompositorPluginProvider,
            pchComponentNameAndVersion: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_void,
}
#[doc = " This is an optional interface drivers may implement. It will be loaded in vrcompositor.exe"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRCompositorPluginProvider {
    pub vtable_: *const vr_IVRCompositorPluginProvider__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRCompositorPluginProvider"]
        [::std::mem::size_of::<vr_IVRCompositorPluginProvider>() - 8usize];
    ["Alignment of vr_IVRCompositorPluginProvider"]
        [::std::mem::align_of::<vr_IVRCompositorPluginProvider>() - 8usize];
};
pub const vr_IVRCompositorPluginProvider_Version: &[u8; 32] = b"IVRCompositorPluginProvider_001\0";
#[doc = " This container is automatically created before a display redirect device is activated.\n Any properties in this container will be returned when that property is read from the HMD's\n property container."]
pub const vr_k_ulDisplayRedirectContainer: vr_PropertyContainerHandle_t = 25769803779;
pub const vr_EPropertyWriteType_PropertyWrite_Set: vr_EPropertyWriteType = 0;
pub const vr_EPropertyWriteType_PropertyWrite_Erase: vr_EPropertyWriteType = 1;
pub const vr_EPropertyWriteType_PropertyWrite_SetError: vr_EPropertyWriteType = 2;
pub type vr_EPropertyWriteType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_PropertyWrite_t {
    pub prop: vr_ETrackedDeviceProperty,
    pub writeType: vr_EPropertyWriteType,
    pub eSetError: vr_ETrackedPropertyError,
    pub pvBuffer: *mut ::std::os::raw::c_void,
    pub unBufferSize: u32,
    pub unTag: vr_PropertyTypeTag_t,
    pub eError: vr_ETrackedPropertyError,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_PropertyWrite_t"][::std::mem::size_of::<vr_PropertyWrite_t>() - 40usize];
    ["Alignment of vr_PropertyWrite_t"][::std::mem::align_of::<vr_PropertyWrite_t>() - 8usize];
    ["Offset of field: vr_PropertyWrite_t::prop"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, prop) - 0usize];
    ["Offset of field: vr_PropertyWrite_t::writeType"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, writeType) - 4usize];
    ["Offset of field: vr_PropertyWrite_t::eSetError"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, eSetError) - 8usize];
    ["Offset of field: vr_PropertyWrite_t::pvBuffer"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, pvBuffer) - 16usize];
    ["Offset of field: vr_PropertyWrite_t::unBufferSize"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, unBufferSize) - 24usize];
    ["Offset of field: vr_PropertyWrite_t::unTag"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, unTag) - 28usize];
    ["Offset of field: vr_PropertyWrite_t::eError"]
        [::std::mem::offset_of!(vr_PropertyWrite_t, eError) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_PropertyRead_t {
    pub prop: vr_ETrackedDeviceProperty,
    pub pvBuffer: *mut ::std::os::raw::c_void,
    pub unBufferSize: u32,
    pub unTag: vr_PropertyTypeTag_t,
    pub unRequiredBufferSize: u32,
    pub eError: vr_ETrackedPropertyError,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_PropertyRead_t"][::std::mem::size_of::<vr_PropertyRead_t>() - 32usize];
    ["Alignment of vr_PropertyRead_t"][::std::mem::align_of::<vr_PropertyRead_t>() - 8usize];
    ["Offset of field: vr_PropertyRead_t::prop"]
        [::std::mem::offset_of!(vr_PropertyRead_t, prop) - 0usize];
    ["Offset of field: vr_PropertyRead_t::pvBuffer"]
        [::std::mem::offset_of!(vr_PropertyRead_t, pvBuffer) - 8usize];
    ["Offset of field: vr_PropertyRead_t::unBufferSize"]
        [::std::mem::offset_of!(vr_PropertyRead_t, unBufferSize) - 16usize];
    ["Offset of field: vr_PropertyRead_t::unTag"]
        [::std::mem::offset_of!(vr_PropertyRead_t, unTag) - 20usize];
    ["Offset of field: vr_PropertyRead_t::unRequiredBufferSize"]
        [::std::mem::offset_of!(vr_PropertyRead_t, unRequiredBufferSize) - 24usize];
    ["Offset of field: vr_PropertyRead_t::eError"]
        [::std::mem::offset_of!(vr_PropertyRead_t, eError) - 28usize];
};
#[repr(C)]
pub struct vr_IVRProperties__bindgen_vtable {
    pub vr_IVRProperties_ReadPropertyBatch: unsafe extern "C" fn(
        this: *mut vr_IVRProperties,
        ulContainerHandle: vr_PropertyContainerHandle_t,
        pBatch: *mut vr_PropertyRead_t,
        unBatchEntryCount: u32,
    ) -> vr_ETrackedPropertyError,
    pub vr_IVRProperties_WritePropertyBatch: unsafe extern "C" fn(
        this: *mut vr_IVRProperties,
        ulContainerHandle: vr_PropertyContainerHandle_t,
        pBatch: *mut vr_PropertyWrite_t,
        unBatchEntryCount: u32,
    ) -> vr_ETrackedPropertyError,
    pub vr_IVRProperties_GetPropErrorNameFromEnum:
        unsafe extern "C" fn(
            this: *mut vr_IVRProperties,
            error: vr_ETrackedPropertyError,
        ) -> *const ::std::os::raw::c_char,
    pub vr_IVRProperties_TrackedDeviceToPropertyContainer:
        unsafe extern "C" fn(
            this: *mut vr_IVRProperties,
            nDevice: vr_TrackedDeviceIndex_t,
        ) -> vr_PropertyContainerHandle_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRProperties {
    pub vtable_: *const vr_IVRProperties__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRProperties"][::std::mem::size_of::<vr_IVRProperties>() - 8usize];
    ["Alignment of vr_IVRProperties"][::std::mem::align_of::<vr_IVRProperties>() - 8usize];
};
pub const vr_IVRProperties_Version: &[u8; 18] = b"IVRProperties_001\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_CVRPropertyHelpers {
    pub m_pProperties: *mut vr_IVRProperties,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_CVRPropertyHelpers"][::std::mem::size_of::<vr_CVRPropertyHelpers>() - 8usize];
    ["Alignment of vr_CVRPropertyHelpers"]
        [::std::mem::align_of::<vr_CVRPropertyHelpers>() - 8usize];
    ["Offset of field: vr_CVRPropertyHelpers::m_pProperties"]
        [::std::mem::offset_of!(vr_CVRPropertyHelpers, m_pProperties) - 0usize];
};
pub const vr_EVRScalarType_VRScalarType_Absolute: vr_EVRScalarType = 0;
pub const vr_EVRScalarType_VRScalarType_Relative: vr_EVRScalarType = 1;
pub type vr_EVRScalarType = ::std::os::raw::c_uint;
pub const vr_EVRScalarUnits_VRScalarUnits_NormalizedOneSided: vr_EVRScalarUnits = 0;
pub const vr_EVRScalarUnits_VRScalarUnits_NormalizedTwoSided: vr_EVRScalarUnits = 1;
pub type vr_EVRScalarUnits = ::std::os::raw::c_uint;
#[repr(C)]
pub struct vr_IVRDriverInput__bindgen_vtable {
    pub vr_IVRDriverInput_CreateBooleanComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulContainer: vr_PropertyContainerHandle_t,
        pchName: *const ::std::os::raw::c_char,
        pHandle: *mut vr_VRInputComponentHandle_t,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_UpdateBooleanComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulComponent: vr_VRInputComponentHandle_t,
        bNewValue: bool,
        fTimeOffset: f64,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_CreateScalarComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulContainer: vr_PropertyContainerHandle_t,
        pchName: *const ::std::os::raw::c_char,
        pHandle: *mut vr_VRInputComponentHandle_t,
        eType: vr_EVRScalarType,
        eUnits: vr_EVRScalarUnits,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_UpdateScalarComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulComponent: vr_VRInputComponentHandle_t,
        fNewValue: f32,
        fTimeOffset: f64,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_CreateHapticComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulContainer: vr_PropertyContainerHandle_t,
        pchName: *const ::std::os::raw::c_char,
        pHandle: *mut vr_VRInputComponentHandle_t,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_CreateSkeletonComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulContainer: vr_PropertyContainerHandle_t,
        pchName: *const ::std::os::raw::c_char,
        pchSkeletonPath: *const ::std::os::raw::c_char,
        pchBasePosePath: *const ::std::os::raw::c_char,
        eSkeletalTrackingLevel: vr_EVRSkeletalTrackingLevel,
        pGripLimitTransforms: *const vr_VRBoneTransform_t,
        unGripLimitTransformCount: u32,
        pHandle: *mut vr_VRInputComponentHandle_t,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_UpdateSkeletonComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulComponent: vr_VRInputComponentHandle_t,
        eMotionRange: vr_EVRSkeletalMotionRange,
        pTransforms: *const vr_VRBoneTransform_t,
        unTransformCount: u32,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_CreatePoseComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulContainer: vr_PropertyContainerHandle_t,
        pchName: *const ::std::os::raw::c_char,
        pHandle: *mut vr_VRInputComponentHandle_t,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_UpdatePoseComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulComponent: vr_VRInputComponentHandle_t,
        pMatPoseOffset: *const vr_HmdMatrix34_t,
        fTimeOffset: f64,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_CreateEyeTrackingComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulContainer: vr_PropertyContainerHandle_t,
        pchName: *const ::std::os::raw::c_char,
        pHandle: *mut vr_VRInputComponentHandle_t,
    ) -> vr_EVRInputError,
    pub vr_IVRDriverInput_UpdateEyeTrackingComponent: unsafe extern "C" fn(
        this: *mut vr_IVRDriverInput,
        ulComponent: vr_VRInputComponentHandle_t,
        pEyeTrackingData: *const vr_VREyeTrackingData_t,
        fTimeOffset: f64,
    ) -> vr_EVRInputError,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverInput {
    pub vtable_: *const vr_IVRDriverInput__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverInput"][::std::mem::size_of::<vr_IVRDriverInput>() - 8usize];
    ["Alignment of vr_IVRDriverInput"][::std::mem::align_of::<vr_IVRDriverInput>() - 8usize];
};
pub const vr_IVRDriverInput_Version: &[u8; 19] = b"IVRDriverInput_004\0";
#[repr(C)]
pub struct vr_IVRDriverLog__bindgen_vtable {
    pub vr_IVRDriverLog_Log: unsafe extern "C" fn(
        this: *mut vr_IVRDriverLog,
        pchLogMessage: *const ::std::os::raw::c_char,
    ),
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverLog {
    pub vtable_: *const vr_IVRDriverLog__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverLog"][::std::mem::size_of::<vr_IVRDriverLog>() - 8usize];
    ["Alignment of vr_IVRDriverLog"][::std::mem::align_of::<vr_IVRDriverLog>() - 8usize];
};
pub const vr_IVRDriverLog_Version: &[u8; 17] = b"IVRDriverLog_001\0";
#[repr(C)]
pub struct vr_IVRServerDriverHost__bindgen_vtable {
    pub vr_IVRServerDriverHost_TrackedDeviceAdded: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        pchDeviceSerialNumber: *const ::std::os::raw::c_char,
        eDeviceClass: vr_ETrackedDeviceClass,
        pDriver: *mut vr_ITrackedDeviceServerDriver,
    ) -> bool,
    pub vr_IVRServerDriverHost_TrackedDevicePoseUpdated: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        unWhichDevice: u32,
        newPose: *const vr_DriverPose_t,
        unPoseStructSize: u32,
    ),
    pub vr_IVRServerDriverHost_VsyncEvent:
        unsafe extern "C" fn(this: *mut vr_IVRServerDriverHost, vsyncTimeOffsetSeconds: f64),
    pub vr_IVRServerDriverHost_VendorSpecificEvent: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        unWhichDevice: u32,
        eventType: vr_EVREventType,
        eventData: *const vr_VREvent_Data_t,
        eventTimeOffset: f64,
    ),
    pub vr_IVRServerDriverHost_IsExiting:
        unsafe extern "C" fn(this: *mut vr_IVRServerDriverHost) -> bool,
    pub vr_IVRServerDriverHost_PollNextEvent: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        pEvent: *mut vr_VREvent_t,
        uncbVREvent: u32,
    ) -> bool,
    pub vr_IVRServerDriverHost_GetRawTrackedDevicePoses: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        fPredictedSecondsFromNow: f32,
        pTrackedDevicePoseArray: *mut vr_TrackedDevicePose_t,
        unTrackedDevicePoseArrayCount: u32,
    ),
    pub vr_IVRServerDriverHost_RequestRestart: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        pchLocalizedReason: *const ::std::os::raw::c_char,
        pchExecutableToStart: *const ::std::os::raw::c_char,
        pchArguments: *const ::std::os::raw::c_char,
        pchWorkingDirectory: *const ::std::os::raw::c_char,
    ),
    pub vr_IVRServerDriverHost_GetFrameTimings: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        pTiming: *mut vr_Compositor_FrameTiming,
        nFrames: u32,
    ) -> u32,
    pub vr_IVRServerDriverHost_SetDisplayEyeToHead: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        unWhichDevice: u32,
        eyeToHeadLeft: *const vr_HmdMatrix34_t,
        eyeToHeadRight: *const vr_HmdMatrix34_t,
    ),
    pub vr_IVRServerDriverHost_SetDisplayProjectionRaw: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        unWhichDevice: u32,
        eyeLeft: *const vr_HmdRect2_t,
        eyeRight: *const vr_HmdRect2_t,
    ),
    pub vr_IVRServerDriverHost_SetRecommendedRenderTargetSize: unsafe extern "C" fn(
        this: *mut vr_IVRServerDriverHost,
        unWhichDevice: u32,
        nWidth: u32,
        nHeight: u32,
    ),
}
#[doc = " This interface is provided by vrserver to allow the driver to notify\n the system when something changes about a device. These changes must\n not change the serial number or class of the device because those values\n are permanently associated with the device's index."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRServerDriverHost {
    pub vtable_: *const vr_IVRServerDriverHost__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRServerDriverHost"][::std::mem::size_of::<vr_IVRServerDriverHost>() - 8usize];
    ["Alignment of vr_IVRServerDriverHost"]
        [::std::mem::align_of::<vr_IVRServerDriverHost>() - 8usize];
};
pub const vr_IVRServerDriverHost_Version: &[u8; 24] = b"IVRServerDriverHost_006\0";
#[repr(C)]
pub struct vr_IVRCompositorDriverHost__bindgen_vtable {
    pub vr_IVRCompositorDriverHost_PollNextEvent: unsafe extern "C" fn(
        this: *mut vr_IVRCompositorDriverHost,
        pEvent: *mut vr_VREvent_t,
        uncbVREvent: u32,
    ) -> bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRCompositorDriverHost {
    pub vtable_: *const vr_IVRCompositorDriverHost__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRCompositorDriverHost"]
        [::std::mem::size_of::<vr_IVRCompositorDriverHost>() - 8usize];
    ["Alignment of vr_IVRCompositorDriverHost"]
        [::std::mem::align_of::<vr_IVRCompositorDriverHost>() - 8usize];
};
pub const vr_IVRCompositorDriverHost_Version: &[u8; 28] = b"IVRCompositorDriverHost_001\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_CVRHiddenAreaHelpers {
    pub m_pProperties: *mut vr_IVRProperties,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_CVRHiddenAreaHelpers"][::std::mem::size_of::<vr_CVRHiddenAreaHelpers>() - 8usize];
    ["Alignment of vr_CVRHiddenAreaHelpers"]
        [::std::mem::align_of::<vr_CVRHiddenAreaHelpers>() - 8usize];
    ["Offset of field: vr_CVRHiddenAreaHelpers::m_pProperties"]
        [::std::mem::offset_of!(vr_CVRHiddenAreaHelpers, m_pProperties) - 0usize];
};
#[repr(C)]
pub struct vr_IVRWatchdogHost__bindgen_vtable {
    pub vr_IVRWatchdogHost_WatchdogWakeUp:
        unsafe extern "C" fn(this: *mut vr_IVRWatchdogHost, eDeviceClass: vr_ETrackedDeviceClass),
}
#[doc = " This interface is provided by vrclient to allow the driver to make everything wake up"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRWatchdogHost {
    pub vtable_: *const vr_IVRWatchdogHost__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRWatchdogHost"][::std::mem::size_of::<vr_IVRWatchdogHost>() - 8usize];
    ["Alignment of vr_IVRWatchdogHost"][::std::mem::align_of::<vr_IVRWatchdogHost>() - 8usize];
};
pub const vr_IVRWatchdogHost_Version: &[u8; 20] = b"IVRWatchdogHost_002\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_PresentInfo_t {
    pub backbufferTextureHandle: vr_SharedTextureHandle_t,
    pub vsync: vr_EVSync,
    pub nFrameId: u64,
    pub flVSyncTimeInSeconds: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_PresentInfo_t"][::std::mem::size_of::<vr_PresentInfo_t>() - 32usize];
    ["Alignment of vr_PresentInfo_t"][::std::mem::align_of::<vr_PresentInfo_t>() - 8usize];
    ["Offset of field: vr_PresentInfo_t::backbufferTextureHandle"]
        [::std::mem::offset_of!(vr_PresentInfo_t, backbufferTextureHandle) - 0usize];
    ["Offset of field: vr_PresentInfo_t::vsync"]
        [::std::mem::offset_of!(vr_PresentInfo_t, vsync) - 8usize];
    ["Offset of field: vr_PresentInfo_t::nFrameId"]
        [::std::mem::offset_of!(vr_PresentInfo_t, nFrameId) - 16usize];
    ["Offset of field: vr_PresentInfo_t::flVSyncTimeInSeconds"]
        [::std::mem::offset_of!(vr_PresentInfo_t, flVSyncTimeInSeconds) - 24usize];
};
#[repr(C)]
pub struct vr_IVRVirtualDisplay__bindgen_vtable {
    pub vr_IVRVirtualDisplay_Present: unsafe extern "C" fn(
        this: *mut vr_IVRVirtualDisplay,
        pPresentInfo: *const vr_PresentInfo_t,
        unPresentInfoSize: u32,
    ),
    pub vr_IVRVirtualDisplay_WaitForPresent: unsafe extern "C" fn(this: *mut vr_IVRVirtualDisplay),
    pub vr_IVRVirtualDisplay_GetTimeSinceLastVsync: unsafe extern "C" fn(
        this: *mut vr_IVRVirtualDisplay,
        pfSecondsSinceLastVsync: *mut f32,
        pulFrameCounter: *mut u64,
    ) -> bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRVirtualDisplay {
    pub vtable_: *const vr_IVRVirtualDisplay__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRVirtualDisplay"][::std::mem::size_of::<vr_IVRVirtualDisplay>() - 8usize];
    ["Alignment of vr_IVRVirtualDisplay"][::std::mem::align_of::<vr_IVRVirtualDisplay>() - 8usize];
};
pub const vr_IVRVirtualDisplay_Version: &[u8; 22] = b"IVRVirtualDisplay_002\0";
#[repr(C)]
pub struct vr_IVRResources__bindgen_vtable {
    pub vr_IVRResources_LoadSharedResource: unsafe extern "C" fn(
        this: *mut vr_IVRResources,
        pchResourceName: *const ::std::os::raw::c_char,
        pchBuffer: *mut ::std::os::raw::c_char,
        unBufferLen: u32,
    ) -> u32,
    pub vr_IVRResources_GetResourceFullPath: unsafe extern "C" fn(
        this: *mut vr_IVRResources,
        pchResourceName: *const ::std::os::raw::c_char,
        pchResourceTypeDirectory: *const ::std::os::raw::c_char,
        pchPathBuffer: *mut ::std::os::raw::c_char,
        unBufferLen: u32,
    ) -> u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRResources {
    pub vtable_: *const vr_IVRResources__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRResources"][::std::mem::size_of::<vr_IVRResources>() - 8usize];
    ["Alignment of vr_IVRResources"][::std::mem::align_of::<vr_IVRResources>() - 8usize];
};
pub const vr_IVRResources_Version: &[u8; 17] = b"IVRResources_001\0";
pub type vr_IOBufferHandle_t = u64;
pub const vr_k_ulInvalidIOBufferHandle: u64 = 0;
pub const vr_EIOBufferError_IOBuffer_Success: vr_EIOBufferError = 0;
pub const vr_EIOBufferError_IOBuffer_OperationFailed: vr_EIOBufferError = 100;
pub const vr_EIOBufferError_IOBuffer_InvalidHandle: vr_EIOBufferError = 101;
pub const vr_EIOBufferError_IOBuffer_InvalidArgument: vr_EIOBufferError = 102;
pub const vr_EIOBufferError_IOBuffer_PathExists: vr_EIOBufferError = 103;
pub const vr_EIOBufferError_IOBuffer_PathDoesNotExist: vr_EIOBufferError = 104;
pub const vr_EIOBufferError_IOBuffer_Permission: vr_EIOBufferError = 105;
pub type vr_EIOBufferError = ::std::os::raw::c_uint;
pub const vr_EIOBufferMode_IOBufferMode_Read: vr_EIOBufferMode = 1;
pub const vr_EIOBufferMode_IOBufferMode_Write: vr_EIOBufferMode = 2;
pub const vr_EIOBufferMode_IOBufferMode_Create: vr_EIOBufferMode = 512;
pub type vr_EIOBufferMode = ::std::os::raw::c_uint;
#[repr(C)]
pub struct vr_IVRIOBuffer__bindgen_vtable {
    pub vr_IVRIOBuffer_Open: unsafe extern "C" fn(
        this: *mut vr_IVRIOBuffer,
        pchPath: *const ::std::os::raw::c_char,
        mode: vr_EIOBufferMode,
        unElementSize: u32,
        unElements: u32,
        pulBuffer: *mut vr_IOBufferHandle_t,
    ) -> vr_EIOBufferError,
    pub vr_IVRIOBuffer_Close: unsafe extern "C" fn(
        this: *mut vr_IVRIOBuffer,
        ulBuffer: vr_IOBufferHandle_t,
    ) -> vr_EIOBufferError,
    pub vr_IVRIOBuffer_Read: unsafe extern "C" fn(
        this: *mut vr_IVRIOBuffer,
        ulBuffer: vr_IOBufferHandle_t,
        pDst: *mut ::std::os::raw::c_void,
        unBytes: u32,
        punRead: *mut u32,
    ) -> vr_EIOBufferError,
    pub vr_IVRIOBuffer_Write: unsafe extern "C" fn(
        this: *mut vr_IVRIOBuffer,
        ulBuffer: vr_IOBufferHandle_t,
        pSrc: *mut ::std::os::raw::c_void,
        unBytes: u32,
    ) -> vr_EIOBufferError,
    pub vr_IVRIOBuffer_PropertyContainer: unsafe extern "C" fn(
        this: *mut vr_IVRIOBuffer,
        ulBuffer: vr_IOBufferHandle_t,
    ) -> vr_PropertyContainerHandle_t,
    pub vr_IVRIOBuffer_HasReaders:
        unsafe extern "C" fn(this: *mut vr_IVRIOBuffer, ulBuffer: vr_IOBufferHandle_t) -> bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRIOBuffer {
    pub vtable_: *const vr_IVRIOBuffer__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRIOBuffer"][::std::mem::size_of::<vr_IVRIOBuffer>() - 8usize];
    ["Alignment of vr_IVRIOBuffer"][::std::mem::align_of::<vr_IVRIOBuffer>() - 8usize];
};
pub const vr_IVRIOBuffer_Version: &[u8; 16] = b"IVRIOBuffer_002\0";
#[repr(C)]
pub struct vr_IVRDriverManager__bindgen_vtable {
    pub vr_IVRDriverManager_GetDriverCount:
        unsafe extern "C" fn(this: *const vr_IVRDriverManager) -> u32,
    pub vr_IVRDriverManager_GetDriverName: unsafe extern "C" fn(
        this: *mut vr_IVRDriverManager,
        nDriver: vr_DriverId_t,
        pchValue: *mut ::std::os::raw::c_char,
        unBufferSize: u32,
    ) -> u32,
    pub vr_IVRDriverManager_GetDriverHandle: unsafe extern "C" fn(
        this: *mut vr_IVRDriverManager,
        pchDriverName: *const ::std::os::raw::c_char,
    ) -> vr_DriverHandle_t,
    pub vr_IVRDriverManager_IsEnabled:
        unsafe extern "C" fn(this: *const vr_IVRDriverManager, nDriver: vr_DriverId_t) -> bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverManager {
    pub vtable_: *const vr_IVRDriverManager__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverManager"][::std::mem::size_of::<vr_IVRDriverManager>() - 8usize];
    ["Alignment of vr_IVRDriverManager"][::std::mem::align_of::<vr_IVRDriverManager>() - 8usize];
};
pub const vr_IVRDriverManager_Version: &[u8; 21] = b"IVRDriverManager_001\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_SpatialAnchorDriverPose_t {
    #[doc = " This position is in the same \"world\" space (+Y up) as provided by DriverPose_t."]
    pub qWorldRotation: vr_HmdQuaternion_t,
    pub vWorldTranslation: vr_HmdVector3d_t,
    #[doc = " The pose will automatically start returning VRSpatialAnchorError_NotAvailableInThisUniverse\n if this is nonzero and does not match the current universe ID."]
    pub ulRequiredUniverseId: u64,
    #[doc = " When this time expires, SteamVR will start generating\n VREvent_SpatialAnchors_RequestPoseUpdate when the pose is read by an application\n to let the driver know it is still worth updating.\n You can use this facility in several ways:\n   1. Set to -1 to never receive an update request for this pose.  The driver\n      may still update poses at any time.\n   2. Set to 0 to always receive an update request *after* each time the pose\n      is read.  The rate of requests could be very high if the application gets\n      the pose at framerate.\n   3. If the driver knows there is no reason to update the pose for some amount of\n      time, it can set that time here and receive the update request reminder later.\n   4. If the driver plans to automatically update this pose for some amount of time\n      (as it gets better information about the virtual location of this anchor) it can\n      set that duration here to indicate that no \"update requested\" reminders are needed.\n      When that automatic update period expires, any future interest in the pose will\n      be indicated by a pose update request.\n The driver may always update the pose, including during the valid duration."]
    pub fValidDuration: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_SpatialAnchorDriverPose_t"]
        [::std::mem::size_of::<vr_SpatialAnchorDriverPose_t>() - 72usize];
    ["Alignment of vr_SpatialAnchorDriverPose_t"]
        [::std::mem::align_of::<vr_SpatialAnchorDriverPose_t>() - 8usize];
    ["Offset of field: vr_SpatialAnchorDriverPose_t::qWorldRotation"]
        [::std::mem::offset_of!(vr_SpatialAnchorDriverPose_t, qWorldRotation) - 0usize];
    ["Offset of field: vr_SpatialAnchorDriverPose_t::vWorldTranslation"]
        [::std::mem::offset_of!(vr_SpatialAnchorDriverPose_t, vWorldTranslation) - 32usize];
    ["Offset of field: vr_SpatialAnchorDriverPose_t::ulRequiredUniverseId"]
        [::std::mem::offset_of!(vr_SpatialAnchorDriverPose_t, ulRequiredUniverseId) - 56usize];
    ["Offset of field: vr_SpatialAnchorDriverPose_t::fValidDuration"]
        [::std::mem::offset_of!(vr_SpatialAnchorDriverPose_t, fValidDuration) - 64usize];
};
#[repr(C)]
pub struct vr_IVRDriverSpatialAnchors__bindgen_vtable {
    pub vr_IVRDriverSpatialAnchors_UpdateSpatialAnchorPose:
        unsafe extern "C" fn(
            this: *mut vr_IVRDriverSpatialAnchors,
            unHandle: vr_SpatialAnchorHandle_t,
            pPose: *const vr_SpatialAnchorDriverPose_t,
        ) -> vr_EVRSpatialAnchorError,
    pub vr_IVRDriverSpatialAnchors_SetSpatialAnchorPoseError:
        unsafe extern "C" fn(
            this: *mut vr_IVRDriverSpatialAnchors,
            unHandle: vr_SpatialAnchorHandle_t,
            eError: vr_EVRSpatialAnchorError,
            fValidDuration: f64,
        ) -> vr_EVRSpatialAnchorError,
    pub vr_IVRDriverSpatialAnchors_UpdateSpatialAnchorDescriptor:
        unsafe extern "C" fn(
            this: *mut vr_IVRDriverSpatialAnchors,
            unHandle: vr_SpatialAnchorHandle_t,
            pchDescriptor: *const ::std::os::raw::c_char,
        ) -> vr_EVRSpatialAnchorError,
    pub vr_IVRDriverSpatialAnchors_GetSpatialAnchorPose:
        unsafe extern "C" fn(
            this: *mut vr_IVRDriverSpatialAnchors,
            unHandle: vr_SpatialAnchorHandle_t,
            pDriverPoseOut: *mut vr_SpatialAnchorDriverPose_t,
        ) -> vr_EVRSpatialAnchorError,
    pub vr_IVRDriverSpatialAnchors_GetSpatialAnchorDescriptor:
        unsafe extern "C" fn(
            this: *mut vr_IVRDriverSpatialAnchors,
            unHandle: vr_SpatialAnchorHandle_t,
            pchDescriptorOut: *mut ::std::os::raw::c_char,
            punDescriptorBufferLenInOut: *mut u32,
            bDecorated: bool,
        ) -> vr_EVRSpatialAnchorError,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_IVRDriverSpatialAnchors {
    pub vtable_: *const vr_IVRDriverSpatialAnchors__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRDriverSpatialAnchors"]
        [::std::mem::size_of::<vr_IVRDriverSpatialAnchors>() - 8usize];
    ["Alignment of vr_IVRDriverSpatialAnchors"]
        [::std::mem::align_of::<vr_IVRDriverSpatialAnchors>() - 8usize];
};
pub const vr_IVRDriverSpatialAnchors_Version: &[u8; 28] = b"IVRDriverSpatialAnchors_001\0";
#[repr(C)]
pub struct vr_IVRIPCResourceManagerClient__bindgen_vtable {
    pub vr_IVRIPCResourceManagerClient_NewSharedVulkanImage: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        nImageFormat: u32,
        nWidth: u32,
        nHeight: u32,
        bRenderable: bool,
        bMappable: bool,
        bComputeAccess: bool,
        unMipLevels: u32,
        unArrayLayerCount: u32,
        pSharedHandle: *mut vr_SharedTextureHandle_t,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_NewSharedVulkanBuffer: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        nSize: u32,
        nUsageFlags: u32,
        pSharedHandle: *mut vr_SharedTextureHandle_t,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_NewSharedVulkanSemaphore: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        bCounting: bool,
        pSharedHandle: *mut vr_SharedTextureHandle_t,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_RefResource: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        hSharedHandle: vr_SharedTextureHandle_t,
        pNewIpcHandle: *mut u64,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_UnrefResource: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        hSharedHandle: vr_SharedTextureHandle_t,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_GetDmabufFormats: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        pOutFormatCount: *mut u32,
        pOutFormats: *mut u32,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_GetDmabufModifiers: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        eApplicationType: vr_EVRApplicationType,
        unDRMFormat: u32,
        pOutModifierCount: *mut u32,
        pOutModifiers: *mut u64,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_ImportDmabuf: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        eApplicationType: vr_EVRApplicationType,
        pDmabufAttributes: *mut vr_DmabufAttributes_t,
        pSharedHandle: *mut vr_SharedTextureHandle_t,
    ) -> bool,
    pub vr_IVRIPCResourceManagerClient_ReceiveSharedFd: unsafe extern "C" fn(
        this: *mut vr_IVRIPCResourceManagerClient,
        ulIpcHandle: u64,
        pOutFd: *mut ::std::os::raw::c_int,
    ) -> bool,
}
#[repr(C)]
#[derive(Debug)]
pub struct vr_IVRIPCResourceManagerClient {
    pub vtable_: *const vr_IVRIPCResourceManagerClient__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_IVRIPCResourceManagerClient"]
        [::std::mem::size_of::<vr_IVRIPCResourceManagerClient>() - 8usize];
    ["Alignment of vr_IVRIPCResourceManagerClient"]
        [::std::mem::align_of::<vr_IVRIPCResourceManagerClient>() - 8usize];
};
pub const vr_IVRIPCResourceManagerClient_Version: &[u8; 32] = b"IVRIPCResourceManagerClient_002\0";
unsafe extern "C" {
    #[link_name = "\u{1}_ZN2vrL19k_InterfaceVersionsE"]
    pub static vr_k_InterfaceVersions: [*const ::std::os::raw::c_char; 13usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vr_COpenVRDriverContext {
    pub m_propertyHelpers: vr_CVRPropertyHelpers,
    pub m_hiddenAreaHelpers: vr_CVRHiddenAreaHelpers,
    pub m_pVRSettings: *mut vr_IVRSettings,
    pub m_pVRProperties: *mut vr_IVRProperties,
    pub m_pVRServerDriverHost: *mut vr_IVRServerDriverHost,
    pub m_pVRWatchdogHost: *mut vr_IVRWatchdogHost,
    pub m_pVRCompositorDriverHost: *mut vr_IVRCompositorDriverHost,
    pub m_pVRDriverLog: *mut vr_IVRDriverLog,
    pub m_pVRDriverManager: *mut vr_IVRDriverManager,
    pub m_pVRResources: *mut vr_IVRResources,
    pub m_pVRDriverInput: *mut vr_IVRDriverInput,
    pub m_pVRIOBuffer: *mut vr_IVRIOBuffer,
    pub m_pVRDriverSpatialAnchors: *mut vr_IVRDriverSpatialAnchors,
    pub m_pVRIPCResourceManager: *mut vr_IVRIPCResourceManagerClient,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vr_COpenVRDriverContext"]
        [::std::mem::size_of::<vr_COpenVRDriverContext>() - 112usize];
    ["Alignment of vr_COpenVRDriverContext"]
        [::std::mem::align_of::<vr_COpenVRDriverContext>() - 8usize];
    ["Offset of field: vr_COpenVRDriverContext::m_propertyHelpers"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_propertyHelpers) - 0usize];
    ["Offset of field: vr_COpenVRDriverContext::m_hiddenAreaHelpers"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_hiddenAreaHelpers) - 8usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRSettings"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRSettings) - 16usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRProperties"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRProperties) - 24usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRServerDriverHost"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRServerDriverHost) - 32usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRWatchdogHost"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRWatchdogHost) - 40usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRCompositorDriverHost"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRCompositorDriverHost) - 48usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRDriverLog"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRDriverLog) - 56usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRDriverManager"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRDriverManager) - 64usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRResources"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRResources) - 72usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRDriverInput"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRDriverInput) - 80usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRIOBuffer"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRIOBuffer) - 88usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRDriverSpatialAnchors"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRDriverSpatialAnchors) - 96usize];
    ["Offset of field: vr_COpenVRDriverContext::m_pVRIPCResourceManager"]
        [::std::mem::offset_of!(vr_COpenVRDriverContext, m_pVRIPCResourceManager) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDevice_T {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPhysicalDevice_T {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkInstance_T {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkQueue_T {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12Resource {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12CommandQueue {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct std_basic_string<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub _M_dataplus: std_basic_string__Alloc_hider,
    pub _M_string_length: std_basic_string_size_type,
    pub __bindgen_anon_1: std_basic_string__bindgen_ty_2<_CharT>,
}
pub type std_basic_string__Char_alloc_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string__Alloc_traits = __gnu_cxx___alloc_traits;
pub type std_basic_string_traits_type<_Traits> = _Traits;
pub type std_basic_string_value_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_allocator_type = std_basic_string__Char_alloc_type;
pub type std_basic_string_size_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_difference_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_reference = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_const_reference = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_const_pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std_basic_string_iterator = __gnu_cxx___normal_iterator<std_basic_string_pointer>;
pub type std_basic_string_const_iterator =
    __gnu_cxx___normal_iterator<std_basic_string_const_pointer>;
pub type std_basic_string_const_reverse_iterator =
    std_reverse_iterator<std_basic_string_const_iterator>;
pub type std_basic_string_reverse_iterator = std_reverse_iterator<std_basic_string_iterator>;
pub type std_basic_string___const_iterator = std_basic_string_const_iterator;
pub type std_basic_string___sv_type<_CharT> = std_basic_string_view<_CharT>;
pub type std_basic_string__If_sv = std_enable_if_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string___sv_wrapper<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub _M_sv: std_basic_string___sv_type<_CharT>,
}
#[repr(C)]
pub struct std_basic_string__Alloc_hider {
    pub _M_p: std_basic_string_pointer,
}
pub const std_basic_string__S_local_capacity: std_basic_string__bindgen_ty_1 = 0;
pub type std_basic_string__bindgen_ty_1 = i32;
#[repr(C)]
pub struct std_basic_string__bindgen_ty_2<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub _M_local_buf: __BindgenUnionField<*mut _CharT>,
    pub _M_allocated_capacity: __BindgenUnionField<std_basic_string_size_type>,
    pub bindgen_union_field: u64,
}
pub type std_string = std_basic_string<::std::os::raw::c_char>;
pub type std_streamoff = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug)]
pub struct std_fpos<_StateT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
    pub _M_off: std_streamoff,
    pub _M_state: _StateT,
}
pub type std_streampos = std_fpos<__mbstate_t>;
pub type std_integral_constant_value_type<_Tp> = _Tp;
pub type std_integral_constant_type = u8;
pub type std_true_type = u8;
pub type std_false_type = u8;
pub type std___enable_if_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___type_identity {
    pub _address: u8,
}
pub type std___type_identity_type<_Type> = _Type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___and_ {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_unsigned {
    pub _address: u8,
}
pub type std_make_unsigned_type = u8;
pub type std_enable_if_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___detector {
    pub _address: u8,
}
pub type std___detector_type<_Default> = _Default;
pub type std___detector___is_detected = std_false_type;
pub type std___detected_or = std___detector;
pub type std___detected_or_t = std___detected_or;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std___new_allocator {
    pub _address: u8,
}
pub type std___new_allocator_value_type<_Tp> = _Tp;
pub type std___new_allocator_size_type = usize;
pub type std___new_allocator_difference_type = isize;
pub type std___new_allocator_pointer<_Tp> = *mut _Tp;
pub type std___new_allocator_const_pointer<_Tp> = *const _Tp;
pub type std___new_allocator_reference<_Tp> = *mut _Tp;
pub type std___new_allocator_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___new_allocator_rebind {
    pub _address: u8,
}
pub type std___new_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std___allocator_base = std___new_allocator;
#[repr(C)]
#[derive(Debug)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator_value_type<_Tp> = _Tp;
pub type std_allocator_size_type = usize;
pub type std_allocator_difference_type = isize;
pub type std_allocator_pointer<_Tp> = *mut _Tp;
pub type std_allocator_const_pointer<_Tp> = *const _Tp;
pub type std_allocator_reference<_Tp> = *mut _Tp;
pub type std_allocator_const_reference<_Tp> = *const _Tp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = std_allocator;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std_allocator_is_always_equal = std_true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_iterator_category<_Category> = _Category;
pub type std_iterator_value_type<_Tp> = _Tp;
pub type std_iterator_difference_type<_Distance> = _Distance;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___iterator_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___undefined {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___get_first_arg {
    pub _address: u8,
}
pub type std___get_first_arg_type = std___undefined;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___replace_first_arg {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ptr_traits_elem {
    pub _address: u8,
}
pub type std___ptr_traits_elem_t = std___ptr_traits_elem;
pub type std___ptr_traits_ptr_to_pointer<_Ptr> = _Ptr;
pub type std___ptr_traits_ptr_to_element_type<_Elt> = _Elt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___ptr_traits_impl {
    pub _address: u8,
}
pub type std___ptr_traits_impl___diff_t = __BindgenOpaqueArray<u8, 0usize>;
pub type std___ptr_traits_impl___rebind = std___type_identity;
pub type std___ptr_traits_impl_pointer<_Ptr> = _Ptr;
pub type std___ptr_traits_impl_element_type<_Elt> = _Elt;
pub type std___ptr_traits_impl_difference_type = std___detected_or_t;
pub type std___ptr_traits_impl_rebind = std___detected_or_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator<_Iterator> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    pub current: _Iterator,
}
pub type std_reverse_iterator___traits_type = std_iterator_traits;
pub type std_reverse_iterator_iterator_type<_Iterator> = _Iterator;
pub type std_reverse_iterator_pointer = std_reverse_iterator___traits_type;
pub type std_reverse_iterator_difference_type = std_reverse_iterator___traits_type;
pub type std_reverse_iterator_reference = std_reverse_iterator___traits_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_traits_base {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___allocator_traits_base___rebind {
    pub _address: u8,
}
pub type std___allocator_traits_base___pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___c_pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___v_pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___cv_pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___pocca = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___pocma = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___pocs = __BindgenOpaqueArray<u8, 0usize>;
pub type std___allocator_traits_base___equal = std___type_identity;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std___allocator_traits_base"]
        [::std::mem::size_of::<std___allocator_traits_base>() - 1usize];
    ["Alignment of std___allocator_traits_base"]
        [::std::mem::align_of::<std___allocator_traits_base>() - 1usize];
};
pub type std___alloc_rebind = std___allocator_traits_base;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub type std_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std_allocator_traits_value_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_allocator_traits_pointer = std___detected_or_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits__Ptr {
    pub _address: u8,
}
pub type std_allocator_traits__Ptr_type = __BindgenOpaqueArray<u8, 0usize>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits__Diff {
    pub _address: u8,
}
pub type std_allocator_traits__Diff_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits__Size {
    pub _address: u8,
}
pub type std_allocator_traits_const_pointer = __BindgenOpaqueArray<u8, 0usize>;
pub type std_allocator_traits_void_pointer = std_allocator_traits__Ptr;
pub type std_allocator_traits_const_void_pointer = std_allocator_traits__Ptr;
pub type std_allocator_traits_difference_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_allocator_traits_size_type = __BindgenOpaqueArray<u8, 0usize>;
pub type std_allocator_traits_propagate_on_container_copy_assignment = std___detected_or_t;
pub type std_allocator_traits_propagate_on_container_move_assignment = std___detected_or_t;
pub type std_allocator_traits_propagate_on_container_swap = std___detected_or_t;
pub type std_allocator_traits_is_always_equal = std___detected_or_t;
pub type std_allocator_traits_rebind_alloc = std___alloc_rebind;
pub type std_allocator_traits_rebind_traits = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits___construct_helper {
    pub _address: u8,
}
pub type std_allocator_traits___construct_helper_type<_Alloc> = _Alloc;
pub type std_allocator_traits___has_construct = std_allocator_traits___construct_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string_view<_CharT> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    pub _M_len: usize,
    pub _M_str: *const _CharT,
}
pub type std_basic_string_view_traits_type<_Traits> = _Traits;
pub type std_basic_string_view_value_type<_CharT> = _CharT;
pub type std_basic_string_view_pointer<_CharT> = *mut std_basic_string_view_value_type<_CharT>;
pub type std_basic_string_view_const_pointer<_CharT> =
    *const std_basic_string_view_value_type<_CharT>;
pub type std_basic_string_view_reference<_CharT> = *mut std_basic_string_view_value_type<_CharT>;
pub type std_basic_string_view_const_reference<_CharT> =
    *const std_basic_string_view_value_type<_CharT>;
pub type std_basic_string_view_const_iterator<_CharT> =
    *const std_basic_string_view_value_type<_CharT>;
pub type std_basic_string_view_iterator<_CharT> = std_basic_string_view_const_iterator<_CharT>;
pub type std_basic_string_view_const_reverse_iterator<_CharT> =
    std_reverse_iterator<std_basic_string_view_const_iterator<_CharT>>;
pub type std_basic_string_view_reverse_iterator<_CharT> =
    std_basic_string_view_const_reverse_iterator<_CharT>;
pub type std_basic_string_view_size_type = usize;
pub type std_basic_string_view_difference_type = isize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx__Char_types {
    pub _address: u8,
}
pub type __gnu_cxx__Char_types_int_type = ::std::os::raw::c_ulong;
pub type __gnu_cxx__Char_types_pos_type = std_streampos;
pub type __gnu_cxx__Char_types_off_type = std_streamoff;
pub type __gnu_cxx__Char_types_state_type = __mbstate_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx_char_traits {
    pub _address: u8,
}
pub type __gnu_cxx_char_traits_char_type<_CharT> = _CharT;
pub type __gnu_cxx_char_traits_int_type = __gnu_cxx__Char_types;
pub type __gnu_cxx_char_traits_pos_type = __gnu_cxx__Char_types;
pub type __gnu_cxx_char_traits_off_type = __gnu_cxx__Char_types;
pub type __gnu_cxx_char_traits_state_type = __gnu_cxx__Char_types;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___normal_iterator<_Iterator> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    pub _M_current: _Iterator,
}
pub type __gnu_cxx___normal_iterator___traits_type = std_iterator_traits;
pub type __gnu_cxx___normal_iterator___convertible_from = std___enable_if_t;
pub type __gnu_cxx___normal_iterator_iterator_type<_Iterator> = _Iterator;
pub type __gnu_cxx___normal_iterator_iterator_category = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_value_type = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_difference_type = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_reference = __gnu_cxx___normal_iterator___traits_type;
pub type __gnu_cxx___normal_iterator_pointer = __gnu_cxx___normal_iterator___traits_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___alloc_traits {
    pub _address: u8,
}
pub type __gnu_cxx___alloc_traits_allocator_type<_Alloc> = _Alloc;
pub type __gnu_cxx___alloc_traits__Base_type = std_allocator_traits;
pub type __gnu_cxx___alloc_traits_value_type = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_pointer = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_const_pointer = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_size_type = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_difference_type = __gnu_cxx___alloc_traits__Base_type;
pub type __gnu_cxx___alloc_traits_reference = *mut __gnu_cxx___alloc_traits_value_type;
pub type __gnu_cxx___alloc_traits_const_reference = *const __gnu_cxx___alloc_traits_value_type;
pub type __gnu_cxx___alloc_traits___is_custom_pointer = std___and_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___alloc_traits_rebind {
    pub _address: u8,
}
pub type __gnu_cxx___alloc_traits_rebind_other = __gnu_cxx___alloc_traits__Base_type;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_basic_string_open0_char_std_char_traits_open1_char_close1_std_allocator_open1_char_close1_close0"] [:: std :: mem :: size_of :: < std_basic_string < :: std :: os :: raw :: c_char > > () - 32usize] ;
    ["Align of template specialization: std_basic_string_open0_char_std_char_traits_open1_char_close1_std_allocator_open1_char_close1_close0"] [:: std :: mem :: align_of :: < std_basic_string < :: std :: os :: raw :: c_char > > () - 8usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_allocator_open0_char_close0"]
        [::std::mem::size_of::<std_allocator>() - 1usize];
    ["Align of template specialization: std_allocator_open0_char_close0"]
        [::std::mem::align_of::<std_allocator>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_ty_2 {
    pub _address: u8,
}
